[{"id": 437113936, "text": "SweepCast observed: $MSFT with Unusual Options Activity Alerted on $300 CALL Expiring: 03/18/2022 worth 40K🐂  Check out Premium Room or SweepCast.com", "time": 1645124927.0, "sentiment": ""}, {"id": 437110577, "text": "my top list for today $AAPL $MU $QCOM $MSFT  $SPY here is a vid on my trigger levels and targets.. manage risk and lever let a green trade go red https://twitter.com/RealJuicyTradez/status/1494142139441332226?s=20&amp;t=Ix41QCcmuXUadJ0sMdJZag", "time": 1645124206.0, "sentiment": ""}, {"id": 437109308, "text": "$SPY $TSLA $AAPL $MSFT $AMZN \nFutes ripping", "time": 1645123855.0, "sentiment": "Bullish"}, {"id": 437105941, "text": "$XELA is going to launch its rockets today. Hold on. $TSLA  $AAPL $AMZN $MSFT", "time": 1645122902.0, "sentiment": "Bullish"}, {"id": 437099689, "text": "$RBLX Goldman Sachs keeps Buy rating at $108. $AMZN $AAPL $MSFT", "time": 1645120949.0, "sentiment": "Bullish"}, {"id": 437099371, "text": "$MRIN 💎💎✅✅\n9/21/21 Revenue agreement with $GOOG \n1/6/22 Announces DSP integration with $AMZN \n1/12/22 Added support for $MSFT  LinkedIn marketing solutions \n2/16/22 TikTok advertising integration \n2/24/22 Q4 and conference call after market.", "time": 1645120861.0, "sentiment": "Bullish"}, {"id": 437095708, "text": "$AAPL seems the only money I’m making here is in 1 account I buy under 169 and sell at 172 rinse and repeat. same with $MSFT buy under 295 sell at 300.", "time": 1645112923.0, "sentiment": ""}, {"id": 437094133, "text": "$AAPL $MSFT $SPY $QQQ \n\nStocks cracks starting to appear … too many individual investors , no unity, each country wants their own. Stocks going much lower.. I think apple drops down to 125 and Microsoft down to 150", "time": 1645111060.0, "sentiment": "Bearish"}, {"id": 437092463, "text": "$FSLY (open my 1D chart for details) It&#39;s getting interesting again, as I have been waiting for a new position and posted multiple updated charts here over the months to scale in again possibly in the low 20s. I rode the previous markup from avg 14s and scaled out at 110-119s: after Distribution was clear. I posted then also the gap will be closed overtime. PM action looks like final shakeout \nWHY?: Look down at the WEEKLY STOCHRS + overall structure (DAILY CHART) \n- Previous upswing from &quot;ST in B&quot; to SOW was Bullish Divergence as expected in line with that upswing and after creating a lower low. \n- Now HIDDEN bullish divergence with a crash down to shakeout retail. If we see a quick recovery above Fib 0.618 then this is a confirmed spring to backtest and flip the breakout of the red downtrend resistance slope into a support. Confirmation is key. \n \nIn July already I posted charts to wait for confirmations before going long in FSLY \n \nhttps://stocktwits.com/MLinv/message/358725667 \n \n$NET $MSFT $LLNW $AKAM", "time": 1645108909.0, "sentiment": ""}, {"id": 437092212, "text": "$FB $MSFT $MANA.X $SAND.X $RBLX \n💯\nCompanies Are Spending Billions on a Metaverse That Makes No Sense\n\nhttps://www.bloomberg.com/news/newsletters/2022-02-11/the-metaverse-makes-no-sense-and-here-s-why", "time": 1645108530.0, "sentiment": ""}, {"id": 437087786, "text": "Thread 🧵 perspective on $NVDA &amp; replies to @jimcramer \n\n$AMD ↗️\n\n$AAPL $TSLA $MSFT  https://twitter.com/jimcramer/status/1494062905687527429?s=12", "time": 1645103003.0, "sentiment": ""}, {"id": 437086497, "text": "$SOFI All the ‘ savings ‘ lately going into SOFI $MSFT $ENPH $ABNB $GOOGL", "time": 1645101703.0, "sentiment": "Bullish"}, {"id": 437084056, "text": "$MSFT Volatility is King!! Simulated Weekly $295.0 CALLS for Thursday&#39;s open on StockOrbit. \n https://apps.apple.com/us/app/stockorbit/id1541560646", "time": 1645099434.0, "sentiment": ""}, {"id": 437083209, "text": "$SPY $AAPL $MSFT $AMZN Putin playing ‘red light, green light’ with the economies of the world rn 😂", "time": 1645098792.0, "sentiment": ""}, {"id": 437082480, "text": "$FB these kids need to stop bashing facebook for &quot;privacy violation&quot;. Facebook does not violate privacy any more than $GOOGL , $AAPL , $MSFT  or $AMZN .", "time": 1645098230.0, "sentiment": "Bullish"}, {"id": 437076480, "text": "$MSFT picking up extra shares for the long hold.", "time": 1645094590.0, "sentiment": "Bullish"}, {"id": 437068186, "text": "$GME $MSFT", "time": 1645091076.0, "sentiment": "Bullish"}, {"id": 437066105, "text": "$NVDA $MSFT  2 of the greatest stocks.  Which one has more upside? Microsoft below $300 or NVDA below $250?  Waiting till Russia invades and then put capital into one or both of these. \n \nhttps://youtu.be/tz_rBZ0bYVQ", "time": 1645090212.0, "sentiment": "Bullish"}, {"id": 437066014, "text": "$QS all you need to know is $MSFT and $VWAGY are the main guys here. Quantumscape will not fail. Bill gates will find a way, no matter what you think of him.", "time": 1645090175.0, "sentiment": ""}, {"id": 437065665, "text": "$BTC.X $ETH.X $DOGE.X \n\nMaybe he&#39;s against crypto because he can&#39;t get insider info on it. \nLike on $MSFT \n\nhttps://www.marketwatch.com/story/charlie-munger-compares-crypto-to-venereal-disease-warns-of-inflation-danger-11645056607", "time": 1645090035.0, "sentiment": "Bullish"}, {"id": 437063837, "text": "$MSFT Microsoft Option Alert: Jun 17 $295 Calls at the Bid: 15 vs 1528 OI🐂 |🥇 Learn more and get details on  ➡️ SweepCast.com", "time": 1645089313.0, "sentiment": ""}, {"id": 437061896, "text": "Having a great Feb and I hope you are too! Just simply trading my supply and demand zones has lead to an 18 and 1 month and I am holding some $SPY puts for next week. Also traded $AMZN $MSFT $FB and $BA. You can follow along on optionsforecast4u.com", "time": 1645088547.0, "sentiment": ""}, {"id": 437061815, "text": "$MSFT Volatility is King!! Simulated Weekly $295.0 CALLS for Thursday&#39;s open on StockOrbit. \n https://apps.apple.com/us/app/stockorbit/id1541560646", "time": 1645088512.0, "sentiment": ""}, {"id": 437061088, "text": "@Stock__Twists @Uncle_Covid @Oliwood @ShantP21 @YabaDabaBOOM @AllJackedUp @Jamz83 @Rucer517 @denseanddumb @grifmaster  \n \n$FB $MSFT $ANET  \n \nJust as a quick follow-up. What percentage of that do you think spills into 2023, if let’s say, Microsoft is delayed in terms of -- or back-end weighted in terms of building out 400 gig in their data centers this year? \n \n \nProbably hard to model all the volatility we have with supply. I think, right now, demand is strong. So it’s really tied to supply of products. And these customers have enough other ways they can figure how to deploy technology if they give them enough heads up. So, that’s lesser of a concern right now.", "time": 1645088227.0, "sentiment": ""}, {"id": 437061066, "text": "@Stock__Twists @Uncle_Covid @Oliwood @ShantP21 @YabaDabaBOOM @AllJackedUp @Jamz83 @Rucer517 @denseanddumb @grifmaster  \n \n$FB $MSFT $ANET  \n \n \n \nJayshree, if we could look further out, one concern that quite a number of investors have is the runway for both Microsoft and Facebook, and the respective 400-gig and 200-gig builds. And I recognize the world is probably not nearly as binary as many of us in the investment community think. But any insight you could share on the runway for those bills and on what’s next, assuming that at some point they hit peak levels flatten out and eventually roll over? \n \n \nWell, look, we’re used to volatility from our Cloud Titan customers. We experienced the highs of 2018 and then the lows of 2019 and ‘20. So, we’re in a period where the Cloud Titans are clearly investing from a CapEx. And increasingly, we are more directly correlated to their network CapEx. Anshul, do you want to shed more light on that?", "time": 1645088221.0, "sentiment": ""}, {"id": 437060413, "text": "@Stock__Twists @Uncle_Covid @Oliwood @ShantP21 @YabaDabaBOOM @AllJackedUp @Jamz83 @Rucer517 @denseanddumb @grifmaster  \n \n$FB $MSFT $ANET  \n \nOur cloud business continues to be strong. In 2021, we successfully transitioned from prototype to trials to production on our latest products for 100 gig, 200 gig and 400 gig. The Arista 7800 is now deployed at scale for data center spine, PCI and regional spines and AI spine clusters. The Arista 7388, which we co-developed with Meta and announced at OCP, November last year, is also now running successfully in production data centers. We not only continue to do well in existing use cases, but are also winning in new areas like WAN and Cloud Edge. \n \nFeedback from our largest customers is consistent. Arista products are easier to work with and have far fewer issues than competition. While there is often speculation about share shifts in some of our use cases, demand for our products from these Cloud Titans remains healthy.", "time": 1645087987.0, "sentiment": ""}, {"id": 437060258, "text": "@Stock__Twists @Uncle_Covid @Oliwood @ShantP21 @YabaDabaBOOM @AllJackedUp @Jamz83 @Rucer517 @denseanddumb @grifmaster  \n \n&quot;In terms of Q4 2021 verticals, Cloud Titans was our largest vertical, followed by the enterprise, followed by the specialty cloud providers at third place, financials at fourth place and service providers at fifth place. All the verticals grew well at double-digit percentages in 2021. \n \nShifting to annual sector revenue for the year in 2021. Cloud Titans registered approximately 30% of the revenue, enterprise and financials came in at approximately 40%, and the providers at approximately 30%. Microsoft was the only greater than 10% customer at a 15% contribution. We do expect Meta, formerly Facebook, to become our second 10% revenue customer in 2022, as we improve lead time.&quot; \n \n$FB $MSFT $ANET  \n \nhttps://seekingalpha.com/article/4486943-arista-networks-inc-anet-ceo-jayshree-ullal-on-q4-2021-results-earnings-call-transcript", "time": 1645087927.0, "sentiment": ""}, {"id": 437058185, "text": "$SPY $AAPL $IWM $MSFT $QQQ", "time": 1645087156.0, "sentiment": ""}, {"id": 437055510, "text": "$FB Will Berkshire open a position? Maybe Todd Combs or Ted Weschler would be interested? \n\nThe fundamentals and valuation of $FB remind me of $ATVI before the $MSFT buyout.", "time": 1645086155.0, "sentiment": "Bullish"}, {"id": 437055440, "text": "$AABB Since $AAPL &amp; $MSFT were both started in small garages during their infancy stages and $AMD was OTC initially I am very bullish on the recent $AABB Corporate update which also states the company plans on up listing to a MAJOR EXCHANGE this is like buying $AAPL $MSFT $AMD $TSLA during their infancy stages because $AABB has Record Profits/Record Gold/100M+ in assets/Global Exchange/No Debt/Share retirements/Dividends/213 trading pairs featuring AABBG.X Gold backed cryptocurrency coin (mine to token) The first to Market Global Gold currency system. NOW lets not overlook the Volume in 2021 was 12B with 5.34B shares sold short with the estimation of 4 Billion uncovered &#39;&#39;naked short&#39;&#39; shares. That&#39;s exactly how VYGVF went from .17-$29 in 6 mo&#39;s the market makers heavily shorted VYGVF and the charts on AABB &amp; VYGVF are almost identical. X20-X50 Coming to $AABB in a 2022 the MOASS! https://finance.yahoo.com/news/asia-broadband-corporate-173900628.html", "time": 1645086136.0, "sentiment": "Bullish"}]