[{"id": 437205983, "text": "@SEVENXStheGOAT $spy Moron Biden and his democratic party are the reasons for the surge in oil  prices.  Idiots destroyed our energy independence in the name of climate change and are now at the mercy of OPEC and Russia. Pathetic President in every way possible. $qqq $aapl $msft  $AMZN", "time": 1645138592.0, "sentiment": ""}, {"id": 437202488, "text": "$MSFT rate hikes. 1percent by July haha.  Keep living in fear.", "time": 1645138104.0, "sentiment": "Bullish"}, {"id": 437201490, "text": "$MSFT NEW ARTICLE : Machine Learning Breakthroughs Have Sparked the AI Revolution https://www.stck.pro/news/MSFT/23057295", "time": 1645137966.0, "sentiment": ""}, {"id": 437198430, "text": "if $MSFT closes above $300 today, I&#39;ll wear a dog as a toupee to my sons wedding next month", "time": 1645137518.0, "sentiment": "Bullish"}, {"id": 437198332, "text": "8 Software Stocks to Snap Up After the Sharp Selloff. As the market continues to cool, an opportunity has opened up in stocks like $MSFT and $NFLX. \nhttps://investorplace.com/2022/02/8-software-stocks-to-snap-up-after-the-sharp-selloff/", "time": 1645137502.0, "sentiment": ""}, {"id": 437197856, "text": "$MSFT Just start bombing and get it over with!", "time": 1645137435.0, "sentiment": "Bullish"}, {"id": 437194316, "text": "$MRIN Multi day runner  going into earnings 2/24/2022.  \nInsane Volume!! Tiny float and a lot of cash!!!  \nLet&#39;s GO!!! 💎💎✅✅    \n9/21/21 Revenue agreement with $GOOG    \n1/6/22 Announces DSP integration with  $AMZN     \n1/12/22 Added support for  $MSFT LinkedIn marketing solutions     \n2/16/22 TikTok advertising integration     \n2/24/22 Q4 and conference call after market.", "time": 1645136920.0, "sentiment": "Bullish"}, {"id": 437193167, "text": "If $MSFT closes above $300 today, I&#39;ll shave my head", "time": 1645136762.0, "sentiment": "Bullish"}, {"id": 437190513, "text": "BZ Chart Of The Day: Are Remorseful Buyers Selling Microsoft? https://www.benzinga.com/trading-ideas/technicals/22/02/25692259/bz-chart-of-the-day-are-remorseful-buyers-selling-microsoft#.Yg51lhF1o3A.twitter $MSFT", "time": 1645136392.0, "sentiment": ""}, {"id": 437189365, "text": "$MSFT Anything below 40RSI is a solid long term add. Even in the 2008 stock market crash this didn&#39;t get below 33RSI so don&#39;t expect a huge crash unless WW3 happens. I&#39;m building up my core position around 280 if it can get there", "time": 1645136236.0, "sentiment": ""}, {"id": 437189072, "text": "$MSFT Dumping portfolio will jump back in in 2023", "time": 1645136196.0, "sentiment": ""}, {"id": 437188766, "text": "$MSFT while waiting for stocks to go into to free fall it occurred to me. Americans should be ashamed that we now live in a place where people are afraid to speak their minds out of fear of being cancelled, attacked, etc. The women in Afghanistan might have more freedom to express their opinions without the fear of retaliation than Americans do.  \n \nJust something to think about as we await the stock market crash… \n$QQQ", "time": 1645136151.0, "sentiment": ""}, {"id": 437188074, "text": "$MSFT Microsoft Option Alert: Jan 2024 $350 Puts Sweep (4) near the Bid: 13 vs 1010 OI🐻 |🥇 Learn more and get details on  ➡️ SweepCast.com", "time": 1645136053.0, "sentiment": ""}, {"id": 437184450, "text": "$SPY Please, big dogs fall so we can bottom. Won&#39;t ever bottom till that happens, faster the better $MSFT $GOOG $AAPL", "time": 1645135575.0, "sentiment": "Bearish"}, {"id": 437184187, "text": "$SPY Market won&#39;t bottom tilll big dogs falls . MSFT, GOOG, AAPL $MSFT $goog", "time": 1645135539.0, "sentiment": "Bearish"}, {"id": 437183941, "text": "$ABNB  ROI was awesome, for the run up to  DUMP on Dumb Money ( in my MM&#39;s voice)..$FB $GOOG $MSFT", "time": 1645135501.0, "sentiment": "Bullish"}, {"id": 437182317, "text": "$MSFT Biden and the clowns in Washington are trying to make it seem more dire to us and our markets, as well as make it seem like they are making a difference... He said, &quot;we are not immune to a war over there. This could increase energy prices.&quot;  Yeah - not nearly as much as Joe and his clowns have done over the past 12 months.", "time": 1645135284.0, "sentiment": "Bullish"}, {"id": 437179938, "text": "$MSFT Too much air in this crap need to burst fking manipulated market", "time": 1645134969.0, "sentiment": "Bearish"}, {"id": 437179867, "text": "$MSFT  honestly I just don’t understand US foreign policy. It makes zero sense whatsoever. Now we are using the taxpayers money to send weapons to Ukraine? And for what? To end up in Russias hands? Seems we would have learned a lesson after 2 decades in Afghanistan but nope! Who is pulling Bidens strings 🤔 $QQQ", "time": 1645134961.0, "sentiment": "Bearish"}, {"id": 437178329, "text": "$MSFT Biden says that Russia will invade Ukraine within days but he’s been saying this for almost a month now 🤔 Give peace a chance? Apparently not! Bidens mind is already made up to what the outcome will be! $QQQ", "time": 1645134764.0, "sentiment": "Bearish"}, {"id": 437176069, "text": "$MSFT Market has become truly insane... overloaded fearmongering will go away eventually... just a matter of time... no logical reason for this to be below $300", "time": 1645134475.0, "sentiment": "Bullish"}, {"id": 437174812, "text": "$MSFT if this keeps holding 293.42 this will close above $310 tomorrow", "time": 1645134310.0, "sentiment": ""}, {"id": 437174479, "text": "$MSFT i need 317 by next friday", "time": 1645134268.0, "sentiment": ""}, {"id": 437174303, "text": "$MSFT after reading Russias response to the US it certainly looks very likely now that an invasion is in the cards 🤔 Well, Putin has called our bluff! He’s been doing it since Obama was president. The West is weak and he knows it too!", "time": 1645134247.0, "sentiment": "Bearish"}, {"id": 437173162, "text": "$MSFT consistent rejection on the 5-14 EMA.", "time": 1645134095.0, "sentiment": "Bearish"}, {"id": 437172374, "text": "$MSFT shame on you $MSFT and $AAPL, we have the best of the $AXP .. unscratched during all the turbulence for the past 1 month… 💪💪💪", "time": 1645133990.0, "sentiment": ""}, {"id": 437171741, "text": "$MSFT Joe Biden is a warmonger? Give peace a chance! $QQQ", "time": 1645133902.0, "sentiment": "Bearish"}, {"id": 437165926, "text": "$MSFT flirting with breaking its 200day decisively.  \n \n$GOOGL as well. If $AAPL $TSLA and $GOOGL  break their previous day lows it can get ugly.", "time": 1645133157.0, "sentiment": ""}, {"id": 437165167, "text": "$MSFT loser bulls of $MAFT , $NVDA, $AAPL can buy $AXP imo\n\nShane on you!", "time": 1645133054.0, "sentiment": "Bearish"}, {"id": 437164898, "text": "$MSFT Maybe Putin just enjoys dicking with our markets. Look guys! I move my tanks away from Ukraine and US markets go up - Then I move them towards Ukraine and US markets go down. Are he and his buddies swingtrading this or what?   \n \n(P.S. I&#39;m not minimizing the very serious threat Putin poses to the safety of the people of Ukraine, and I&#39;m very much hoping that US+EU diplomacy and threats of sanctions together with Ukraine&#39;s defenses can push him back).", "time": 1645133022.0, "sentiment": ""}]