[{"id": 438144592, "text": "$MSFT 🍀🍀Stay Strong🍀🍀 Long term Target $350.00🍀🍀🔥🔥🎯", "time": 1645518736.0, "sentiment": "Bullish"}, {"id": 438140803, "text": "$MSFT Microsoft has the worst technicals of all the names I follow. Msft could drop 15% over the next few weeks. Inflation is a huge problem and people are only looking at Russia.  Russia is Canada VS inflation. Inflation is a systemic problem and the FOMC doesn’t seem committed while buying  into MMT", "time": 1645517305.0, "sentiment": ""}, {"id": 438139215, "text": "$SPY Putin annex wealthy Ukraine like annex Manhattan. Sanctions mean squat in long run. Invasion is 100% happening esp with weak Brandon RIP $ARKK $NVDA  $MSFT", "time": 1645516686.0, "sentiment": "Bearish"}, {"id": 438136569, "text": "Watchlist for the week 🚨 pt 2 \n\n(Short watchlist) 📉 \n\n$RIOT $MARA $COIN BTC broke below 40K which is no good to this stocks plus they were forming a bearish flag on the daily which got confirmed on Friday when the broke down. \n\n$MSFT broke below the daily 200MA. 280 needs to hold, if not it will break below the rising channels it’s been in since 2020 and could go back to 260 which is where next support is. \n\n$ARKK last week confirmed the bearish flag on the daily. Could go to the 50’s very soon", "time": 1645515725.0, "sentiment": "Bearish"}, {"id": 438136072, "text": "$MSFT bad should I sell my 25 shares I picked up at $300?", "time": 1645515558.0, "sentiment": ""}, {"id": 438135200, "text": "$MSFT \n\nHey guys, check out these stock target for this week along with market analysis. 👍🎯👍\n\nhttps://youtu.be/CGWbgRELA6Y", "time": 1645515266.0, "sentiment": ""}, {"id": 438135075, "text": "$MSFT bloodbath tomorrow??😩", "time": 1645515221.0, "sentiment": ""}, {"id": 438134176, "text": "$TSLA $GOOG $GOOGL $MSFT", "time": 1645514923.0, "sentiment": ""}, {"id": 438131528, "text": "$MSFT $AAPL $AMZN $TSLA \nRussia did the same to Crimea 8 years ago and caused a market dip. Since then it&#39;s been a rampant Bull market. It will be again. Putin will be gone soon. He&#39;s reaching too far and will upset a lot of dangerous people. Wait till they start seeing their wealth collapse. He will be taken out, IMO.", "time": 1645513991.0, "sentiment": "Bullish"}, {"id": 438130540, "text": "$AMZN $AAPL $MSFT $TSLA  \nClearly the market will have the jitters tomorrow. It will pass and on the plus side this will make the Fed act very slowly and gently. Putin is doing their job for them.", "time": 1645513646.0, "sentiment": "Bullish"}, {"id": 438130076, "text": "$AABB $TSLA $AAPL $MSFT $GOOG The imminent invasion in Ukraine will trigger global markets and precious metals. Unfortunately that&#39;;s a no win situation but as investors hedging all economy&#39;s &amp; conflicts are keys to success. The upside on $AABB is X20-X50 The stock is heavily oversold,undervalued,record profits,record gold,100M+ in assets,global exchange 213 trading pairs. The first to market global gold currency system (perfect time perfect place) The estimation is 4 Billion UNCOVERED &#39;&#39;naked short&#39;&#39; shares the same way Voyager went from VYGVF .17-$29   RIOT .51-$70  MARA .35-$50 all in less than 6 months.WATCHLIST $AABB", "time": 1645513492.0, "sentiment": "Bullish"}, {"id": 438129362, "text": "$MSFT Volatility is King!! Simulated Weekly $290.0 CALLS for Tuesday&#39;s open on StockOrbit. \n https://apps.apple.com/us/app/stockorbit/id1541560646", "time": 1645513262.0, "sentiment": ""}, {"id": 438128397, "text": "https://youtube.com/watch?v=JStETvXu0vM&amp;feature=share\n$aapl $msft $googl $amzn\nBig tech next week? Hope this can help!", "time": 1645512934.0, "sentiment": ""}, {"id": 438127843, "text": "$SPY $TSLA $AAPL $QQQ $MSFT USA USA USA 🇺🇸", "time": 1645512759.0, "sentiment": ""}, {"id": 438127658, "text": "$MSFT  \n \nMSFT Happy Monday everyone - hopefully you enjoyed the long weekend. Who&#39;s ready to bank tomorrow? Futures are looking a little choppy but I expect to see a different story in pm tomorrow. \n \nI&#39;m already starting to see this pick up on social - trending on Twitter and Stocktwits.  \n \nThis is why we built the social sentiment dashboard, so you can stay ahead of the trends an movements. It is one of the most useful indicators for investing and trading. Check it out - happy to answer any questions. https://utradea.com/social-dashboard?utm_source=stocktwits&amp;utm_medium=ssd-stocktwits&amp;utm_campaign=sm_20220221", "time": 1645512705.0, "sentiment": ""}, {"id": 438126667, "text": "SweepCast observed: $MSFT with Unusual Options Activity Alerted on $300 CALL Expiring: 03/18/2022 worth 49K🐂  Check out Premium Room or SweepCast.com", "time": 1645512406.0, "sentiment": ""}, {"id": 438126035, "text": "$MSFT Joe Biden is definitely shitting the bed right now.", "time": 1645512216.0, "sentiment": ""}, {"id": 438124095, "text": "$SPY $MSFT $GOOG $ARQQ  \n \nGoodness, looks like bears diving head first into a massive orgy.  So many beating war drums so their short comes home.  Pathetic! \n \nMe, I am taking this bump in stride and buying more fabulous companies at deep discount.", "time": 1645511629.0, "sentiment": "Bullish"}, {"id": 438122717, "text": "$CCL  $AAPL $TSLA $MSFT $AMZN \nNasdaq futures are currently down -328.0 \nAnd falling…. \n \nTomorrow will possibly be a automatic trip shut down in the markets……", "time": 1645511243.0, "sentiment": "Bearish"}, {"id": 438122476, "text": "$AAPL $MSFT $AMZN $NVDA - Look at that 10YR and Gold. Black Tuesday? Oil up. This is gonna be a good smackin this week.", "time": 1645511169.0, "sentiment": "Bearish"}, {"id": 438121589, "text": "$SPY $TSLA $BTC.X $AAPL $MSFT \nWhat’s your problem Americans if Putin take a bite from Ukraine? \nY’all tough people gave Crimea already in 2014 and watched it all isn’t it? 😹", "time": 1645510923.0, "sentiment": ""}, {"id": 438120925, "text": "$SPY  remember when Obama said it would taken many years beat isis? Remember when Obama let Russia invade crimea, and north k was launching missiles every other week. Trump beat isis in 1 year and carried big stick gave USA respect back. But evil dem media manipulate brainwash fools to vote weak Biden $ARKK $MSFT  $AAPL $BA", "time": 1645510730.0, "sentiment": "Bearish"}, {"id": 438119043, "text": "$SPY indexes still near tippy top over long term. Much more room to faaaaaaaall $MSFT $TSLA $ARKK", "time": 1645510194.0, "sentiment": "Bearish"}, {"id": 438115915, "text": "$SPY so football season is sadly over but we got Putin Biden bowl. Pass popcorn $ARKK $AAPL $MSFT", "time": 1645509325.0, "sentiment": ""}, {"id": 438113017, "text": "$MSFT let’s get this garbage under 280", "time": 1645508522.0, "sentiment": "Bearish"}, {"id": 438111724, "text": "$MSFT lol Ukraine gets invaded and the US markets plummet for three weeks. Fuck the democrats", "time": 1645508143.0, "sentiment": ""}, {"id": 438110533, "text": "$AMZN $QQQ $MSFT look at futes. This drop is real", "time": 1645507806.0, "sentiment": "Bearish"}, {"id": 438107216, "text": "$spy Hopefully by now its obvious that Putin is just doing what Trump used to do, hes playing the Markets, Look at Oil. \n \nIf you think he &amp; the Oligarchs aren&#39;t in the Market you&#39;re not paying attention. The Press is eating it up &amp; shorting the US for a time is making them even more Billions. \n \nWe&#39;re back to a 2020 type Buying  opp on things that fall that have no correlation so, have your list ready \n \n$qqq $aapl $msft $amzn", "time": 1645506812.0, "sentiment": ""}, {"id": 438106701, "text": "$MSFT Ukraine just got smaller (thank you Putin/Russia), does that mean Microsoft too? \n\nhttps://news.microsoft.com/en-cee/2020/10/02/ministry-of-digital-transformation-of-ukraine-and-microsoft-to-collaborate-in-digital-transformation/", "time": 1645506657.0, "sentiment": ""}, {"id": 438103730, "text": "$AAPL $MSFT $GOOG all in baby!!!", "time": 1645505688.0, "sentiment": "Bullish"}]