[{"id": 438492485, "text": " Hickey also believes that Ubisoft wants an acquisition premium if it were to be acquired, but it&#39;s not actively pursuing a deal. \n \n&quot;We anticipate potential acquirers might be hesitant to pursue a deal considering [Ubisoft&#39;s] history of defending acquisition attempts from EA and Vivendi,&quot; the analyst explained. &quot;Further, we think Ubisoft has cultural challenges related to sexual misconduct that have ripped through the organization and led to leadership departures. We are cautious on UBI’s migration away from owned IP, with licensing deals including Avatar and Star Wars.&quot; \n \nUbisoft, which trades as an ADR, saw its shares close on Friday at $10.31. \n \n \nThe firm also added that it is &quot;cautiously constructive&quot; on longer-term growth opportunities, including free-to-play and mobile games from a number of Ubisoft&#39;s franchises, including Assassin’s Creed, Avatar, Far Cry, Star Wars, Beyond Good &amp; Evil and more. \n \nhttps://seekingalpha.com/news/3802371-ubisoft-upgraded-at-benchmark-assasins-creed-maker-could-be-bought-for-45-premium \n \n \n$UBSFY $TTWO $ZNGO $MSFT $ATVI", "time": 1645606980.0, "sentiment": ""}, {"id": 438492151, "text": "Ubisoft ($UBSFY) received some positive commentary on Tuesday as investment firm Benchmark upgraded the stock, noting that if the video game firm were to be acquired, it could go for significantly more than the stock is currently worth, citing recent deals in the sector. \n \nMike Hickey raised his rating to hold from sell, with the firm focusing on more encouraging growth opportunities in 2023 and 2024, even though some &quot;linger concerns over execution risk have been somewhat realized.&quot; \n \nIn addition, Hickey said that while the firm isn&#39;t confident that Ubisoft will be acquired, it could happen, &quot;given current consolidation trends and mismanagement.&quot; \n \n&quot;We think recent deals including Take-Two ($TTWO)- Zynga ($ZNGA) and Microsoft ($MSFT)- Activision ($ATVI) has provided a valuation floor for UBI,&quot; Hicker wrote in a note to clients. &quot;We imagine an acquirer would bid an approximate €65 for UBI (up 45%), which would be in-line with MSFT’s consideration of ATVI on a profit multiple.&quot;", "time": 1645606843.0, "sentiment": ""}, {"id": 438490984, "text": "$MSFT a must have in your portfolio. Loving the dip", "time": 1645606417.0, "sentiment": "Bullish"}, {"id": 438486679, "text": "$BTC.X 5x your money with my call outs 💵💯😎👍🔥 $TSLA $FB $MSFT $TQQQ https://youtube.com/shorts/HdyutmsLkr8?feature=share", "time": 1645604850.0, "sentiment": "Bullish"}, {"id": 438485090, "text": "$MSFT $CLEAR.X  absolutey the best long term I&#39;ve seen recently.", "time": 1645604251.0, "sentiment": ""}, {"id": 438484503, "text": "@DesertMan \n\nLove how people throw out these price targets with no reasoning at all , price to sales is roughly 10 with projected 30% growth , $MSFT is 11 price to sales with 15 % growth . Seems to me that this is undervalued . Without their SBC this thing is worth double then some . 4-5$ just makes you sound uneducated", "time": 1645604059.0, "sentiment": ""}, {"id": 438483795, "text": "$WIMI  $MSFT  The future of AR technology is very bright that Tim Cook has professed his preference many times. Apple has invested capital and labour to exploring the new filed. Apple’s AR/VR HUD, AR goggles and AR chip patents will soon be seen by the world. Apple has created an AR hardware system within an existing ecosystem. Includes Apple, Google, Microsoft, WIMI all have future projects in AR field.", "time": 1645603811.0, "sentiment": ""}, {"id": 438480919, "text": "$SPY $msft $tsla my TD envelope said “sit before opening “ on the outside", "time": 1645602867.0, "sentiment": ""}, {"id": 438480526, "text": "$SPY $T $MSFT teach them kids fam", "time": 1645602719.0, "sentiment": ""}, {"id": 438480341, "text": "$SPY could retrace to 400/380 \n\n$AMD $AAPL $MSFT $QQQ", "time": 1645602658.0, "sentiment": "Bearish"}, {"id": 438478251, "text": "$PLTR \n\nI truly believe that is 4 years we will laugh at these prices. \n\nI also believe we will be acquired by then. Probably by $MSFT", "time": 1645601946.0, "sentiment": ""}, {"id": 438477472, "text": "$PLTR please buy $MNDT before $MSFT and save the world", "time": 1645601680.0, "sentiment": ""}, {"id": 438475445, "text": "$AAPL $MSFT $GOOG the bs bottom is over March is coming by April’s close to ATHs again", "time": 1645601044.0, "sentiment": "Bullish"}, {"id": 438474124, "text": "$AAPL If NASDAQ 🐻Decline Continues then maybe a full year back to 3/2021 Lows\nWe shall see…. \n$AMD $QQQ $MSFT $SPY", "time": 1645600674.0, "sentiment": "Bearish"}, {"id": 438473668, "text": "$MSFT Green thats good. lets keep going", "time": 1645600534.0, "sentiment": "Bullish"}, {"id": 438472994, "text": " Activision ($ATVI) will postpone next year&#39;s annual release of Call of Duty - the perennial best-seller that gets an updated version every holiday season, Bloomberg reports. \n \nThe company has released a game in the lucrative series annually each year since 2005. \n \nA new CoD is still set to be released this fall, but the move means that 2023 will be the first time in nearly 20 years that the franchise will skip a release. \n \nThe decision comes as Microsoft ($MSFT) prepares its takeover of the videogame publishing giant - and is likely to give a fresh look at the annual development schedule. \n \nhttps://seekingalpha.com/news/3803006-activision-postponing-2023-call-of-duty-release", "time": 1645600332.0, "sentiment": ""}, {"id": 438470704, "text": "$MSFT Volatility is King!! Simulated Weekly $290.0 CALLS for Tuesday&#39;s open on StockOrbit. \n https://apps.apple.com/us/app/stockorbit/id1541560646", "time": 1645599679.0, "sentiment": ""}, {"id": 438469664, "text": "$SPY Why do I feel like we are in an episode of family guy with the stock market reacting to every actions by Putin?  Are we americans or russians?  I want to see a new ATH tomorrow! $AMZN $GOOGL $MSFT $TSLA  \nhttps://www.youtube.com/watch?v=CnZUsYcy6L8", "time": 1645599385.0, "sentiment": "Bullish"}, {"id": 438466533, "text": "$MSFT I rather fancy the Gates chap as the fictional fella below:", "time": 1645598425.0, "sentiment": "Bullish"}, {"id": 438466505, "text": "$HOOD $SYTA $MTCR $WKHS $MSFT    🇺🇸📊\n🚀  .", "time": 1645598416.0, "sentiment": "Bullish"}, {"id": 438464891, "text": "$AMZN I believe that Putin&#39;s plan is to spread fear with the potential invasion of Ukraine in order to tank the U.S stock market and deal a huge blow to America.  Biden&#39;s sanctions ain&#39;t going to do shit to Putin.  It is up to INVESTORS AND INSTITUTIONS TO FOIL PUTIN&#39;S PLAN and push this market to a new ATH.  We need the top companies stocks (FAANG + a few others) to pump this market and give a middle finger to Putin. That is the American way!  $GOOG $MSFT $FB $NFLX", "time": 1645597879.0, "sentiment": "Bullish"}, {"id": 438460269, "text": "$AAPL $MSFT $GOOG load uppp", "time": 1645596447.0, "sentiment": "Bullish"}, {"id": 438458096, "text": "$MSFT almost sell this morning..decided not too.", "time": 1645595860.0, "sentiment": "Bullish"}, {"id": 438455241, "text": "$MNDT $MSFT Microsoft better pull the trigger on Mandiant soon before they get scooped up by another player.", "time": 1645595068.0, "sentiment": "Bullish"}, {"id": 438454766, "text": "$MSFT jumped in some leaps today although we are still in bearish territory. Hopefully we see a bounce this week!", "time": 1645594940.0, "sentiment": "Bullish"}, {"id": 438454117, "text": "$AAPL $qqq $spy $MSFT  \nif no more bs tonight and tomorrow, we should bounce pretty good after many days getting killed by nonsense!", "time": 1645594756.0, "sentiment": "Bullish"}, {"id": 438453485, "text": "@Ambra7592 @Fundy_OracleOfAlpha \n\n$MSFT \nYoY Growth: 20%\nGross Margins: 69%\nOperating Margins: 42.5%\nP/E: 32x\nP/S: 11x\nP/FCF: 36x\n\n$ETSY\nYoY Growth: 62%\nGross Margins: 73%\nOperating Margins: 21.8%\nP/E: 35x\nP/S: 8x\nP/B: 30x\nP/FCF: 31x\n\n$DDOG\nYoY Growth: 63%\nGross Margins: 76%\nOperating Margins: (-4%)\nP/E: N/A\nP/S: 55x\nP/B: 52x\nP/FCF: 305x\n\n$SNOW\nYoY Growth: 150%\nGross Margins: 60%\nOperating Margins: (-75%)\nP/E: N/A\nP/S: 78x\nP/B: 17x\nP/FCF: 945x\n \nGross margins for all companies are roughly equivalent in the 60-75% range, as expected by a SaaS business model.\n\nThe only metric that makes Snowflake look moderately fair is book value, they&#39;ve raised significantly more in cash and assets than the others. Then you see their FCF, margins, and sales multiple before throwing up.\n\nDataDog is almost equal to Etsy in trailing growth and gross margins, but 7x more expensive by sales and 10x by FCF with negative operating margins. Etsy is actually cheaper than MSFT in some metrics.\n\n(Out of space)", "time": 1645594583.0, "sentiment": ""}, {"id": 438453173, "text": "$MSFT I would like to add at 270. May not get a chance. We&#39;ll see.", "time": 1645594492.0, "sentiment": "Bullish"}, {"id": 438448414, "text": "$SPY $MSFT $GOOG $AAPL  America always stands resolute, we are tough and we stand united. We will be 500+ years strong. Fuck anyone anti-America!", "time": 1645593221.0, "sentiment": "Bullish"}, {"id": 438445235, "text": "$MSFT If you’re a Bear, Short, or just plain anti-American, keep scrolling.  You really want to send a message to Russia and Putin?  Let’s send the US markets back to ATH 🚀.  They could care less about the new sanctions.  I guarantee they were closely watching the US markets today hoping for a huge selloff.  They are using the weakness in the markets from Covid and inflation to their advantage.  STOP doing exactly what they want by selling every little whisper of doom.  Losing this leverage will make a bigger impact than any of these sanctions.  💎 🚀 🇺🇸 🇺🇸", "time": 1645592431.0, "sentiment": "Bullish"}]