[{"id": 439595450, "text": "$SPY $SPX $DJIA $MSFT Bears in a tight spot. They know war crashes global currencies forcing that capitol into US markets to protect it&#39;s value and raising share price. Also attacking Putin goes against their Trump loving ideology. Especially after Trump said Putin is a genius for invading Ukraine in the firs place. S&amp;P could be up to neutral YDT by the time the FED announces it&#39;s decision March 15th&amp;16th.", "time": 1645895435.0, "sentiment": "Bullish"}, {"id": 439590695, "text": "$MSFT Mthly MACD Trying to Negatively Cross \n \nMthly/Wkly chart #TechnicalAnalysis of 5 US #Equities &amp; #ETFs every Saturday @ https://bit.ly/3cYAcxI; also analysed today: $GLD, $LVS, $NVDA, $SLV \n \n5 Long/Short US #Equity #ETF Multi-Week/Month \nEntries/Exits Signals/mo \n#EquitiesETFs", "time": 1645883624.0, "sentiment": ""}, {"id": 439589468, "text": "$MSFT weekly (beta) \nhttps://www.tradingview.com/x/XRfSI1gp/", "time": 1645881102.0, "sentiment": ""}, {"id": 439588567, "text": "$LMT $MSFT Microsoft flight simulator. More fighters here then I’ve ever seen in this game 🇺🇦 #f22", "time": 1645879508.0, "sentiment": ""}, {"id": 439588133, "text": "$SPY I don&#39;t know who is worse, Putin or American investors bulls making money as innocent Ukrainian children are dying the last 2 days. $AMZN $MSFT $AAPL $TSLA", "time": 1645878836.0, "sentiment": "Bearish"}, {"id": 439585926, "text": "Zoom Has Some Tough Calls to Make3 min read  $ZM $C $MSFT $IT \n\nhttps://newsfilter.io/a/d230f83b973172d4ece29a16ffd42175", "time": 1645875888.0, "sentiment": ""}, {"id": 439582627, "text": "$SPY The stock market went up nearly 10% since yesterday when Putin started invading Ukraine.  and now prime to hit ATH on Monday after he killed every innocent Ukrainians.  I know that the algos are the ones running the stock market.  But whoever programming the  algos to pump the stock market the last 2 days,  there is a special place in hell for you guys. \n \n I just cant....  $AMZN $AAPL $MSFT $TSLA", "time": 1645872765.0, "sentiment": "Bearish"}, {"id": 439582164, "text": "$MSFT $NFLX $TSLA $SPY $AMZN  he&#39;s telling you that he wants to guilt you into puts printing on deaths instead of calls printing on deaths.", "time": 1645872405.0, "sentiment": ""}, {"id": 439581797, "text": "$SPY &#39;They&#39;ll kill us all&#39;: Ukrainian children talk to CNN as Russian forces get closer to the Ukrainian&#39;s capitol.   \n \nMeanwhile , American investors are more bullish and pump the stock market the last 2 days as more innocent Ukrainian children are dying. \n \n$AMZN $MSFT $NFLX $TSLA", "time": 1645872133.0, "sentiment": "Bearish"}, {"id": 439579097, "text": "$SPY investors see Putin kill innocent Ukrainians, and become more bullish and buy more stocks the last 2 days.  Putin be like &quot;I am the most evil person in the world!&quot;  Americans investors be like &quot;hold my beer. &quot; new ATH on Monday, after Kiev falls over the weekend.  $M $TSLA $MSFT $AMZN", "time": 1645870221.0, "sentiment": "Bearish"}, {"id": 439578938, "text": "SweepCast alerted: $MSFT with Unusual Options Activity Alerted on $300 CALL Expiring: 10-15-2021 worth 31K🐂 |🥇 Start Using SweepCast!  https://www.sweepcast.com/optionflow?symbol=MSFT&amp;name=CALL&amp;strike=$300&amp;type=SWEEP&amp;pre=$31K&amp;exp=10-15-2021  🥇 |", "time": 1645870104.0, "sentiment": ""}, {"id": 439578545, "text": "Equity Sentiment: $MSFT is the #10 stock that institutions are trading with 16.5K options contracts.\n\nMarket analysis included in screenshot of dashboard from http://insiderfinance.io.", "time": 1645869851.0, "sentiment": ""}, {"id": 439575170, "text": "$MSFT $NFLX $NVDA $BX $SMH Next week is gonna be fun. I had been reloading a lot of Call options since yesterday turn out to be gold mine.\nStill holding half of it until next week.", "time": 1645867690.0, "sentiment": ""}, {"id": 439575124, "text": "$JEPI Build my position up in JEPI,  as i was getting squashed on the way down with my other stocks, but today I think I hit my bottom and it is up from here. Is 6-7% worth it from now to year end? \n \nI would expect more from $MSFT or $VZ in total return.", "time": 1645867658.0, "sentiment": ""}, {"id": 439574494, "text": " Zynga ($ZNGA) said the antitrust waiting period under Hart-Scott-Rodino expired for its $12.7B sale to Take-Two Interactive ($TTWO). Zynga gained 3.2% in premarket trading, Take-Two rose 1%. \n \nZynga (ZNGA) also said the go shop period for its sale to Take-Two expired, according to a statement. Zynga expects the pending acquisition to be completed during the Q1 of Take-Two’s Fiscal Year 2023, ending June 30. \n \nThe antitrust clearance comes after a report earlier this month that the deal could see an extended antitrust review. The Zynga deal seemed to usher in a spate of deals in the video game sector including Microsoft&#39;s ($MSFT) planned almost $70B purchase of Activision ($ATVI) and Sony&#39;s ($SONY) deal to acquire &#39;Halo&#39;/&#39;Destiny&#39; developer Bungie in $3.6B deal. \n \nhttps://seekingalpha.com/news/3805926-zynga-says-us-antitrust-period-for-take-two-deal-expired", "time": 1645867277.0, "sentiment": ""}, {"id": 439573769, "text": "@Daytrader326 @Why_Trade operative word is &quot;partnership&quot;. $BB is quietly going into everything from cars to social media. $MSFT has a near monopoly on desktop OS. both are the main battlegrounds. msft for legacy desktops and BB for future mobile. \n \nwould BO prevent collaboration with the parent company&#39;s competitors? also, a msft BO will disappoint u. msft will not pay fair market price. they&#39;re like warren buffet, they want a bargain. (of course, right?) \n \nNOT about BO. i know buddy.. u want BO. I feel ya. (i really don&#39;t. the drama is too entertaining).", "time": 1645866873.0, "sentiment": ""}, {"id": 439572270, "text": "$SPY $UVXY $MSFT \nTruckers are not protesting,  they want a cheap vacation\n\nThey roll up in some city find a Walmart parking lot and set up their tents and barbecues and put a pig on the stick\nSoon hundreds appear and they get shitfaced on budwiser and proudly display their MAGA flags.\n\nIt&#39;s like  redneck Woodstock, tailgating and church revivel all in one for their MAGAgod Trump.  They don&#39;t have to pay the deep state park rangers or privately owned KOA libtards any fees either as they are living off the land as rugged individualist \n\nOf course they put their children in play areas on the parameter so if the police show up they can live steam the victim card. \n\nEverything is eventually trashed with pit grease, beer bottles, moon pie wrappers and urine.  The whole thing is a cluster fuck and the Walmart runs out of white bread and portable butane fuel. A  job well done.  They showed the world what freedom is all about, to protest the non sequitur mask mandate so 2021.", "time": 1645866065.0, "sentiment": ""}, {"id": 439561252, "text": "$SPY $F    $BAC $TSLA $MSFT so Putin under fire. Real test for stock market on Monday.  We might see  some hedge and corporate washing hand from holding. Real test time for feds and rate hike . Inflation once reach above 6%, it&#39;s game over for feds .. we will see 3 to 5 year recession starting from banks -&gt; real estate -&gt; IT sector .", "time": 1645860652.0, "sentiment": "Bearish"}, {"id": 439560831, "text": "$QQQ $AAPL $MSFT $TSLA $SPY We fly on Monday once peace talks conclude over weekend, excited and bullish as fuck! 🔥🚀🔥☮️", "time": 1645860478.0, "sentiment": "Bullish"}, {"id": 439554753, "text": "$MSFT this is so stupid it went to 271 and back to 297 wow stock market is fckin manipulated", "time": 1645857945.0, "sentiment": ""}, {"id": 439554314, "text": "Sweep Options Activity: $MSFT is the #15 ticker with sweep activity where institutions are trading options urgently with 10.2K sweep contracts, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from http://insiderfinance.io.", "time": 1645857792.0, "sentiment": ""}, {"id": 439554229, "text": "$NDAQ $SPY $AAPL $MSFT $SOFI  does the plunge protection team step in again next week?", "time": 1645857759.0, "sentiment": ""}, {"id": 439550989, "text": "$SPY It appears that some feds are still extremely dovish. New York, Chicago Fed President Charles Evans downplayed the thought the Fed needed to get more aggressive, even though he agreed policy was &quot;wrong-footed&quot; with annual consumer price increases topping 7%. Things will get better. &quot;No need to raise rates aggressively or reduce the balance sheet&quot;. I tell you this. If on March 2 and March3, When Powell testifies in front of Congress and the Senate and says inflation is not a big issue like some fed members are saying, or keeps juggling words and never says he will move aggressively to control inflation and that he will wait for future data to come in and only raise a quarter point. Basically sound dovish, the $SPY should take off running higher breaking through resistance pivots like twigs. $appl, $msft,$amzn,$amd Listing these stocks as they will most likely benefit from a dovish fed.", "time": 1645856472.0, "sentiment": ""}, {"id": 439550256, "text": "$MSFT could you retire on 9 million?", "time": 1645856163.0, "sentiment": ""}, {"id": 439550224, "text": "$AAPL $SPY $MSFT my biggest gain of the week 837% gainer from apple 🍎 🗡💴", "time": 1645856152.0, "sentiment": ""}, {"id": 439545913, "text": "Fuck everything about this. What ever happened to voting for thing? https://www.forbes.com/sites/suzannerowankelleher/2022/02/24/national-vaccine-quietly-rolled-out/ shame on you $CRM $MSFT $ORCL for supporting this… this literally gives governments control over where you can and cannot go… we’ve lived just fine without vaccines for thousands of years, now we need them because what everything is dangerous all of a sudden?", "time": 1645854450.0, "sentiment": "Bearish"}, {"id": 439545068, "text": "$MSFT $AAPL $AMD $NVDA $TSLA  hope bulls are ready for Russia’s strong response to US ‘ineffective’ sanctions", "time": 1645854122.0, "sentiment": "Bearish"}, {"id": 439543705, "text": "$AAPL checkout MULN. Cheapest EV on the planet at 70 cents with Q2 deliveries. $MSFT $INTC $AMZN $TSLA", "time": 1645853599.0, "sentiment": "Bullish"}, {"id": 439535657, "text": "$GME Gabe was short $ATVI  before $MSFT acquisition. He fucked with uncle Warren and lost \n\nhttps://twitter.com/grdecter/status/1497253522370445321?s=21", "time": 1645850952.0, "sentiment": "Bullish"}, {"id": 439535449, "text": "$SPY $aapl $uso $tsla $msft lol facts. Literally \nhttps://www.reddit.com/r/Unexpected/comments/t13688/cmon_save_the_world_as_you_do_it_in_the_movie/?utm_medium=android_app&amp;utm_source=share", "time": 1645850889.0, "sentiment": ""}]