[{"id": 441743660, "text": "$AAPL $SPY $QQQ $MSFT look like the MM&#39;S are doing  ANOTHER  MASSIVE  group selloff.. shorting everything at once.. if this was retailers, shorting the market like this, it would have made headline News across the nation $GME .🔥🔥 PUTS ARE COOKING 🔥🔥", "time": 1646668906.0, "sentiment": "Bearish"}, {"id": 441740636, "text": "$MSFT safest tech stock you can buy", "time": 1646666896.0, "sentiment": "Bullish"}, {"id": 441738733, "text": "$AAPL Nice and easy  short sell off .. for no apparent reason 🤑🤑PUTS ARE COOKING  $SPY $QQQ $MSFT", "time": 1646665407.0, "sentiment": "Bearish"}, {"id": 441738580, "text": "$MSFT Volatility is King!! Simulated Weekly $290.0 CALLS for Monday&#39;s open on StockOrbit. \n https://apps.apple.com/us/app/stockorbit/id1541560646", "time": 1646665281.0, "sentiment": ""}, {"id": 441736669, "text": "$JETS $SPY $MSFT $AMZN $DAL \n👇 Putin with hot ladies in the middle of war. Lesson:  &quot;All men are same&quot;\n\nhttps://www.google.com/amp/s/www.news.com.au/world/europe/russian-president-vladimir-putin-poses-with-aeroflot-cabin-crew/news-story/f42036b46cc0c38c1825bdb9798a20b9%3famp", "time": 1646663007.0, "sentiment": ""}, {"id": 441733959, "text": "$MSFT 🫐\nPutin has an inside man in the Biden administration his name is Joe Biden!  50 years of being wrong on every foreign policy decision should have been a warning sign but Democrats love the anti American spirit.  Condem the police and military more show that anti American spirit with pride and joy!!  Let&#39;s go Brandon!!", "time": 1646659486.0, "sentiment": ""}, {"id": 441730827, "text": "$FB is that a new game on Playstation $SONY $ATVI $MSFT ?", "time": 1646655933.0, "sentiment": ""}, {"id": 441730478, "text": "$MSFT puts will be easy money in the am", "time": 1646655561.0, "sentiment": ""}, {"id": 441730410, "text": "$MSFT NEW ARTICLE : Microsoft Halts New Sales in Russia amid Ukraine Crisis; Shares Fall https://www.stck.pro/news/MSFT/23978036", "time": 1646655492.0, "sentiment": ""}, {"id": 441730286, "text": "$MSFT Prezident Pootinn sayz phuck your callz", "time": 1646655409.0, "sentiment": ""}, {"id": 441729994, "text": "$SONY $SNE $ATVI $MSFT the Activision deal will never get regulatory approval from US. THIS DEAL IS DEAD ON ARRIVAL", "time": 1646655172.0, "sentiment": ""}, {"id": 441727367, "text": "$SPY $AAPL $MSFT $ABNB $UBER \n🤑🤞🤞🤞🤞🤞🤞\nhttps://www.latestly.com/socially/world/breaking-russia-declares-ceasefire-in-the-areas-of-kyiv-mariupol-kharkov-and-sumy-from-latest-tweet-by-bno-news-3443664.html", "time": 1646653051.0, "sentiment": ""}, {"id": 441725237, "text": "$DIS $MSFT $AMD $AAPL $SPY Ready to continue to add more on every dip. Saving as much $ as I can and investing it all. Decided to sell my home and buy a tiny house! 2 bds / 1 ba 350 sq ft! Major short term life style changes for major long term gains. Plan is to retire by 35", "time": 1646651492.0, "sentiment": "Bullish"}, {"id": 441723664, "text": "$MSFT thinking about selling since this stock hasn&#39;t seen any gains for a while.", "time": 1646650445.0, "sentiment": "Bearish"}, {"id": 441722040, "text": "$AMD It&#39;s for Zelensky to wear a uniform and be on the combat front. I&#39;m paying too much at the pump and my 401k and all investments sinking daily. I have to nothing against Putin or Zelensky but I simply want my money to grow and Zelensky can&#39;t win but he might just make us all happy by signing an armistice and let Putin have it his way. $MSFT $CRWD $TDOC $NVDA", "time": 1646649412.0, "sentiment": ""}, {"id": 441721602, "text": "$MSFT Volatility is King!! Simulated Weekly $290.0 CALLS for Monday&#39;s open on StockOrbit. \n https://apps.apple.com/us/app/stockorbit/id1541560646", "time": 1646649159.0, "sentiment": ""}, {"id": 441713541, "text": "$MSFT was analyzed by 58 analysts. The buy consensus is at 86%. So analysts seem to be very confident about $MSFT. https://www.chartmill.com/stock/analyzer/stock/MSFT?view=analyst-ratings&amp;utm_source=stocktwits&amp;utm_medium=ANALYST&amp;utm_content=MSFT&amp;utm_campaign=social_tracking", "time": 1646644980.0, "sentiment": ""}, {"id": 441710672, "text": "$AAPL Feed Putin Swiss Cheese.   Let me explain.   \nEven if he loses, he will do something else horrible to save face to his people, so they don&#39;t think he is a loser.  He and Lavrov have mentioned nuclear weapons at least 3 times lately, and have threatened the rest of the world.  We cannot risk that this unhinged egomaniac does something even worse.  \nSO.... Now the Swiss Cheese.  What can we give him that he feels like he got something, but is full of holes?  Maybe promise him no warheads from NATO in Ukraine for 20 years that can travel more than 10 miles.  Or  no nuclear weapons in Ukraine ever.  Something we don&#39;t care about but he can brag he got something.  We have other weapons and other ways to launch than from Ukraine.    \nFeed the RAT Swiss Cheese and let him &quot;win&quot; til either his people overthrow him or he dies in office.    \nIts the only way to save innocent people.  \nThe wise will understand we never gave him anything and we got what WE wanted - Peace. \n$MSFT  $TSLA $USO", "time": 1646643800.0, "sentiment": ""}, {"id": 441701224, "text": "$MSFT \n\nHey guys check out these 4 energy stocks at ALL TIME HIGHS along with market analysis 👌👍\n\nhttps://youtu.be/urS73Csk45c", "time": 1646639918.0, "sentiment": ""}, {"id": 441699487, "text": "$SPY $MSFT $HOOD Now Diamond Hands means letting the gas pump run until it shuts off when your tank is full instead of stopping it at $25 bucks worth.", "time": 1646639227.0, "sentiment": ""}, {"id": 441699161, "text": "$MSFT global market meltdown", "time": 1646639099.0, "sentiment": "Bearish"}, {"id": 441697351, "text": "$AAPL $MSFT $LKCO look at this https://www.projectveritas.com/news/fda-executive-officer-on-hidden-camera-reveals-future-covid-policy-biden/", "time": 1646638388.0, "sentiment": ""}, {"id": 441695105, "text": "$MSFT $AAPL $WIMI  \nWhat&#39;s  WIMI position in AR AND VR SPACE? \n \n💥WIMI is leader in AR AND VR SPACE  \n💥💥WiMi Hologram has approximately 4654 AR holographic contents,💚💚💚💚 \n💥💥💥325 software copyrights 💚💚💚💚 \n💥💥💥💥195 registered patents. 💎💎💎💎 \nWiMi Hologram is committed to using holographic technology to meet the entertainment and business needs of customers and end users.", "time": 1646637546.0, "sentiment": "Bullish"}, {"id": 441693970, "text": "$AABB The perfect Storm is brewing for $AABB with 3 High Grade Gold mines and a Global Exchange featuring the $AABBG.X Gold backed cryptocurrency coin (mine to token) The ONLY mine to token gold backed cryptocurrency coin in the entire WORLD. Tokens are tied to gold and moving up with Gold fast and the $AABBG.X exchange has 200+ trading pairs LOW FEES and the mobile app is coming in March along with The INTERNATIONAL MARKETING CAMPAIGN. when $AAPL &amp; $MSFT started in tiny garages the Vision was imminent same for $TSLA to become the largest Green auto manufacturer in the world. The $AABB vision with multiple High Grade gold Mines/Global exchange/NFT&#39;s/to become the New Global Standard of Exchange backed by GOLD tied to Gold as fiat has lost 97% of it&#39;s value since 1971 $AABBG.X tokens have gone up HUGE", "time": 1646637100.0, "sentiment": "Bullish"}, {"id": 441690019, "text": "$MSFT https://www.dailymail.co.uk/news/article-10583981/Russian-forces-decimated-says-UK-general.html", "time": 1646635631.0, "sentiment": "Bullish"}, {"id": 441679940, "text": "$BA/$FB/$MSFT/$SPY Like what is preventing Biden from opening the PIPlINES ? Like are that Freaking clueless????", "time": 1646631836.0, "sentiment": "Bullish"}, {"id": 441679496, "text": "$AMD Zelenskyy should be fighting instead of making videos and trying to trigger WW3. We lost enough money because this boy. $CRWD $ZS $JPM. Stay neutral and that&#39;s the only ask Putin had for you. Why are you trying to push for a nonsense impossible no-flight zone. Why are 401K suffering because of you? $MSFT", "time": 1646631673.0, "sentiment": ""}, {"id": 441677230, "text": "$MSFT gap down coming", "time": 1646630878.0, "sentiment": "Bearish"}, {"id": 441674817, "text": "$AAPL $MSFT $SPY  well well well. Master at work again .", "time": 1646629976.0, "sentiment": ""}, {"id": 441674033, "text": "$AAPL $MSFT going to be a red open, but let&#39;s see.....i mean the shock has to wear off at some point, but be skeptical that bottom is in at anytime.  Take profits when you got them.", "time": 1646629645.0, "sentiment": ""}]