[{"id": 441962237, "text": "$AAPL Retailers who are Bullish, have to  suffer from Stockholm syndrome, the lower the price, the more pain they indure. Keep  watching the FAKE FINANCIAL NEWS..$SPY $QQQ $MSFT", "time": 1646706416.0, "sentiment": "Bearish"}, {"id": 441961802, "text": "$AMD HIGH 90s..$TSLA 750..$BAC 35..$MSFT 250s..", "time": 1646706365.0, "sentiment": ""}, {"id": 441960453, "text": "$BA/$FB/$MSFT/$AMZN US law maker strikes deal to ban Russian crude oil and a hack terriff what a fucking genius!!!", "time": 1646706212.0, "sentiment": ""}, {"id": 441958075, "text": "$MSFT vr learning is a must and very help full throw out the book and learn hands on with room for a little error you can aslo use this in video testing to pass a class its hands on and active", "time": 1646705939.0, "sentiment": ""}, {"id": 441957301, "text": "$MSFT Boycott Microsoft for financing mass murder, which is helping finance a genocide! They edit, sensor, and remove posts they deem harmful to Biden and the murderer Putin. Punish this company and remove it from the DOW &amp; NASDAQ!  Remove all Russians on your board of directors, they should all be sanctioned. On this planet science and history show that biologically, Putin should be destroyed as an entity in this world. $MSFT is communism and is screening all negative comments regarding Biden as he buys his &quot;Blood Oil&quot;. Human beings are entities on earth that are no more than any virus that has ever existed. Humans envelop this earth.  \n    \nBiden is a Putin puppet, and Putin is probably blackmailing him for the money he and Hunter have been paid. Putin is a virus that must be removed from the face of this planet, or he may very well destroy it. Active destructive viruses attack and destroy biological entities that are healthy for this planet. This is science and it is indisputable.", "time": 1646705850.0, "sentiment": "Bearish"}, {"id": 441956061, "text": "$TSLA everyone is selling their gasoline cars and buying TESLAS 🤣🚀🔥 $SPY $AAPL $MSFT $OIL", "time": 1646705703.0, "sentiment": "Bullish"}, {"id": 441954679, "text": "$AAPL THE LAME STREAM FINANCIAL NEWS keep saying &quot;SELL OFF &quot; like your stock  is apart of a Monolith,🤡 One fail they all fail.... Bears are WINNING , this is the  4th week straight . Let&#39;s go Brandon.. $SPY $QQQ $MSFT", "time": 1646705549.0, "sentiment": "Bearish"}, {"id": 441952500, "text": "$MSFT tech will solve the energy crisis one day. Invest", "time": 1646705288.0, "sentiment": ""}, {"id": 441948903, "text": "$MSFT Tech is a lifeline in times of crisis...when will the market absorb this fact?", "time": 1646704843.0, "sentiment": ""}, {"id": 441943381, "text": "$AAPL $AMZN $MSFT $NVDA - must read: If you are holding, I’d suggest getting completely out. Bulls will protest and mock, but, what’s coming this year is going to be absolutely like nothing before. It starts this month with Feds QE cut off and raising rates. Next it’ll expand to a bigger conflict with the West and Russia. Energetic prices as well as food prices are going to skyrocket much more. This has been an agenda planned by elite by decades. All those Bilderberg - G20 - World Economic Forum meetings has led to this. They want to utterly collapse the current system and favor a new system. Yes we’ve all heard the term NWO. It’s not a conspiracy theory when world leaders openly call for it. The current monetary system of Breton Woods will soon be replaced with a new digital currency. This isn’t like other crashes or bear markets, this is totally different. There is no “but the dip” because you’ll never recoup. I promise. It’s not going back up. I’ll be posting more info on my page.", "time": 1646704167.0, "sentiment": "Bearish"}, {"id": 441936106, "text": "$MSFT was there news of an increase in the share buy back for this name?  Someone mentioned something, but I can&#39;t see any news.", "time": 1646703208.0, "sentiment": ""}, {"id": 441929103, "text": "$MSFT upping my msft auto-allocations in the set it forget it account. Hodl, dca, hodl some more. 👍", "time": 1646702203.0, "sentiment": "Bullish"}, {"id": 441928352, "text": "$AAPL $FB added some leaps... Just because 😁 ready to average up or down in the next couple of weeks. Same with $MSFT", "time": 1646702102.0, "sentiment": ""}, {"id": 441927937, "text": "$AAPL This company has NO FUNDAMENTALS VALUE, BASED ON THE PRICE ACTION. .Apple is part of  the FIX.. this bears raid lasted long than expected..$SPY $QQQ $MSFT", "time": 1646702044.0, "sentiment": "Bearish"}, {"id": 441922617, "text": "Today &#39;s  #DOW30 HeatMap of  #large  market stocks: $AAPL \n$MSFT $UNH $JNJ $JPM \n     \nfinscreener.org/map/map", "time": 1646701338.0, "sentiment": ""}, {"id": 441921723, "text": "Today &#39;s  #NASDAQ100 HeatMap of  market stocks: $AAPL \n$MSFT $QCOM $GOOGL $AMZN \n \nfinscreener.org/map/map", "time": 1646701222.0, "sentiment": ""}, {"id": 441919882, "text": "$SPY $TSLA $MSFT Brace yourself, TD Statement incoming", "time": 1646700981.0, "sentiment": ""}, {"id": 441915915, "text": "250 $MSFT APR2022 $285 Cs trade 12.85", "time": 1646700453.0, "sentiment": ""}, {"id": 441915553, "text": "$MSFT +$5 off lows", "time": 1646700403.0, "sentiment": ""}, {"id": 441910388, "text": "Do not fear the bear market, embrace it. These cycles keep the market healthy and provide buying opportunities for long term investors. Scale in and hold. \n\n$AAPL $MSFT $FB $GOOG", "time": 1646699688.0, "sentiment": "Bullish"}, {"id": 441905663, "text": "$MSFT 😳🔫", "time": 1646699093.0, "sentiment": ""}, {"id": 441901830, "text": "Bought $MSFT March 18th $295 calls at $2.70.", "time": 1646698619.0, "sentiment": ""}, {"id": 441898019, "text": "$MSFT US said they are sending 500 more troops to Europe...I am bullish...but this sounds bearish to me...", "time": 1646698092.0, "sentiment": ""}, {"id": 441896076, "text": "$MSFT $JPM Any Fed Powell meetings today ? Need a rally!!!", "time": 1646697818.0, "sentiment": "Bullish"}, {"id": 441894970, "text": "Damn I love crises $NIO $AAPL $MSFT $FB $MU", "time": 1646697673.0, "sentiment": "Bullish"}, {"id": 441890130, "text": "$MSFT im in.", "time": 1646697035.0, "sentiment": "Bullish"}, {"id": 441887403, "text": "$MSFT Limit order filled. Thank you.", "time": 1646696634.0, "sentiment": "Bullish"}, {"id": 441886161, "text": "$MSFT We got more down side coming in the following days.", "time": 1646696465.0, "sentiment": "Bearish"}, {"id": 441885748, "text": "$MSFT Patience everyone. Bad times don&#39;t last forever. I pulled this together for those that may find it useful: https://youtu.be/VsvIsNLkwHw", "time": 1646696409.0, "sentiment": "Bullish"}, {"id": 441885215, "text": "$CAPC just wait until the Smart Mirror gets out there to the masses. Can’t see why anyone would buy $LULU or $PTON with this mirror and price point. \n\nTrading near 52 week low of .30 and a high of 3.00+, I don’t expect this to stay in this range, especially with directors owning half of the shares. Look for a buyout, maybe $GOOG or $msft ?\n\nhttps://youtu.be/XMdWdY5QUfI", "time": 1646696331.0, "sentiment": "Bullish"}]