[{"id": 445598213, "text": "$AAPL $NVDA $AMZN $MSFT $GOOG  \nThis was no accident, inflation will be here for years to come. The Fed was &quot;too late&quot; 15 months ago. \n  \nCan&#39;t raise rates this time like they did in the 70s because debt:GDP means we can&#39;t afford our own debt 😂 I think we were 30% then and now 120%! interesting how Jerome said he could see multiple reserve currencies 🤔  \n  \n&quot;The LAST TIME the Fed fell this FAR BEHIND THE CURVE on inflation was 1975 &amp; it TOOK 9 YEARS⏳ TO BRING UNDER CONTROL&quot;  \n  \n&quot;The graph shows what happened when the Fed got seriously &quot;behind the curve&quot; in 1974–75. The real rate and inflation moved in opposite directions, very much like today.   \n  \nLook at the two dotted lines. In early 1975, core inflation was running at 12 percent and the real policy rate was equal to about −6 percent, a gap of about 17 percent. Today, core inflation is running at 6 percent and the real policy rate is equal to −6 percent, a gap of 12 percent—smaller than in 1975, but still strikingly large.&quot;", "time": 1647851564.0, "sentiment": ""}, {"id": 445595528, "text": "$U Follow these out of the money calls detected from SweepCast.com, some are at $120C and $125C, yes it&#39;s 20% away but I will continue to watch this tomorrow and see if it comes through with more activity. This would of been a nice call to follow RIGHT at the OPEN 9:30AM on FRIDAY! 🐳🐳⏰⏰ \n \n$CRWD $NVDA $AI $MSFT = AI is KEY", "time": 1647850107.0, "sentiment": "Bullish"}, {"id": 445591434, "text": "$MSFT daily chart \n\nBig breakout last week out of the volatile downtrend and thankfully for bulls the breakout came with volume. There&#39;s no strong resistance for MSFT until the daily supply shown in red. If you&#39;re late to the long setup here that&#39;s okay, new entry could be above 303 --&gt; eye 310 calls with 2 weeks of expiration on them.\n\nSo long as price remains above 296 bulls are cautiously in control. Above 303-305 they solidify and a push towards 310-312 seems inevitable", "time": 1647848032.0, "sentiment": ""}, {"id": 445585810, "text": "$SOFI Tech stack being used in $MSFT #Azure for @Technisys_com. These will be services Technisys Cyberbank will use in the cloud to scale and quickly deploy Bank as a Platform. Read on Microsoft and Technisys: Delivering Next-Gen Digital Banking #Baas. https://drive.google.com/file/d/1wXTjSsINlNlXwV4QTWGbq1g7tTi-Bn_L/view?usp=sharing", "time": 1647845268.0, "sentiment": ""}, {"id": 445578861, "text": "$SPY Hey Bears, \n \nYou can try and try, but we are going... \n \n \n$QQQ $AAPL $MSFT $AMD", "time": 1647841849.0, "sentiment": ""}, {"id": 445578365, "text": "  $MSFT  \n \nWhile all of this sounds promising for Microsoft (MSFT), Thill noted that Power Platform and Power Apps are a &quot;long-term catalyst&quot; for the company, one that could impact all of Microsoft&#39;s products, due to its integration with Teams, Dynamics 365 and Azure. \n \nAssuming everything comes to fruition, Power Platforms, which currently generates less than one-half-of 1% of Microsoft&#39;s (MSFT) $199 billion in annual revenue, could wind up becoming worth $6 billion in sales by 2027 if it&#39;s able to grow its user base and ultimately, become &quot;Microsoft&#39;s next pillar of sustainable growth.&quot; \n \nhttps://seekingalpha.com/news/3815007-microsoft-has-a-little-known-platform-that-could-be-a-bigger-growth-driver-than-office", "time": 1647841592.0, "sentiment": ""}, {"id": 445578313, "text": " $MSFT  \n \nThese newly trained developers can build apps using Power Platform&#39;s &quot;PowerPoint-like, drag-and-drop interface with a simple Excel-like coding language,&quot; and put all of their workflow onto one platform, making it easier to create apps. This could cut the development time it takes to create apps, while not to mention being significantly cheaper than previous solutions. \n \nMicrosoft  may have its arms in all areas of tech, positioning itself well for the future, but things could get even better for itself and its shareholders if it&#39;s able to see increased Windows-related revenue due to a strong PC market. Shareholders could also see benefits if there are improvements in Azure&#39;s operations and the company returns more cash to shareholders, Thill explained. \n \nConversely, things could get worse for Microsoft  if COVID-19 continues to be a drag on global growth, the global transition to the cloud takes longer than expected, or some of its ventures prove unprofitable.", "time": 1647841557.0, "sentiment": ""}, {"id": 445578229, "text": "It can also integrate with GitHub, which Microsoft ($MSFT) bought for $7.5 billion in 2018, as well as Teams, its Slack competitor, owned by Salesforce ($CRM). \n \nCharles Lamanna, Microsoft&#39;s Corporate Vice President of Business Apps and Platform, said it&#39;s likely that over the next five years, 500M new apps will need to be built, which would be &quot;more than all the apps built in the last 40yrs.” \n \nAlthough 500 million apps over the next five years sounds like an enormous opportunity, there&#39;s one big hurdle: there are not enough software developers around the world to meet that demand. \n \nIt&#39;s estimated that to reach the 500M figure, an additional 10yrs worth of developers would have to enter the market. Given the demand for apps and the shortfall in developers, platforms such as Microsoft&#39;s Power Platforms, with its low-code environment, are now a necessity and can transform employees with no development experience into &quot;citizen devs,&quot; letting companies transform their businesses", "time": 1647841519.0, "sentiment": ""}, {"id": 445578127, "text": " $MSFT   \n \nMicrosoft generates the vast majority of its revenue from its Azure cloud computing platform, Office 365, and is looking to enhance its profile in video games with its pending Activision ($ATVI) purchase. \n \nBut, the company&#39;s next growth engine could be hiding in plain sight, according to investment firm Jefferies. \n \nAnalyst Brent Thill, who has a buy rating and a $400-a-share price target on Microsoft&#39;s stock, noted that Microsoft&#39;s (MSFT) Power Platform could be its next big opportunity, and potentially bigger than Office. \n \nThill said that revenue from Power Platform is &quot;immaterial&quot; today, but it could have a larger impact on all of Microsoft&#39;s (MSFT) products and become a &quot;multi-billion-dollar growth pillar,&quot; which he compared to &quot;the early days of Azure.&quot; \n \nFirst unveiled in 2018, Power Platforms allows developers to have a set of tools to build customized low-code apps, automate workflows, generate reports and create chatbots, all designed to improve productivity.", "time": 1647841456.0, "sentiment": ""}, {"id": 445576654, "text": "$SPY $TSLA $AAPL $NVDA $MSFT \nShort america Monday \n\nWorld economy faces supply hit as China COVID surge. 🇨🇳 \nProduction at Tesla&#39;s Shanghai Gigafactory 3 halted for two days due to the China&#39;s latest coronavirus outbreak\n\nhttps://www.drive.com.au/news/tesla-gigafactory-3-in-china-shuts-up-shop-for-two-days/", "time": 1647840711.0, "sentiment": "Bearish"}, {"id": 445573134, "text": "$MSFT Volatility is King!! Simulated Weekly $297.5 CALLS for Monday&#39;s open on StockOrbit. \n https://apps.apple.com/us/app/stockorbit/id1541560646", "time": 1647838821.0, "sentiment": ""}, {"id": 445571883, "text": "$SPY We are in full on fed pump mode.  Even options time and sales says so.  Just get June calls on whatever company that&#39;s your flavor and ride the wave into the Spring Rally 2022. \n \n$TSLA  \n \n$AAPL \n \n$MSFT  \n \n$COIN  \n \nIt&#39;s all going up. \n \nhttps://twitter.com/MeisaBonelli/status/1505686521235525638?s=20&amp;t=CrtQMlcOAYkhG4Zakz26VA", "time": 1647838125.0, "sentiment": ""}, {"id": 445570980, "text": "$SPY $AAPL $TSLA $MSFT $GOOGL \nhttps://www.google.com/amp/s/fortune.com/2022/03/18/ukraine-resistance-russia-putin-nuclear-threats/amp/", "time": 1647837630.0, "sentiment": "Bearish"}, {"id": 445570884, "text": "$MSFT \n\nHey guys, check out these stock targets for next week along with market analysis.🎯🎯🎯\n\nhttps://youtu.be/QA_kCeCt7LY", "time": 1647837577.0, "sentiment": ""}, {"id": 445570428, "text": "$MSFT very attractive area. Very..", "time": 1647837334.0, "sentiment": ""}, {"id": 445570360, "text": "Equity Sentiment Weekly Recap: $MSFT is the #17 stock that institutions traded this week with 50.8K options contracts.\n\nMarket analysis included in screenshot of dashboard from http://insiderfinance.io.", "time": 1647837288.0, "sentiment": ""}, {"id": 445569097, "text": "$SPY $AAPL $MSFT $GOOGL I agree $QQQ \n\nIt’s unfortunate but so many will get caught be smart and vigilant", "time": 1647836578.0, "sentiment": ""}, {"id": 445559177, "text": "$SPY $AAPL $TSLA $MSFT $GOOGL\nI am sure bulls with college degree know what this means;  \n2 yr bonds spiking, but 10 yr &amp; 30 yr bonds are dropping. \nWe are officially in Recession.", "time": 1647831560.0, "sentiment": "Bearish"}, {"id": 445558410, "text": "$SPY $AAPL $MSFT $NVDA $TSLA \nI wouldn&#39;t hold next week until we confirm war is over. \nRussia says it used hypersonic missiles in Ukraine again\nhttps://www.google.com/amp/s/www.aljazeera.com/amp/news/2022/3/20/russia-says-it-used-hypersonic-missiles-in-ukraine-for-second-day", "time": 1647831193.0, "sentiment": "Bearish"}, {"id": 445553037, "text": "$AABB $TSLA $AAPL $MSFT $GOOG Watch List $AABB if you don&#39;t it&#39;s on YOU......", "time": 1647828327.0, "sentiment": "Bullish"}, {"id": 445550760, "text": "#Levermann #Global #MegaCap #Sell WK11 $AAPL (2), $MSFT (2), $AMZN (-4), $0700.HK (0), $FB (-1), 2330.TW (-1), UNH (2), WMT (0), JPM (-3), HD (1)", "time": 1647827120.0, "sentiment": "Bearish"}, {"id": 445546650, "text": "$MSFT https://pulse2.com/microsoft-nasdaq-msft-stock-400-price-target-and-buy-rating/amp/", "time": 1647824910.0, "sentiment": ""}, {"id": 445546632, "text": "How I trade Support and Resistance $MSFT $SPY \nhttps://www.mbctrader.com/post/how-i-trade-support-and-resistance", "time": 1647824895.0, "sentiment": "Bullish"}, {"id": 445546369, "text": "$AABB $TSLA $MSFT $GOOG Watch List $AABB the AABBG.X Exchange (mobile app) goes &#39;&#39;Live&#39;&#39; before March 22nd Tuesday on the $AAPL Android providing massive liquidity", "time": 1647824737.0, "sentiment": "Bullish"}, {"id": 445544285, "text": "$RBLX $GOOG $FB $MSFT $AMZN great question", "time": 1647823595.0, "sentiment": ""}, {"id": 445543268, "text": "$MU tech lagging behind this rally expect moves here as well and $MSFT love these", "time": 1647823018.0, "sentiment": ""}, {"id": 445541854, "text": "Imagine buying Zoom while there is the all-inclusive powerhouse that is Microsoft Teams.\n\n$ZM \n$MSFT", "time": 1647822162.0, "sentiment": "Bearish"}, {"id": 445541807, "text": "$MSFT $GOOG $AAPL The European Union is going after Microsoft for their cloud offerings. The European union is going after google for their ad technology. The European union is going after Apple for the app store. How about we go after European companies?", "time": 1647822136.0, "sentiment": ""}, {"id": 445538982, "text": "$SPY $AAPL $MSFT $NVDA $DIS \n\nLove this. \n\nKeep compounding. Keep investing.", "time": 1647820525.0, "sentiment": "Bullish"}, {"id": 445537670, "text": "Prior leading names I like Long as of the close of last week are $NVDA, $TSLA, $MSFT, $AMD, $ENPH, among others \n \nBasic Materials names remain solid as well. There is certainly a path for the market to solidify and turn back up here, ending the correction", "time": 1647819771.0, "sentiment": ""}]