[{"id": 449563769, "text": "$QQQ $AAPL $GOOG  $MSFT \nremember when russia and ukraine were less than 4% of total annual sales combined for these companies? Listen bears your signal virtueing is not noble. Its not crashing the markets. This is the start of another 5 year bullrun gl 💋 😊", "time": 1649081095.0, "sentiment": "Bullish"}, {"id": 449562163, "text": "$RBLX This sees $60 shortly. https://mobile.twitter.com/prasadmaddali20/status/1509416570082107401?cxt=HHwWkoCp3fGXw_IpAAAA\n\n$MSFT buyout price now has an $8 handle. Then it’s a $hundo…", "time": 1649079232.0, "sentiment": "Bullish"}, {"id": 449558811, "text": "$MSFT $AMD $SPY  Using the most advanced Simulated Trading Platform available, investors learn how to trade and invest without risking actual money. Trade Ideas becomes their coach and partner in navigating the stock market.  \n \nConnect with Trade Idea (25% off) :  tinyurl.com/fg6Tyg3ErdfVg", "time": 1649074935.0, "sentiment": "Bullish"}, {"id": 449557390, "text": "@BeBest Average dividend from another security. \n\nMeaning - You could invest in a high dividend security such as IBM or even ETF such as HANDL which pay 5 and 7%. Even with an ETF expense ratio, your opportunity cost is much lower, and return much higher with either one. \n\nThe point is that as it stands, even with liquidity, HOOD price action is poor. Any investor that is waiting for HOOD to appreciate and level past 16 may be better off investing elsewhere. \n\nAs for me, I’m very long on this one; but I’m long on everything including $SPY, $GOOGL, $HOOD, $TSLA, $MSFT", "time": 1649072673.0, "sentiment": ""}, {"id": 449552486, "text": "$MSFT Option to look at for Monday.. 👀 👀  $275.00 Put for Friday, March 11, 2022. Roughly 181 Thousand dollars! 💰💰 Learn more on StockOrbit! Link on profile!!", "time": 1649066532.0, "sentiment": ""}, {"id": 449544532, "text": "$TWTR any chance $MSFT  or $GOOG  buys them out?", "time": 1649059706.0, "sentiment": "Bullish"}, {"id": 449543139, "text": "$MSFT The 1st quarter of this year is behind us and the markets continue to look bullish. This was no dead cat bounce as we have seen all the major indices and a ton of stocks bounce back with vengeance! I have been pointing out that the 200 day SMA could act as resistance. Keep reading to find out where the markets may go next.  have seen all the major indices and a ton of stocks bounce back with vengeance! I have been pointing out that the 200 day SMA may act as resistance. Keep reading to find out where the markets may go next. \n \nhttps://25koptionschallenge.com/market-outlook-week-of-4-4-4-8-pullback/", "time": 1649058818.0, "sentiment": ""}, {"id": 449541134, "text": "$MSFT https://youtube.com/shorts/5FSYtSC9KaI?feature=share📌🤳🏼 kids is the wave", "time": 1649057528.0, "sentiment": ""}, {"id": 449540228, "text": "$MSFT MSFT is in our Market watch for this week. Please join my discord channel ( from my home page) for Daily trade alerts, Daily updated Short Interest, News , Discussions and upcoming catalyst.  Was up $1890 just 4 trades/week", "time": 1649056943.0, "sentiment": ""}, {"id": 449539053, "text": "$AMZN $GOOG $NVDA $AAPL $MSFT  \nUS 2YR @ 2.48%, US 30YR @ 2.44% - This time is different!   \n  \n&quot;are we about to have another 2008 in short order or something worse?&quot;   \n  \nLessons from 2008, may start to rhythm soon?   \n  \nOnly way to curb inflation is to raise rates &amp; go into a Fed inducted recession. That is what J.Powell is attempting to pull off in his &quot;soft landing&quot; &amp; reducing the size of their balance (watch out real estate)   \n  \nDon&#39;t Fight The Fed - going up or coming down", "time": 1649056162.0, "sentiment": ""}, {"id": 449538661, "text": "$DIS $MSFT $TSLA Make sure you are subscribed to our YouTube so you get ALL of our valuable content - click that alert button too!\nMessage us anytime if you want us to cover any subject! If we feature your question or idea then you get a nice prize package! Enjoy! 📺…\n\nhttps://m.youtube.com/c/OptionsPlayerscom/videos", "time": 1649055899.0, "sentiment": ""}, {"id": 449535171, "text": "$MSFT $334", "time": 1649053772.0, "sentiment": "Bullish"}, {"id": 449527265, "text": "$MSFT $200 in charges being billed every fraction of a second until 1 goes through for 9.99 and I get the run around from support l.  Microsoft wont even acknowledge and tell me to call Xbox wtf is this shit", "time": 1649049275.0, "sentiment": ""}, {"id": 449527110, "text": "$MSFT lol online support is none existent and they are Roblox scammers", "time": 1649049189.0, "sentiment": ""}, {"id": 449527107, "text": "$MSFT NEW ARTICLE : EU Regulators Scrutinize Microsoft&#39;s Cloud Business, Practices https://www.stck.pro/news/MSFT/25570532", "time": 1649049187.0, "sentiment": ""}, {"id": 449525423, "text": "⭐️ Freedom Stocks Watchlist For Tomorrow ⭐️\n\n$TSLA\n$AAPL\n$MSFT\n$HUBS\n$NET", "time": 1649048205.0, "sentiment": "Bullish"}, {"id": 449521696, "text": "@Changemymind420 @GOTWITGO @Santa_Claus_Trades @buy_lowish $MULN \n\nIs $MSFT a competitor to $AAPL ?\n\nWho knows and who cares as long as it&#39;s legit.", "time": 1649046055.0, "sentiment": "Bullish"}, {"id": 449521066, "text": "$AABB $AAPL gets hacked 2 days in a row or at least a decent attempt and the bashers come here spreading FUD when the exchange is making 365 24/7 revenues working beautifully on the Android app also $GOOGL play and the desk top version $MSFT. The hedge funds are 3-4 billion naked short here. They drop the price they lose,they increase the price they lose. Deciding when the lesser of the 2 evils is letting it run. (soon?) Priceless!  365 24/7 revenues + 5 Gold mines. (5) 911 MM signals on Friday 10:56 am 2021 EPS +300% BOOM https://www.reddit.com/r/aabbstock/comments/tqr9w9/aabb_revenue_streams_and_deliverables/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf", "time": 1649045708.0, "sentiment": "Bullish"}, {"id": 449514258, "text": "$SPY $SPX $DJIA $MSFT Putin&#39;s Cyber Bots have hacked Stock Twits and just like Ukraine and everything else they&#39;ve done they fucked it up.", "time": 1649042028.0, "sentiment": "Bullish"}, {"id": 449514130, "text": "@Santa_Claus_Trades $MULN $MSFT Microsoft in my opinion is the only other logical one not yet mentioned.\n\n@buy_lowish", "time": 1649041968.0, "sentiment": "Bullish"}, {"id": 449511093, "text": "@SwellChaser ms teams is much better than zoom $MSFT $ZM", "time": 1649040225.0, "sentiment": ""}, {"id": 449508472, "text": "$SPY $AAPL $MSFT", "time": 1649038661.0, "sentiment": "Bearish"}, {"id": 449496594, "text": "$SPY $SPX $DJIA $MSFT Putin&#39;s Russian Bot Propagandist all over ST today. Pissing off the UK&#39;s Johnson is one of Putin&#39;s more stupid moves. The UK has now supplied Ukraine with its prized Starstreak Mach-4 missile system that can take down cruise missiles, SU-35 fighter bombers and has already downed a 12 million dollar MI-28 attack helicopter.", "time": 1649031379.0, "sentiment": ""}, {"id": 449495271, "text": "$MSFT may calls are good buys here", "time": 1649030572.0, "sentiment": "Bullish"}, {"id": 449494556, "text": "$AAPL $MSFT $GOOG $QQQ by end of April we about to fly load the hell up!!!", "time": 1649030139.0, "sentiment": "Bullish"}, {"id": 449493739, "text": "The broader market&#39;s IV crush for stocks in $SPY turned out to be less severe than the options were for $MSFT. The average earnings IV crush left ATM options with around 60% of their pre-announcement IV. \n \nhttps://quantcha.com/news/an-analysis-of-trading-earnings-releases-using-options/", "time": 1649029649.0, "sentiment": ""}, {"id": 449493581, "text": "We broadened the analysis beyond $MSFT for all optionable stocks at earnings from 2016-March 2022. The only filter was for option liquidity using a liquidity rating of 4+ to ensure feasibility. This data is available through our Quantcha Option Ratings DB via Nasdaq: https://data.nasdaq.com/data/QOR-us-equity-option-ratings", "time": 1649029551.0, "sentiment": ""}, {"id": 449493504, "text": "Long calendar straddles weren&#39;t always profitable for $MSFT earnings and were subject to losing all their value if the underlying moved too much. However, they were profitable 14/25 times and produced an average net of almost 33% (caveat: EOD midpoints). \n \nhttps://quantcha.com/news/an-analysis-of-trading-earnings-releases-using-options/", "time": 1649029501.0, "sentiment": ""}, {"id": 449493422, "text": "In our research, the long calendar straddle was the most effective way to trade $MSFT earnings. It involves selling the earnings week ATM straddle and buying the next week&#39;s ATM straddle. \n \nhttps://quantcha.com/news/an-analysis-of-trading-earnings-releases-using-options/", "time": 1649029463.0, "sentiment": ""}, {"id": 449493354, "text": "The Earnings Crush Rate can be compared with the long-term IV to infer the &quot;richness&quot; earnings is being priced with for stocks like $MSFT. This gives you an idea of how IV is priced so you can decide whether it&#39;s worth selling against longer-term IV (spoiler: it usually is). \nhttps://quantcha.com/news/an-analysis-of-trading-earnings-releases-using-options/", "time": 1649029430.0, "sentiment": ""}]