[{"id": 451199554, "text": "$MSFT $SPY $IWM \nUses windows and Microsoft word \nTried shorting \nLost all his money everyone laugh", "time": 1649584584.0, "sentiment": ""}, {"id": 451198444, "text": "Friday 🍋 Unusual Options Alerted: $MSFT with our scanner on $265 PUT Expiring: 05-20-2022 worth 34K🐻  Get Ahead Of The Move with SweepCast &amp; Learn more about it on our profile today!🏆", "time": 1649582909.0, "sentiment": ""}, {"id": 451197817, "text": "$AMD $AAPL $MSFT $TSLA Freight volume tumbling in March =&gt; all prices relating to shipping in the CPI will collapse. Fed, take a break and STFU -- especially Bullard", "time": 1649582124.0, "sentiment": "Bullish"}, {"id": 451195050, "text": "$MSFT microsoft... 2.2Trillion valuation... microsoft.. lol i know inflation but this is on another level of inflation....\n$182 is the bullish PT through 2023 $SPY $IWM", "time": 1649579027.0, "sentiment": "Bearish"}, {"id": 451188351, "text": "$SPY $MSFT was this after or before the Bluescreen Death shut down their computers and forced updates?\nMarkets in Turmoil", "time": 1649573239.0, "sentiment": ""}, {"id": 451187614, "text": "$TWTR who will buy $TWTR? $DIS or $MSFT or $TSLA or China tech? a $million question.", "time": 1649572701.0, "sentiment": "Bullish"}, {"id": 451187611, "text": " $AMZN $GOOG $GOOGL $MSFT $SNOW  \n \nWhite pointed out that Google Cloud has seen &quot;rapid growth&quot; in recent years, most recently growing revenue 45% year-over-year in its most recent to $5.54 billion, with total 2021 revenue at $19.2 billion.  \n \nAccording to industry researcher Canalys, Amazon&#39;s AWS generated $53.5 billion in revenue in its most recent quarter, account for 33% of the market. Microsoft (MSFT) had an estimated 22%, while Google was well behind them at 9%.Other cloud providers, including IBM (IBM) accounted for 36% of the overall cloud infrastructure market. \n \nOn Wednesday, Boeing (BA) tapped Google (GOOG) (GOOGL), as well as Microsoft (MSFT), and (AMZN) for a cloud computing deal that some believe may be worth more than $1 billion.", "time": 1649572700.0, "sentiment": ""}, {"id": 451187564, "text": " White said that BigLake was the most &quot;significant&quot; announcement of the event, as it will expand on Google BigQuery and extend the cloud data warehouse on top of data lakes in a multi-cloud environment. BigQuery competes with the likes of Snowflake, AWS&#39;s Redshift and Azure&#39;s Snynapse, with Google describing it as a “a data lake storage engine, to remove data limits by unifying data lakes and warehouses.&quot; \n \nEssentially, it lets companies unify data warehouses and lakes to analyze their data without worrying about a storage format change or system upheaval. \n \nAnother innovation of note was the Spanner change stream, which is expected to launch this quarter, White said. This is Google&#39;s relational database that is capable of performing more than 2 billion requests per second at its peak. \n \nthe new stream has a number of numbers, including having the &quot;freshest data as they can easily replicate changes from Spanner to BigQuery for real-time analytics.” \n \n$AMZN $GOOG $GOOGL $MSFT $SNOW", "time": 1649572655.0, "sentiment": ""}, {"id": 451187481, "text": "Amazon ($AMZN) and Microsoft ($MSFT) are the giants of the cloud industry, but Alphabet&#39;s Google ($GOOG) ($GOOGL) has made a number of strides in recent years and the company isn&#39;t slowing down. \n \nMonness, Crespi, Hardt analyst Brian White, who rates Alphabet a buy with a $3,850 price target, implying nearly 40% upside, noted that Google&#39;s recent Data Cloud Summit saw the company unveil a number of new innovations all of which boost the strength of Google Cloud. \n \nWhite noted that a number of innovations were unveiled at the summit, all of which had the objective to allow “customers to work with limitless data, across all workloads, and extend access to everyone.” \n \nInnovations like BigLake, Spanner change streams, Vertex AI Workbench, Vertex AI Model Registry and Connected Sheets for Looker were all deemed impressive, with White calling them &quot;key,&quot; especially BigLake. \n \n$SNOW \n \nhttps://seekingalpha.com/news/3822054-amazon-and-microsoft-may-get-all-the-cloud-headlines-but-dont-sleep-on-google", "time": 1649572586.0, "sentiment": ""}, {"id": 451187232, "text": "$MSFT: Bulls need to defend this 296 level. Lose that, this can easily dip to 290 and then big level at 280. Need to be cautious if these big leaders start rolling over badly. \n$SPY", "time": 1649572391.0, "sentiment": ""}, {"id": 451181938, "text": "$SPY $TSLA $MSFT I only get my moonpies from Bass Pro Shops", "time": 1649568116.0, "sentiment": ""}, {"id": 451178631, "text": "@BullishOnUSA More trash from you.  Jesus where do you get off being so damn higher than thou?  There are plenty of stocks to buy during a recession.  $MO $JNJ $PG $MSFT companies that a wide moat and are essential during war, peace, prosperity and downturns.  Fucking wish I haven&#39;t seen you profile, now I want to smack the shit out of you.", "time": 1649565503.0, "sentiment": "Bullish"}, {"id": 451178378, "text": "$GOOG $NVDA $AMZN $MSFT $AAPL  \nU.S. consumer credit growth soars in February @ highest rate in 20 year!!!   \n  \nTotal consumer credit increased $41.8 billion in February, up sharply from a rise of $8.9 billion in the prior month, the Federal Reserve said Thursday. That translates into an 11.3% annual rate in February, up from a 2.4% gain in the prior month. This is the highest rate since November 2001 \n  \nWe have entered RECESSION folks but it will take time for it to really show in equities.  \n  \nFed on May 4th sheds $95 billion, 10 days later Fed hikes rates by 0.50%  \n  \n30yr mortgage quotes @ 5.66%   \n  \nQ1 earning likely to be a brutal eye open for some \nhttps://www.marketwatch.com/story/u-s-consumer-credit-growth-soars-in-february-11649358503 \n \nhttps://www.cnn.com/2022/04/07/economy/federal-reserve-consumer-debt-february/index.html", "time": 1649565311.0, "sentiment": ""}, {"id": 451177566, "text": "Equity Sentiment Weekly Recap: $MSFT is the #15 stock that institutions traded this week with 50.8K options contracts.\n\nMarket analysis included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (link in profile)", "time": 1649564633.0, "sentiment": ""}, {"id": 451173680, "text": "$MSFT i visit here to see some of the best 🤯🙃 people.  If you di the same then like or comment and if you are 🤯🙃 then say bad word 😜", "time": 1649561503.0, "sentiment": ""}, {"id": 451169067, "text": "$MSFT Option to look at... 👀 👀  $285.00 Put for Thursday, April 14, 2022. Roughly 6 Million dollars! 💰💰 WOAH 💰💰 Learn more on StockOrbit! Link on profile!!", "time": 1649557805.0, "sentiment": ""}, {"id": 451169058, "text": "$MSFT Option to look at... 👀 👀  $280.00 Put for Thursday, April 14, 2022. Roughly 10 Million dollars! 💰💰 WOAH 💰💰 Learn more on StockOrbit! Link on profile!!", "time": 1649557802.0, "sentiment": ""}, {"id": 451167053, "text": "$MSFT has a Return On Equity of 44.49%. This is amongst the best returns in the industry. https://www.chartmill.com/stock/analyzer/stock/MSFT?view=fundamental-analysis&amp;key=92318c9b-cb66-4932-8e30-5564fa1dd6a6&amp;utm_source=stocktwits&amp;utm_medium=FA&amp;utm_content=MSFT&amp;utm_campaign=social_tracking", "time": 1649556240.0, "sentiment": ""}, {"id": 451163142, "text": "$SPY $AAPL $MSFT $TSLA $NVDA \nCovid, War, Inflation?", "time": 1649553191.0, "sentiment": "Bullish"}, {"id": 451159486, "text": "Did you know $MSFT has a price target of $374.88 with a high of $425.00 &amp; a low of $320.00 according to 27 Wall Street analysts offering 12-month price targets in the last 3 months? But, according to 23 of the top analysts, the average PT is $371.43. https://bit.ly/3rewrOG", "time": 1649550265.0, "sentiment": ""}, {"id": 451158712, "text": "$FSLY who wants to buy it? $goog $net $AMZN $MSFT  \nhttps://youtu.be/QwRzko8IuHA", "time": 1649549687.0, "sentiment": ""}, {"id": 451158593, "text": "Did you know $RIVN has a Smart Score of 10 &amp; according to analysts has a Price Target of $76.50 with a Moderate Buy? Consensus breakdown says there are currently 8 bullish reviews. According to TipRanks data $RIVN investors also bought $AAPL $AMZN &amp; $MSFT https://bit.ly/3jmOkqo", "time": 1649549593.0, "sentiment": ""}, {"id": 451157828, "text": " Microsoft ($MSFT) said late on Thursday that it had thwarted an attempt by Russian hackers to go after different entities in Ukraine, including media organizations. \n \nCorporate Vice President, Customer Security &amp; Trust Tom Burt said the group, known as Strontium that it has &quot;tracked for years,&quot; was trying to take control of seven internet domains to coordinate the attacks. \n \nMicrosoft obtained a court order to take control of the domains &quot;to mitigate Strontium’s current use of these domains and enable victim notifications,&quot; It has seized control of more than 100 Strontium controlled domains, getting court orders 15 different times. \n \n \nIn addition to going after organizations in Ukraine, Strontium, which Microsoft called a &quot;Russian GRU-connected actor,&quot; was also targeting government institutions and think tanks in the U.S. and European Union. \n \nStrontium is also known as Fancy Bear or APT28 and is often linked to Russian intelligence. \n \n$BUG $HACK $IHAK $CIBR  \n \nhttps://seekingalpha.com/news/3822010-microsoft-disrupts-russian-hackers-targeting-ukraine-us-and-eu", "time": 1649549038.0, "sentiment": ""}, {"id": 451156296, "text": "$MSFT $AAPL $AMZN $NFLX https://factsheets.com/stockscreener/", "time": 1649547920.0, "sentiment": "Bullish"}, {"id": 451155044, "text": "Sweep Options Activity Weekly Recap: $MSFT is the #14 ticker with sweep activity that institutions traded urgently this week options with 45.0K sweep contracts, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (link in profile)", "time": 1649547043.0, "sentiment": ""}, {"id": 451154139, "text": "$FSR building those Ocean&#39;s now...\n$IBM $MSFT $AAPL $GOOGL \n\nFISKER 2022 - it&#39;s a start up (but not for long)\nhttps://youtu.be/kZK26hOx1JA", "time": 1649546380.0, "sentiment": ""}, {"id": 451152208, "text": "Finished the week with 20 Wins and 2 Losses. That is a Win Rate of 90.91% for the week. \n \n$SPY $SPX $FB $TSLA $MSFT \n \nHad a great week. Took it slow. Stayed extra patient and waited for good set ups. Could be an interesting short week, next week. Looking forward to it.", "time": 1649545016.0, "sentiment": ""}, {"id": 451151645, "text": "#GIndustry #BUY WK13 $WEX, $FFIV, $ORCL, $MSFT, $SNPS, PANW, MIME  #Software #Infra #Infrastructure VGT FTEC XT #growthstocks #stocks #finance #investment", "time": 1649544629.0, "sentiment": "Bullish"}, {"id": 451151418, "text": "$SPY Russia orcs will lose war. $AAPL $MSFT $NVDA", "time": 1649544462.0, "sentiment": "Bullish"}, {"id": 451148246, "text": "$ENPH Not making any conclusion just stating facts for people here \nJan 2021 price vs current prices   \n$GOOGL 1750  -------&gt; 2665 \n$MSFT  219  -------&gt; 296 \n$AAPL  132 --------&gt; 170  \n$ENPH  207 --------&gt; 195.  \n \nAnd please as a reaction don&#39;t come out and change horizon by shifting timelines back. Before that enph was just out of bankruptcy and was still risky whereas above stocks were megcaps with very low risk", "time": 1649542202.0, "sentiment": ""}]