[{"id": 451573501, "text": "$AAPL $NVDA $MSFT $AMZN $GOOG  \n2yr  @ 2.54% \n10yr @ 2.82% \n30yr @ 2.85%  \n \n&quot;Should&quot; come down soon. ALL very extended", "time": 1649745384.0, "sentiment": ""}, {"id": 451573293, "text": "$MSFT was analyzed by 58 analysts. The buy consensus is at 86%. So analysts seem to be very confident about $MSFT. https://www.chartmill.com/stock/analyzer/stock/MSFT?view=analyst-ratings&amp;utm_source=stocktwits&amp;utm_medium=ANALYST&amp;utm_content=MSFT&amp;utm_campaign=social_tracking", "time": 1649745300.0, "sentiment": ""}, {"id": 451570829, "text": "$AABB  $TSLA $AAPL $MSFT $GOOGL Looking at 1.49B shares additional paid in capital&gt;meaning the company has the ability to Retire or Buy Back 1.49B shares(85%) of the float in a instant along with this Bulls massive DD= MOASS  https://www.otcmarkets.com/otcapi/company/financial-report/298231/content   https://sites.google.com/view/soopersmart/home  This man is not your ordinary DD investor this is beyond that. READ THIS you decide?", "time": 1649744284.0, "sentiment": "Bullish"}, {"id": 451568852, "text": "$GOOG $AAPL $NVDA $MSFT $AMZN  \nWe all better hope this administration DOES NOT intervene this way. Will only cause prices to surge even higher.", "time": 1649743477.0, "sentiment": ""}, {"id": 451568116, "text": "$MSFT   Yikes! I was going to gas up the truck and go to the grocery store. Figured that would be about $450, but after looking at this it’s going to be the liquor store and get a bottle of vodka instead.", "time": 1649743188.0, "sentiment": ""}, {"id": 451567121, "text": "$MSFT $NVDA $AMD $DIS looks like we are in for another nasty day.", "time": 1649742816.0, "sentiment": ""}, {"id": 451562824, "text": "$MSFT I&#39;d love to dip buy at $275 again.  Please tank.", "time": 1649741074.0, "sentiment": ""}, {"id": 451559984, "text": "I added $MSFT 320c expired Jan 2023 to my trading list.", "time": 1649740040.0, "sentiment": ""}, {"id": 451559424, "text": "$SPY $TSLA $AAPL $msft $AMZN \n\nMy thoughts on today&#39;s selloff .... \n\nI&#39;m noticing the &quot;experts&quot; are talking a lot about GARP (growth at a reasonable price) lately. Including Cramer himself tonight. Last May, 11 months ago I featured a blog for members (SEE BELOW) on this very topic, and how these overvalued growth stocks would come crashing back to earth. And now everyone wants to play &quot;Monday morning quarterback&quot; after all the damage that will never be undone in most these names. \n\n460/462 was the level I had targeted for members as the level I was getting  short again, and I have stuck with my belief that we have been experiencing a bear mkt rally. I am still short the mkt, but have been bullish on commodities especially fertilizer names. The trend to me is lower overall, but I caution those who think we see a crash. I don&#39;t. \n\nWe are going to be setting up for a short term technical bounce this week. I have my shopping list ready. However, it will only be for a trade. ✌️", "time": 1649739841.0, "sentiment": ""}, {"id": 451559349, "text": "$MSFT Option to look at... 👀 👀  $280.00 Put for Thursday, April 14, 2022. Roughly 10 Million dollars! 💰💰 WOAH 💰💰 Learn more on StockOrbit! Link on profile!!", "time": 1649739816.0, "sentiment": ""}, {"id": 451558124, "text": "$MSFT $AAPL $BTC.X $SPY  Torro is smoking something 4 sure.", "time": 1649739429.0, "sentiment": ""}, {"id": 451557989, "text": "EOW Predictions by Torro:\n\n$SPY = 480\n$AAPL = 200\n$MSFT = 360\n$BTC.X = 20k (crap)\n\n🙂🙂📈👍", "time": 1649739378.0, "sentiment": "Bullish"}, {"id": 451553747, "text": "Sweep Options Activity: $MSFT is the #12 ticker with sweep activity where institutions are trading options urgently with 10.7K sweep contracts, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (link in profile)", "time": 1649737931.0, "sentiment": ""}, {"id": 451553415, "text": "$MSFT As long as the 1/25 low remains intact, the instrument remains in the sideways zone.  We don’t like to trade the sideways area, only like to trade the extreme areas in 3, 7 or 11 swing.   It is favouring more downside is taking place in the next cycle lower.  #Elliottwave #Trading #Stocks", "time": 1649737827.0, "sentiment": ""}, {"id": 451553226, "text": "$MSFT loaded up on weeklies.  We all know CPI will be shit tomorrow.  If it is not shockingly bad (or dare I say better than expected), hoping we get some reprieve tomorrow.", "time": 1649737759.0, "sentiment": "Bullish"}, {"id": 451552982, "text": "$MSFT Bought  calls 315 only 20 cents", "time": 1649737681.0, "sentiment": ""}, {"id": 451550237, "text": "$MSFT NEW ARTICLE : Markets: Google, Tesla, Microsoft among biggest laggards of the day https://www.stck.pro/news/MSFT/25932027", "time": 1649736796.0, "sentiment": ""}, {"id": 451548290, "text": "$MSFT MSFT 2022-04-11 Trade Analysis Video: \nhttps://www.youtube.com/watch?v=m3UCp4udcus", "time": 1649736131.0, "sentiment": ""}, {"id": 451545206, "text": "$TSLA $AAPL $AMD $MSFT $GOOG .", "time": 1649735163.0, "sentiment": "Bullish"}, {"id": 451544847, "text": "Measured over the past 5 years, $MSFT shows a very strong growth in EPS. https://www.chartmill.com/stock/quote/MSFT/fundamental-analysis?key=92318c9b-cb66-4932-8e30-5564fa1dd6a6&amp;utm_source=stocktwits&amp;utm_medium=FA&amp;utm_content=MSFT&amp;utm_campaign=social_tracking", "time": 1649735040.0, "sentiment": ""}, {"id": 451544763, "text": "$MSFT after the market flips to bullish tomorrow this will explode above $290. CPI will come in lower than expected and markets will be hugely green.", "time": 1649735014.0, "sentiment": "Bullish"}, {"id": 451543544, "text": "$MSFT 1 more bad day THEN LOAD UP WEDNESDAY ITS GOING TO 400 EOY", "time": 1649734646.0, "sentiment": "Bullish"}, {"id": 451543317, "text": "Unusual Options Activity: $MSFT is the #26 ticker with unusual activity from institutional traders with an average of 13% out of the money, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (link in profile)", "time": 1649734576.0, "sentiment": ""}, {"id": 451542510, "text": "Epic Games Raised $2 Billion. Its Valuation Rivals Publicly Traded Games Giants.  $SONY $U $EA $ATVI $MSFT \n\nhttps://newsfilter.io/a/a710f2307f78254526f1038eec737c6b", "time": 1649734376.0, "sentiment": ""}, {"id": 451541322, "text": "$GOOG $AAPL $AMZN $MSFT $NVDA  \nLoan Deqlinquences Of Greater Than 60 Days \n \nRetail Credit Card Going Up  \n \nCPI Tomorrow @ 8.5%  \n \nBig Tell Tale Sign Here Is Bonds But Let&#39;s Hope For Some Reprieve. May 4th Likely To Be Brutal", "time": 1649734002.0, "sentiment": ""}, {"id": 451541094, "text": "$MSFT will it hold again? probably doesnt close the week below 280 so any wicks below are high probability buys short term", "time": 1649733938.0, "sentiment": ""}, {"id": 451540994, "text": "$MSFT Double bottom on monthly. Expect to see this reverse.", "time": 1649733912.0, "sentiment": "Bullish"}, {"id": 451540375, "text": "  \n&quot;However, we now believe that it is prudent to begin modeling a gentle deceleration in commercial Office 365 seat growth given the combo of the pandemic/work-from-home boost fading and Office 365 penetration into the broader Office installed base now reaching 80%, offset by strong E5 traction and the price increase,&quot; Keirstead wrote in a note to clients. \n \nAs such, he lowered the estimates for Office 365 revenue growth to 17.4% from 19.1% for Microsoft&#39;s (MSFT) fiscal 2023. \n \nKeirstead also lowered estimates for Windows, due to a potential risk of slowing PC growth and in Server Product and LinkedIn due to tough comparisons. \n \n$MSFT   \n \nhttps://seekingalpha.com/news/3822364-microsoft-tumbles-as-ubs-suggests-office-365-could-see-gentle-deceleration", "time": 1649733723.0, "sentiment": ""}, {"id": 451540332, "text": " $MSFT   \n \nMicrosoft shares tumbled on Monday after investment bank UBS said the tech giant could start to see a &quot;gentle deceleration&quot; in Office 365-related growth. \n \nAnalyst Karl Keirstead, who rates Microsoft buy with a $360 price target, noted that Office 365 is the company&#39;s second-largest product, behind Azure and likely generated $35.1 billion in fiscal 2022 revenue, growing at between 19% and 21% quarter-over-quarter for the last six quarters. \n \nBut given that it likely has &quot;high penetration&quot; and benefits from the pandemic and work-from-home boom are starting to fade, Office 365 growth could start to slow. \n \nKeirstead added that Microsoft remains the dominant franchise in the employee productivity software market, with the race between it and Google ($GOOG) ($GOOGL) &quot;effectively over&quot; and is now trying to displace Microsoft Azure by making Google Cloud more competitive.", "time": 1649733712.0, "sentiment": ""}, {"id": 451537269, "text": "$TGT I got a bad feeling about all stocks with fed bullshit in the morning $MSFT", "time": 1649732840.0, "sentiment": ""}]