[{"id": 453981470, "text": "Thursday Option Volumes\n\n$AAL 437k (61% call/39% put)\n$MSFT 321k (54% call/46% put)\n$UAL 287k (68% call/32% put)\n$AMZN 273k (49% call/51% put)\n\nCheckout @SweepCast For More Info : https://bit.ly/sweepcastoptions", "time": 1650613671.0, "sentiment": ""}, {"id": 453980451, "text": "$AAPL $DIS $MSFT The sauce has been killing it since 2015\nLove it", "time": 1650613173.0, "sentiment": ""}, {"id": 453979788, "text": "$FB $NFLX $MSFT $TSLA $AAPL  expects every stock now to pull a netflix and go up or down 30% on ER’s now but in reality MM’s know people are betting on that and theyll reap the rewards and either make the stock do opposite of what is intended or crush options.", "time": 1650612863.0, "sentiment": ""}, {"id": 453979492, "text": "$FB $NVDA $MSFT \n\nThese companies are at March lows but Nasdaq futures is still up 700 points from March low.", "time": 1650612742.0, "sentiment": ""}, {"id": 453978135, "text": "$CRSR $NVDA $AMD $MSFT $SOXL \nCorsair crashed with prelim Q1 numbers. \nHope you know what that means. \n\nCorsair Gaming stock sinks aftermarket on weak prelim Q1 results\n\nhttps://seekingalpha.com/news/3825599-corsair-gaming-stock-sinks-aftermarket-on-weak-prelim-q1-results", "time": 1650612108.0, "sentiment": "Bearish"}, {"id": 453975189, "text": "$MSFT my calls at 1 cents already 0 Tomorrow 😞😔😞", "time": 1650610800.0, "sentiment": ""}, {"id": 453972901, "text": "$MSFT $SPY $AAPL ooooouch  another down day. Atleast I have my favorite Britney Spears cd playing on full blast.", "time": 1650609766.0, "sentiment": ""}, {"id": 453972346, "text": "$MSFT just turn off the tv ma", "time": 1650609531.0, "sentiment": ""}, {"id": 453970865, "text": "@Bartank I&#39;ve owned $fb since the early days (2007) along with $goog $msft $appl $tsla. And you know what? FB hasn&#39;t been a good investment.. especially the past 5 years. FB has been drastically outperformed by other stocks in my portfolio. Don&#39;t believe me? Type it into Google finance. \n\nI&#39;m only swing trading $FB right now based on poor performance. It always seems to tank. Maybe that will change, but so far every time I&#39;ve sold it, I&#39;ve been able to buy it back much lower.\n\nhttps://g.co/finance/FB:NASDAQ?window=5Y&amp;comparison=NASDAQ%3AMSFT%2CNASDAQ%3AAAPL%2CNASDAQ%3ANVDA%2CNASDAQ%3ATSLA", "time": 1650608978.0, "sentiment": ""}, {"id": 453970620, "text": "$AMZN $GOOG $AAPL $NVDA $MSFT  \nNasdaq -  down 18.5%    from ATH \n \nSpy - down 9.2%  \n \nDow -  down 6.3%", "time": 1650608886.0, "sentiment": ""}, {"id": 453970111, "text": "$MSFT options show we will be at 285 tomorrow", "time": 1650608687.0, "sentiment": "Bullish"}, {"id": 453969703, "text": "🔥JUICY TRIGGERS🔥 \n⚔️TRADE THE PLAN⚔️ \nNOT LOOKING FOR MUCH TOMORROW, EXCEPT A CHOPPY DAY. \n$SPY PUTS&lt;437.09📉 \n$MSFT PUTS&lt;280.01📉 \n$TWTR CALLS &gt;47.94📈 \n$AAPL PUTS&lt;165.86", "time": 1650608540.0, "sentiment": ""}, {"id": 453969085, "text": "$MSFT Microsoft Pays Top Dollar for Bug Bounties\n\nhttps://www.thestreet.com/technology/cybersecurity/microsoft-hackers-reward", "time": 1650608288.0, "sentiment": ""}, {"id": 453968768, "text": "$MSFT 271 tomorrow", "time": 1650608170.0, "sentiment": "Bearish"}, {"id": 453964846, "text": "@AB31 people like you were saying the same thing when I compared Thai 2 companies to $MSFT, o as you wish and so will I! As this is “Merica", "time": 1650606657.0, "sentiment": "Bullish"}, {"id": 453964040, "text": "$AAPL $AMZN $GOOGL $MSFT which one goes down next?", "time": 1650606364.0, "sentiment": ""}, {"id": 453961405, "text": " $TWTR   \n \nTwitter (NYSE:TWTR) shares slipped on Thursday after investment firm Truist downgraded the stock, citing concerns over valuation and worries over headwinds linked to foreign exchange and Russia&#39;s invasion of Ukraine. \n \nAnalyst Youssef Squali lowered his rating to hold from buy, but kept the $50 price target, noting that the stock approached the level due to #Elon Musk&#39;s offer to buy the company for $54.20 per share in cash, which the analyst viewed as &quot;fair, all things considered.&quot; \n \n \nSquali added that it could be possible that #Musk fails in his effort to buy Twitter (TWTR), but a competing bid is unlikely due to the fact that certain strategic companies, like Google ($GOOG) ($GOOGL) and Microsoft ($MSFT) are &quot;restricted&quot; in their ability to do more deals. \n \n \nAdditionally, the size of the investment, at roughly $43 billion, would be onerous to all but a few potential acquirers.", "time": 1650605408.0, "sentiment": ""}, {"id": 453959227, "text": "$MSFT $UMC $MU $TSLA Dementia Joe has announced that he will be running in 2024. With his agenda and current rate of the economy decline, the only thing he will be running after will be the unstoppable inflation rate. Am selling all my stocks until this fool gets voted out. Prefer to keep my profit vs having this fool use it to figth his personal vendetta agaibst Putin. Maybe he is doing this to stop Zelenisky from disclosing any personal corruption records he has on him??? Wondering!!", "time": 1650604677.0, "sentiment": ""}, {"id": 453957995, "text": "$MSFT FKd they gonna run it down to get in before er to ride it up watch! Criminals", "time": 1650604262.0, "sentiment": ""}, {"id": 453955960, "text": "$MSFT Option to look at... 👀 👀  $305.00 Call for Friday, April 22, 2022. Roughly 9 Thousand dollars! 💰💰 Learn more on StockOrbit! Link on profile!!", "time": 1650603629.0, "sentiment": ""}, {"id": 453955397, "text": "$FB $GOOGL $MSFT $AMZN these are value traps now?", "time": 1650603471.0, "sentiment": "Bearish"}, {"id": 453954746, "text": " The Kotick-led Activision ($ATVI) recently disclosed that it received a request for information from the U.S. Securities and Exchange Commission and a grand jury subpoena from the Justice Department likely related to trading before the announcement of Microsoft&#39;s ($MSFT) planned purchase of the video game maker. \n \nhttps://seekingalpha.com/news/3825283-activision-adding-two-women-to-its-board-of-directors-ahead-of-microsoft-deal", "time": 1650603263.0, "sentiment": ""}, {"id": 453954715, "text": " Activision Blizzard ($ATVI) is adding two women executives to its board of directors, Lulu Cheng Meservey and Kerry Carr, the video game publisher said on Thursday. \n \nCheng Meservey joined the board on April 16 and Carr would be elected at the company&#39;s annual meeting in June. \n \nMeservey is on the Workplace Responsibility Committee and will go up for re-election at the company&#39;s annual meeting. If elected, Carr will join the Audit Committee. \n \nPresently, Cheng Meservey is the VP of communications at newsletter company Substack, while Carr is currently an SVP with spirits maker Bacardi and previously worked at The Walt Disney Company (DIS). \n \nThe two women replace Hendrik J. Hartong III and Casey Wasserman, who according to the company, have chosen not to stand for re-election. \n \nActivision, which is in the process of being acquired by Microsoft ($MSFT) for almost $69 billion, or $95 per share in cash, has had a history of having a toxic culture under Chief Executive Bobby Kotick.", "time": 1650603254.0, "sentiment": ""}, {"id": 453954512, "text": "$KHC Kraft Heinz partners with Microsoft for supply chain upgrade $MSFT", "time": 1650603187.0, "sentiment": "Bullish"}, {"id": 453954467, "text": "$AMD $NVDA $AMAT $MSFT already up over 100% on these. The current adminstration appears to be more concerned in settling a score with Putin vs fixing the economy and a rising inflation. Am not anticipating anything to get better while dementia joe is wandering around and farting on our economy. Will be liquidating most of my holdings when and if the market goes green. As it stands, retail shareholders will liekly default way b4 Russia does b/c of our incompetent president who appears to be lost and have no clue in what to do. \n \nLet&#39;s go Brandon.", "time": 1650603173.0, "sentiment": ""}, {"id": 453952881, "text": "$AAPL $MSFT $GOOG $AMZN yo, simple, everybody fire everybody else =&gt; Feds will retract May rate hike immediately", "time": 1650602681.0, "sentiment": "Bullish"}, {"id": 453949793, "text": "$MSFT $GOOG $NVDA can I say hell is coming…OMG … sell sell sell breaking news 50 pts hike… 🤑 wished had cash to buy nvda and alphabet ….such a bargain", "time": 1650601724.0, "sentiment": "Bullish"}, {"id": 453949328, "text": "$FUBO $msft $NFLX It&#39;s sad that when things get really bad, we don&#39;t have a leader that can rally the troops. November can&#39;t get here soon enough.", "time": 1650601577.0, "sentiment": ""}, {"id": 453949157, "text": "$NVDA Yes.  This moves with the market but not when it is at the lowest price in the year!  This is a bargain price.  Yes everything fell today - but look at $AAPL and $MSFT and look at $NVDA - $NVDA took the greatest dip ever  - it was way overdone and it will get corrected tomorrow.  The market does not need to be green - it can be neutral or even red and NVDA will shoot  up at open and then maybe then move slowly with the market because people will be buying it as an investment", "time": 1650601526.0, "sentiment": "Bullish"}, {"id": 453949059, "text": "Sweep Options Activity: $MSFT is the #10 ticker with sweep activity where institutions are trading options urgently with 16.7K sweep contracts, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (Link in profile - @InsiderFinance)", "time": 1650601498.0, "sentiment": ""}]