[{"id": 437055001, "text": "$BTC.X $SOS $MSFT For a limited time,, we are opening our trading chatroom to the public most-profitable.optionsmarketmovers.com", "time": 1645085991.0, "sentiment": ""}, {"id": 437054188, "text": "Microsoft Corporation&#39;s President and Vice Chair just disposed of 33,966 shares  https://www.conferencecalltranscripts.com/summary/?id=10460065 $MSFT", "time": 1645085732.0, "sentiment": ""}, {"id": 437051320, "text": "$MSFT  \n \nMSFT Here is something to keep in mind \n \n&quot;People have always had this assumption that retail traders aren&#39;t a market force, but retail became more active recently,” Moez Kassam, chief investment officer at the Anson Investments Master Fund. &quot;This is the new investor crowd and it&#39;s here to stay.&quot; \n \nThis is why we built the Social Sentiment Dashboard, so you can stay on top of this market force and use it to your advantage. This is a critical alternative data point that investors and traders use. \n \nhttps://utradea.com/social-dashboard?utm_source=stocktwits&amp;utm_medium=ssd-stocktwits&amp;utm_campaign=sm_202202016", "time": 1645084782.0, "sentiment": "Bullish"}, {"id": 437051210, "text": "$NVDA somewhat expected especially given the the run up to end of day\n\nThis is not 2021.  NASDAQ is in a bear market now and may very be until October or later.  Everyone expected a beat so itwas priced in so it sold off. \n\nBought in on the drop to the 250s but now looks like a bear trap. \n\n$AAPL and $MSFT sold off into or after their beats so the market is cautious and all in for the next jump no longer works. \n\nIt&#39;s not a $NVDA thing, its just that to the moon and NVDA 350 by next week is not a strategy but a recipe for a over allocation or margin call.\n\nWelcome to 2022,  and still no fucken flying cars", "time": 1645084744.0, "sentiment": ""}, {"id": 437050690, "text": "$NVDA why introduce LHR cards if $ETH.X 2.0 is around the corner?\n\nNever seen so many gpus on the shelf at microcenter \n\nStill bullish af \n\n$MSFT &amp; $NVDA are the real Meta $FB", "time": 1645084558.0, "sentiment": "Bullish"}, {"id": 437047257, "text": "$NVDA buying options in this environment thinking lot ER and guidance will matter is pipe dream 80% of the time. The big boys decide to move the stock when they will feel enough folks capitulated. It&#39;s going to be bear or choppy market for the foreseeable to inflation is under 3% $AMD $FB $MSFT $SQ", "time": 1645083415.0, "sentiment": "Bullish"}, {"id": 437046324, "text": "$MSFT Bill Ackman picked the wrong $NFLX. The next Netflix is one for the gaming world, aka Microsoft. If you think movies are expensive to produce, video games are even more so.\n\nIt helps that a) $MSFT is the second biggest console maker b) owns the second biggest cloud c) the third biggest video games producer (after absorbing $ATVI)", "time": 1645083121.0, "sentiment": ""}, {"id": 437044563, "text": "$MSFT I think this is a good buy at 300", "time": 1645082559.0, "sentiment": ""}, {"id": 437041731, "text": "$MSFT Feb 16               \n=&gt; Sell               \n◆ Search for 10 day stock forecast by pretiming               \nhttp://www.google.com/search?q=10+day+stock+forecast               \n◆ Forecast of Upper~Lower price range band for the next 10 days               \nPrice: 287.43   ~ 299.50            \n% Change: -4.03%  ~ 0.00%           \nThe Buy-Sell strength is suitable for the current trend and it&#39;s about to begin a downward trend as a rebounding trend gradually gives way to increasing limited rises and strong falls in the falling section.", "time": 1645081676.0, "sentiment": ""}, {"id": 437040749, "text": "$MSFT Volatility is King!! Simulated Weekly $295.0 CALLS for Thursday&#39;s open on StockOrbit. \n https://apps.apple.com/us/app/stockorbit/id1541560646", "time": 1645081373.0, "sentiment": ""}, {"id": 437039699, "text": "How Does Tim Cook&#39;s Pay Compare To Amazon and Microsoft&#39;s CEOs?\n\n$AMZN $MSFT $AAPL\n\nhttps://www.thestreet.com/investing/how-does-tim-cooks-pay-compare-to-amazon-and-microsofts-ceos", "time": 1645081060.0, "sentiment": ""}, {"id": 437038869, "text": "$MSFT my 2/18 315 calls dead ?", "time": 1645080787.0, "sentiment": "Bullish"}, {"id": 437038105, "text": "$MSFT $303-$305 tomorrow", "time": 1645080541.0, "sentiment": "Bullish"}, {"id": 437037058, "text": "$AAPL $MSFT $GOOG load upppp!! Rate hikes is nothing!! Just like Russia and Ukraine talk means nothing!!! Load up don’t get fooled by these media clowns", "time": 1645080244.0, "sentiment": "Bullish"}, {"id": 437035027, "text": "NASDAQ 100 ($QQQ) Most Recommended Stocks to buy based on at least 10 analysts recommendations $MSFT $WDAY $AMZN $MDLZ  \n \nLearn more: https://www.finscreener.org/analysts/most-recommended-stocks/nq100", "time": 1645079639.0, "sentiment": ""}, {"id": 437033803, "text": "$UVXY $SPY $IWM $AAPL $MSFT - Just to tell you how utterly disconnected the market is from the economy. The economic data released this and last week was worse or far worse than expected. CPI, PPI, Consumer Sentiment, Personal Debt... markets did NOTHING. Today, retail was better than expected, NOTHING. When Jerome Bowell speaks, markets move. Were all retailers buying and selling in unison by the second? This market used to be fun to trade in.. now? It&#39;s Fed control. Bonds keep climbing, home builder confidence falls stocks aren&#39;t phased. This is the bubble the Fed created with their moronic QE and 0%. They&#39;ve inflated the largest bubble in US history. Infinite QE, buying corporate bonds, lead to historic stock buy backs. Now? Their hands are tied. If they do nothing and keep rates at 0.1% and pumping QE, inflation will  turn into hyper-inflation. If they raise, it&#39;ll throw the US into recession and they&#39;ll prick their own bubble. Either way by summer, we will feel the pain. Watch!", "time": 1645079302.0, "sentiment": ""}, {"id": 437031816, "text": "$MSFT Next acquisition should be $VMEO", "time": 1645078704.0, "sentiment": "Bullish"}, {"id": 437026587, "text": "$MSFT", "time": 1645077221.0, "sentiment": ""}, {"id": 437024763, "text": "$MSFT if y’all actually care to make a difference is this Ponzi scheme of a market we got going on, I suggest you read this and go post your comments of the proposal on the SEC website", "time": 1645076699.0, "sentiment": ""}, {"id": 437022493, "text": "$MSFT 188", "time": 1645076125.0, "sentiment": ""}, {"id": 437021812, "text": "$AREB 2.14 to 2.30 with a 1 share buy...low float madness... $AAPL  $tesla $MSFT $SNDL", "time": 1645075956.0, "sentiment": ""}, {"id": 437019788, "text": "$MSFT 📜 SEC Form 4: Smith Bradford L gifted 33,966 shares, decreasing direct ownership by 5% to 588,494 units\n\nhttps://quantisnow.com/insight/2430906?s=s\n\n45 seconds delayed.", "time": 1645075465.0, "sentiment": ""}, {"id": 437019705, "text": "$MSFT [15s. delayed] filed SEC form 4: President and Vice Chair SMITH BRADFORD L: \nGifted 33,966 of Common Stock at price $0 on 2022-02-15 https://s.flashalert.me/E1NPr", "time": 1645075443.0, "sentiment": ""}, {"id": 437015519, "text": "$NVDA This pull back is fake !  Just like $MSFT  this will be +5% by open", "time": 1645074426.0, "sentiment": "Bullish"}, {"id": 437013650, "text": "Invest with an outcome based approach on $MSFT. Accelerate gains by 2.1x and make up to 24.3% (26.4% annualized) on $MSFT through 01/20/2023.\n\nBuy 2 $300 calls\nSell 2 $335 calls\nSell 1 $300 put\n 1/20/23 expiration\nhttps://o.oliveinvest.com/07ncfh", "time": 1645074023.0, "sentiment": ""}, {"id": 437013454, "text": "$MSFT still above 297 even after divy day", "time": 1645073986.0, "sentiment": ""}, {"id": 437013006, "text": " Zynga ($ZNGA) could see an extended FTC antitrust review of its planned $12.7B sale to Take-Two Interactive ($TTWO). \nThe U.S. Federal Trade Commission may look at pursuing &quot;creative approaches&quot; to the antitrust review, which could lead to a longer timeline, according to a CTFN report, which cited a source. Take-Two is said to be confident that it&#39;s on path to get all necessary regulatory approvals. \n \nThe Zynga deal seemed to usher in a spate of deals in the video game sector including Microsoft&#39;s ($MSFT) planned almost $70B purchase of Activision ($ATVI) and Sony&#39;s ($SONY) deal to acquire &#39;Halo&#39;/&#39;Destiny&#39; developer Bungie in $3.6B deal. \nTake-Two management is said to believe that a review might be easier than others in the gaming industry since its focused on the crowded mobile gaming space rather than console games or virtual reality, according to the CTFN report. \n \nhttps://seekingalpha.com/news/3800942-zynga-may-see-extended-antitrust-review-of-planned-sale-to-take-two-report", "time": 1645073877.0, "sentiment": ""}, {"id": 436999100, "text": "$NVDA this is waiting for the phone call like with $DIS or $MSFT", "time": 1645071116.0, "sentiment": "Bullish"}, {"id": 436995846, "text": "@ghostdemon I prefer TECL because 50% of it is in $MSFT, $Aapl, and $NVDA. Those are probably 3 of the 5 most well run companies in the world", "time": 1645070524.0, "sentiment": ""}, {"id": 436991329, "text": "$MSFT  What&#39;s good for Cisco is good for Microsoft. $XLK", "time": 1645069764.0, "sentiment": "Bullish"}]