[{"id": 439332563, "text": "$IRNT REVENUES GOING UP  \n \n$msft $dell $aapl $NVDA", "time": 1645815977.0, "sentiment": ""}, {"id": 439331745, "text": "$MSFT 260P Exp:18-Mar-22 --  🔥 Total(Day): $39,250 \n$MSFT 260P Exp:16-Sep-22 --  🔥 Total(Day): $89,460 \n#UnusualActivity \n \n \nSign-up free for beta ver.:https://app.jarvisalerts.com \ncharts: courtesy of finviz", "time": 1645815817.0, "sentiment": ""}, {"id": 439331239, "text": "$MSFT Here we go!!!", "time": 1645815718.0, "sentiment": "Bullish"}, {"id": 439329280, "text": "$VUZI will be showcasing its full line of smart glasses at Mobile World Congress Barcelona 2022 Feb 28 - Mar 3 Barcelona, Spain. TeamViewer will join Vuzix at this event to demonstrate its Frontline AR solution running on Vuzix smart glasses.\n$amzn $msft $fb", "time": 1645815317.0, "sentiment": "Bullish"}, {"id": 439320468, "text": "Yesterday call for $msft buyout", "time": 1645812294.0, "sentiment": ""}, {"id": 439319889, "text": "$MSFT Volatility is King!! Simulated Weekly $295.0 CALLS for Friday&#39;s open on StockOrbit. \n https://apps.apple.com/us/app/stockorbit/id1541560646", "time": 1645812041.0, "sentiment": ""}, {"id": 439318399, "text": "$MSFT 302 today", "time": 1645811229.0, "sentiment": "Bullish"}, {"id": 439316539, "text": "$PANW check out $CISO !!!! $MSFT , $CRWD major squeeze outstanding opportunity!!", "time": 1645810023.0, "sentiment": "Bullish"}, {"id": 439309791, "text": "$AAPL $MSFT $QQQ you have no idea what you’re talking about. On the contrary iPhone users are among the most loyal in any industry. Do you read ? Blocked", "time": 1645803500.0, "sentiment": ""}, {"id": 439309612, "text": "$AAPL  $MSFT $QQQ\n\nhttps://thehill.com/policy/defense/593311-us-approves-100m-sale-to-upgrade-taiwans-missile-defenses?amp\n\nBoth going much lower . No loyalty here people switching to better phones , better video games (Sony ps5 or Nintendo switch) apple going to get sliced down to 125 and Microsoft down as well as people are sick of video games they want to play ball, swim, not on a screen", "time": 1645803310.0, "sentiment": "Bearish"}, {"id": 439307169, "text": "$SPY I wasn&#39;t born when Hitler went on his run in WW2,  but I hope the market crash when Putin does his run in WW3, while Biden do more useless sanctions and pump the stock market more at 50% inflation.  $AMZN $AAPL $MSFT $TSLA", "time": 1645800446.0, "sentiment": "Bearish"}, {"id": 439306185, "text": "$AAPL $TSLA $MSFT $SPY", "time": 1645798981.0, "sentiment": ""}, {"id": 439306112, "text": "$spy $aapl $msft $TSLA wrong we going up", "time": 1645798866.0, "sentiment": ""}, {"id": 439305964, "text": "$RBLX everything did over 1,000.% yesterday $MSFT $AMZN cant expect this to go up today. Amazon did 4,000% on all OTM calls. Be real. $SPY they going to bring them down!", "time": 1645798642.0, "sentiment": "Bearish"}, {"id": 439305662, "text": "No pump today $spy $aapl $msft $TSLA", "time": 1645798230.0, "sentiment": ""}, {"id": 439302917, "text": "$MSFT China will take Taiwan, Tailand, Mongolia,...\nRussia will invade Ukraine, Moldova,...\nThe only way to stop the expanssion is by nuclear wars. \nThe world is changing, Covid is a warming exercice, what&#39;s coming next is WW3.", "time": 1645794676.0, "sentiment": "Bearish"}, {"id": 439301290, "text": "$SPY $SOXL $AAPL $NVDA $MSFT \nOMG. 🥶  Please stop 🥺\n&#39;Rocket strike. US fears capital could  fall soon&#39;", "time": 1645792802.0, "sentiment": ""}, {"id": 439301040, "text": "Looking at the last year, $MSFT shows a very strong growth in Revenue. The Revenue has grown by 20.63%. https://www.chartmill.com/stock/analyzer/stock/MSFT?view=fundamental-analysis&amp;key=92318c9b-cb66-4932-8e30-5564fa1dd6a6&amp;utm_source=stocktwits&amp;utm_medium=FA&amp;utm_content=MSFT&amp;utm_campaign=social_tracking", "time": 1645792560.0, "sentiment": ""}, {"id": 439298665, "text": "$MSFT Volatility is King!! Simulated Weekly $295.0 CALLS for Friday&#39;s open on StockOrbit. \n https://apps.apple.com/us/app/stockorbit/id1541560646", "time": 1645790463.0, "sentiment": ""}, {"id": 439296323, "text": "$SPY anyone notice a pattern with Biden.  \n Covid happens, Biden pump the stock market.  \n  inflation happen, Biden pump the stock market,  \n Putin invades Ukraine, Biden pump the stock market. \nHe never solved any of those problems.  He just know to pump the stock market to hide the bad news, with an already 8% inflation and we are paying a king&#39;s ransom for food and gas!  I am starting to regret voted for Biden in 2020. $AMZN $MSFT $AAPL $GOOG  \nI mean, He and Powell pumped the stock market on the day Putin invaded Ukraine and innocent children are dying!  Have some decency for the ones suffering Biden, and don&#39;t pump the stock market during wartime!", "time": 1645788622.0, "sentiment": "Bearish"}, {"id": 439293926, "text": "$MSFT msoft got laid today...", "time": 1645787100.0, "sentiment": ""}, {"id": 439293267, "text": "$SPY look Biden or MM or Powell or whoever is controlling the market today.  We are in a damn war so can you have some decency and not pump the stock market when innocent Ukrainians children are dying?  Imagine if it was your kids over there getting fired upon and stop pumping the stock market during a fuking war!   Today happened , okay fine.  But tomorrow, get this back to the path of under $400, use the CPI report of 8% inflation as an excuse if you have to.  Do you really want 4 more years of Trump because a pumped stock market on the day Putin invaded Ukraine is not a good look for Biden and the democrats with the upcoming midterms this year!!! $AMZN $MSFT $GOOG $AMZN", "time": 1645786695.0, "sentiment": "Bearish"}, {"id": 439293246, "text": "$PLTR $MSFT $AAPL $LCID seem to be some of the talked about stocks. Looking to learn how to invest - better. Anyone have good books or videos I can check out?", "time": 1645786683.0, "sentiment": ""}, {"id": 439291670, "text": "$SPY When a president is pumping the stock market during a war, it shows that he cares more about money than the lives of innocent Ukrainains.  Today was not a good look for you Biden.  Don&#39;t let it happen again tomorrow or next week.  You will lose the midterms if you do, I guarantee it! $DWAC $SPOT $AAPL $MSFT", "time": 1645785753.0, "sentiment": "Bearish"}, {"id": 439291229, "text": "$SPY $QQQ $AMZN $MSFT This is why they are in my Ignore list. Flip a coin and it’s about the same as their predictions.", "time": 1645785512.0, "sentiment": ""}, {"id": 439289714, "text": "$MSFT \n\nIf you look at the candles &amp; 10SMA I highlighted, that is just a very aggressive smack down from that moving average both times. Wow this has been a complete train wreck starting 12/29. It has traded down -19 days- 1/24 - exactly a month ago. Our last top high was on 2/2, 16 trading days ago but we are above the 10 but overall some really bearish stuff going on right here with the moving averages. Double MACD cross below 0, RSI is hitting oversold when MACD red but not hitting overbought when MACD is green, currently sitting at 47.50.. is it going to continue the pattern of hitting oversold? That’s what you do in a bear market but we’re not ready for that conversation yet. Right? 🤭 This will be interesting tomorrow..", "time": 1645784735.0, "sentiment": ""}, {"id": 439289620, "text": "$MSFT $AAPL $AMD $AMZN - Question for the bulls: Since tapering, rising rates, worse than expected CPI, POI, Counter Sentiment was apparently “priced in”, is war in Ukraine also priced in? Thanks.", "time": 1645784685.0, "sentiment": ""}, {"id": 439288073, "text": "$SPY dear russia, if you could hack $MSFT in a benign but very public way that would be great. regards, my puts.", "time": 1645783904.0, "sentiment": ""}, {"id": 439287643, "text": "$MSFT  failed breakdown attempt can send this back thru 300 tomorrow if the mkt shifts itself back to bull for day 2\n\nLink in bio—live zoom all day", "time": 1645783698.0, "sentiment": ""}, {"id": 439287572, "text": "$MSFT Bill probably sitting pretty in his doomsday bunker or whateva 💅💣", "time": 1645783671.0, "sentiment": "Bearish"}]