[{"id": 449053610, "text": "$BIGC  getting more real every day $MSFT", "time": 1648827916.0, "sentiment": "Bullish"}, {"id": 449053191, "text": "As Oil Briefly Dips Below $100, Russia and Europe Play a Game of Chicken  $TPL $RBLX $MSFT $GS $NVDA \n\nhttps://newsfilter.io/a/7a6f421381776f9acaf1494ef27f0d02", "time": 1648827711.0, "sentiment": ""}, {"id": 449050444, "text": "$MSFT At the National Press Club in Washington, DC, he will speak to members of the press. \n \nhttps://teachtactic.com/united-states-to-invest-usd30m-in-jamaica/", "time": 1648826420.0, "sentiment": ""}, {"id": 449048394, "text": "$MSFT", "time": 1648825307.0, "sentiment": "Bullish"}, {"id": 449044542, "text": "$TSLA  $AAPL $MSFT $SPY \nWatching  the Reds 😎", "time": 1648822352.0, "sentiment": "Bearish"}, {"id": 449039840, "text": "$MSFT $ATVI Amy Hood \n\nhttps://newsfilter.io/a/0231db824dcab382968201cc8c83c89c", "time": 1648818170.0, "sentiment": ""}, {"id": 449039483, "text": "$MSFT $AMD $SPY  Daily Trade Alert and free newsletter featuring stock picks, trade ideas and investment recommendations from a handful of the nation’s leading analysts. \n \nConnect with  Trade Idea: tinyurl.com/th6Ytyh4Er3s", "time": 1648817758.0, "sentiment": "Bullish"}, {"id": 449035748, "text": "$AAPL $MSFT $TSLA $SPY $PATH \nWow everything is Ripping  now. Including small caps  🤑", "time": 1648813086.0, "sentiment": "Bullish"}, {"id": 449035042, "text": "$TSLA $AAPL $MSFT $AMZN $SPY \nI am sorry bulls. At this price, no institutions or retails will buy shares. You know that. \nInstitutions are keeping up at high, so they can take profits at ceiling. \nWhat would you do in the middle of war, or preparation for May QE ending? \n\nRetails. Please don&#39;t get pumped to pay ceiling price 👇", "time": 1648812293.0, "sentiment": "Bearish"}, {"id": 449034591, "text": "$MSFT  Who voted for Biden? How a stupid president can be elected as a leader of the US. After all chaos that biden caused by his stupid decisions like the stupid money printing that is now causing inflation that will result in a severe recession during the next few months + the Afghan Chaos + Covid mandate and layoffs + the unplanned energy transition that is causing hyperinflation + and now the war in Ukraine that will end in a total failure for Europe and the US.  \nDo you know that leaders of many countries are no longer replying to Biden calls! This would never happen if Trump was elected.  \nTrump is the only hope we have. Democrat Party is a garbage party.", "time": 1648811841.0, "sentiment": ""}, {"id": 449034565, "text": "$MSFT Option to look at today.. 👀 👀  $275.00 Put for Friday, March 11, 2022. Roughly 181 Thousand dollars! 💰💰 Learn more on StockOrbit! Link on profile!!", "time": 1648811815.0, "sentiment": ""}, {"id": 449032611, "text": "$SPY $AAPL $MSFT $AMZN $TSLA been saying it since Jan 1: \nOil spikes, folks have less disposable income, recession comes.", "time": 1648809784.0, "sentiment": ""}, {"id": 449032238, "text": "$MSFT https://youtube.com/channel/UCUXukzKCdvgsq5fGhUKImdQ #shorts📌", "time": 1648809397.0, "sentiment": ""}, {"id": 449032139, "text": "$SPY $AAPL $MSFT $AMZN $TSLA \nKey Fed inflation gauge hits 6.4% - the highest in FORTY YEARS - as soaring gas and food prices force families to cut back on spending\n\nhttps://www.google.com/amp/s/www.nytimes.com/2022/03/31/business/economy/pce-inflation-february.amp.html", "time": 1648809273.0, "sentiment": "Bearish"}, {"id": 449030971, "text": "$MSFT is bill gates here?", "time": 1648808241.0, "sentiment": ""}, {"id": 449027407, "text": "$MSFT", "time": 1648805538.0, "sentiment": "Bullish"}, {"id": 449026640, "text": "$UPST You&#39;re in a rather unique and valuable position. Traditionally, millions pile in to the growth stocks for almost guaranteed returns like $AAPL $MSFT $AMZN $TSLA. And they have always led the market (many years) in their ability to produce solid year over year ROI for investors. They take the market higher AND the market has already priced in their forward growth many times over. \n \nSide by side, UPST is growing monumentally faster than any of them in their first five years of operations with sales growing 4300% and profits growing over 3000%. \n \nUPST hasn&#39;t even come close to pricing in thisgrowth rate, nor has it even remotely touched its $1.8 billion in sales for 2022 and over $6 per share earnings for next year. And beyond that? \n \n$550 for now", "time": 1648805026.0, "sentiment": ""}, {"id": 449025795, "text": "$MSFT huge buying on that dip", "time": 1648804499.0, "sentiment": "Bullish"}, {"id": 449018109, "text": "$MSFT $NVDA .95 1yr correlation #knowwhatuown", "time": 1648800686.0, "sentiment": ""}, {"id": 449015297, "text": "$DWAC show something positive so $TWTR  $FB $GOOGL $MSFT  can  buy you you. 2.6B market cap....those some rookie numbers", "time": 1648799610.0, "sentiment": ""}, {"id": 449014459, "text": "$SPY A rise in Futures isn&#39;t Bullish on a day when the Market closes at the lows &amp; into a Data Friday. The Pro Traders are screwing w/ you.  \n \nWhat Bulls want is a deep Red overnight, when the Market closes at the LOD it means there are Sellers who still want to get out so the have MOO orders set to Sell, + you have the EU which also has to catch up to the US so it means they can all Sell into any Open Pop. \n \nIts just the little game WS plays \n \n$aapl $amzn $msft $tsla", "time": 1648799305.0, "sentiment": ""}, {"id": 449011862, "text": "$SPY 🤕🤕 $NVDA $AAPL $MSFT $AMZN", "time": 1648798377.0, "sentiment": "Bearish"}, {"id": 449011084, "text": "FedEx recently appointed Raj Subramaniam as its new CEO. Here&#39;s a look at Indian origin CEOs of different MNCs. \n \n$FDX $MSFT $TWTR $IBM $GOOGL", "time": 1648798114.0, "sentiment": ""}, {"id": 449007956, "text": " $ATVI $MSFT $SPY  \n \n \nAlexander von Furstenberg previously disclosed his meeting with Kotick to law enforcement who questioned him about the trade. \n \nKotick&#39;s representatives released a statement to CNBC on the meeting. \n \n&quot;Mr. Kotick had a social brunch with his friends at a popular restaurant,&quot; according to the statement. &quot;He of course didn&#39;t share any information with them regarding a possible transaction with Microsoft.&quot; \n \nIt was previously reported that J.P. Morgan reported the trades to regulators and prosecutors after the deal was publicly announced. \n \nhttps://seekingalpha.com/news/3819502-prosecutors-looking-into-meeting-between-activision-ceo-and-options-traders-report", "time": 1648797022.0, "sentiment": ""}, {"id": 449007915, "text": " $ATVI $MSFT $SPY  \n \n \nIf the deal closes, they would be worth more, as Activision (ATVI) is currently trading at a significant discount to the proposed purchase price. \n \nDiller, who previously said the trade was &quot;simply a lucky bet&quot; and that the men &quot;acted on no information of any kind from anyone,&quot; continued to defend himself. On Thursday, in an email to The Journal, Diller said the men had no knowledge of the deal and if they did, would not have proceeded. \n \n&quot;We had zero knowledge of that transaction and it belies credulity to think that if we did we would have proceeded,&quot; Mr. Diller wrote. &quot;It’s equally unlikely to believe Mr. Kotick, a sophisticated professional, in a social breakfast with Mr. von Furstenberg and his wife would have told them of the pending transaction.&quot;", "time": 1648797009.0, "sentiment": ""}, {"id": 449007830, "text": " Members of the Department of Justice are looking into a meeting between Activision Blizzard ($ATVI) Chief Executive Bobby Kotick and one of the three options traders before Microsoft ($MSFT) announced it was buying the video game maker for approximately $69 billion. \n \nThe meeting, first reported by The Wall Street Journal, took place the week before January 14 and was included Kotick and Alexander von Furstenberg, the stepson of media mogul Barry Diller and the son of his wife, fashion designer Diane von Furstenberg. \n \nThe three men bought call options on Activision (ATVI) for $40, when shares were trading at roughly $63, meaning the options were in the money. \n \nJust days later, Microsoft (MSFT) agreed to buy Activision (ATVI) for $95 per share in cash, paying almost $69 billion. \n \n \nIt was previously reported that the three men spent approximately $108 million on the options, and have an unrealized profit of roughly $60 million. \n \n$SPY", "time": 1648796983.0, "sentiment": ""}, {"id": 449005500, "text": "$SPY I&#39;m going to make a huge call here. I predict a market severe market correction, if these three Black Swans take place this month. Swan number1. CPI read 10% or higher year over year on the next read APRIL 12. Swan number2. Big tech like $appl, $amzn, $msft, $GOOG all miss earning. Swan number 3. The 2-year inverts with the 10-year. If these three Black Swans happen, then a severe correction starts.", "time": 1648796226.0, "sentiment": ""}, {"id": 449000973, "text": "$MSFT $VENAR I can only say that I am used to the floating market", "time": 1648794749.0, "sentiment": ""}, {"id": 449000347, "text": "$DDOG $MSFT Datadog (DDOG) partners with Microsoft (MSFT) to add its monitoring and security capabilities within the Azure Cloud Adoption Framework", "time": 1648794544.0, "sentiment": ""}, {"id": 448999057, "text": "$MSFT   yall know why  $188", "time": 1648794093.0, "sentiment": "Bearish"}]