[{"id": 450159112, "text": "$SST works with $googl $msft $fb", "time": 1649231524.0, "sentiment": "Bullish"}, {"id": 450158737, "text": "$SST already work with $msft and $goog if you read their 10k", "time": 1649231331.0, "sentiment": "Bullish"}, {"id": 450155595, "text": " $MSFT $ATVI $SONY  \n \nFTC Chair Lina Khan, though - now likely with enough support from aligned commissioners - will examine the deal with an eye to the combined companies&#39; access to consumer data, the game developer labor market and the deal&#39;s impact on those workers who have accused Activision of discrimination and a hostile workplace, according to The Information. And the FTC is also looking into potential impact on a competitive metaverse. \n \nThe probe is still in early stages and expectations are that barring an FTC suit, Microsoft can close the deal soonest sometime in 2023. \n \nProsecutors are examining a meeting that took place between Activision Blizzard chief Bobby Kotick and options traders before the deal was announced. And a group of senators is urging the FTC forward toward a hard review of the transaction, with an emphasis on the labor market implications. \n \nhttps://seekingalpha.com/news/3820840-ftcs-microsoftactivision-probe-to-examine-consumer-data-labor-market-impact-report", "time": 1649229925.0, "sentiment": ""}, {"id": 450155541, "text": " The federal investigation into Microsoft&#39;s ($MSFT -0.9%) planned $69 billion acquisition of Activision Blizzard ($ATVI -0.2%) isn&#39;t limiting itself to which rival consoles will have access to top games, The Information reports - but will also extend to the deal&#39;s effects on consumer data and the market for game developers. \n \nThe bulk of attention so far has been on whether Microsoft will restrict competitors like Sony ($SONY -3.3%) from offering Activision titles as part of subscription services, which have been growing in importance for the top videogame players. Microsoft has committed to allowing games for the PlayStation (with a focus on annual best-selling franchise Call of Duty). \n \nIncluding its games in other subscription services like Sony&#39;s PlayStation Plus is another question, for the deal and for the Federal Trade Commission, according to the report.", "time": 1649229909.0, "sentiment": ""}, {"id": 450154991, "text": "$MSFT this seems like a high price.  PE ratio has to be high.  Do you want to pawn it or sell it?", "time": 1649229689.0, "sentiment": "Bearish"}, {"id": 450152707, "text": "$MSFT https://stocknews.com/news/msft-avgo-orcl-acn-intc-5-best-mega-cap-stocks-in-the-tech-sector-to-buy/", "time": 1649228690.0, "sentiment": ""}, {"id": 450151449, "text": "$MSFT Microsoft Option Order Flow Sentiment is 56.6% Bearish. https://tinyurl.com/y3z7lujn", "time": 1649228190.0, "sentiment": ""}, {"id": 450147530, "text": "$DIS $NFLX $GOOG $MSFT MOASS Soon!", "time": 1649226623.0, "sentiment": "Bullish"}, {"id": 450147383, "text": "$MSFT $VENAR How to operate this", "time": 1649226556.0, "sentiment": ""}, {"id": 450143506, "text": "$SPY $MSFT get it MSFT 🖖🏽", "time": 1649225019.0, "sentiment": ""}, {"id": 450143170, "text": "&gt;https://youtube.com/watch?v=rCwXwUlDS70&amp;feature=share\n\nICYMI ~ STACY Rasgon on $AMD ↗️ deal\n\n$AAPL $INTC $ETH.x $MSFT", "time": 1649224894.0, "sentiment": ""}, {"id": 450141005, "text": "$AMZN $GOOG $AAPL $NVDA $MSFT  \n&quot;CMBS crashed to a new multi-year low. \n \nAll time low is 49.03 (spiked to 48.97). At this rate, we&#39;ll hit that this week easy. The Corporate Mortgage Backed Security market is as dead as a doornail&quot; \n \nThe recession is here &amp; of course this will take time to enter into the equity markets.  \n \nDon&#39;t fight the Fed cause they have &quot;unlimited powers&quot;  \nhttps://www.businesstimes.com.sg/real-estate/covid-hit-property-loans-redefaulting-moodys-study-0", "time": 1649224067.0, "sentiment": ""}, {"id": 450136362, "text": "$SQ and $MSFT from yesterday are still valid setups\n\nThis post is originated from our Discord\nPosted By @macrozz", "time": 1649222497.0, "sentiment": ""}, {"id": 450135123, "text": "@BetHedge the Fed can&#39;t afford for that much equity loss either as it will create another recession. People spend based on their worth. If their net worth drops 50% they ain&#39;t going on the same vacation etc.  \n\nMore than likely Fed will tighten until inflation is under control and you&#39;re right equity will be challenged in this environment but more likely flat to up high single digits than down 50%. $MSFT $AAPL near all time highs with reasonable valuations. $TSLA is another story.", "time": 1649222158.0, "sentiment": ""}, {"id": 450134377, "text": "$SPY the Fed is letting you know they are unwinding. So when you see all these high flyers that were pumped up past years and you didn&#39;t take profits. Don&#39;t cry when $AAPL $TSLA $MSFT gets cut in half by end of year. Probably more when people get crazy like other bubbles and remember how high these stocks were. Trillions pumped in markets, many companies with trillion dollar MC. Now Trillions will be pulled. Maybe.", "time": 1649221923.0, "sentiment": ""}, {"id": 450134103, "text": "$MSFT Option to look at... 👀 👀  $285.00 Put for Friday, April 8, 2022. Roughly 490 Thousand dollars! 💰💰 Learn more on StockOrbit! Link on profile!!", "time": 1649221840.0, "sentiment": ""}, {"id": 450127351, "text": "Weakness in the Semiconductor Group and the US Stocks Watchlist – 5 April 2022 \n \nThere were 23 stocks for the US stocks watchlist today. \n$PANW, $LHX, $LNTH, $MSFT + 19 more... \n \n#stocks #trading #investing #money  \nhttps://www.stageanalysis.net/blog/163919/weakness-in-the-semiconductor-group-and-the-us-stocks-watchlist-5-april-2022", "time": 1649219788.0, "sentiment": ""}, {"id": 450126714, "text": "$AMD $MSFT $TSLA $NVDA Unfortunately, we maybe living the re-run of the fallen British empire in this great land. Our incompetent president appears to be more concerned with dealing with Putin vs the current economy. His entire time appears to be devoted to winning a personal fight against Putin than working for those who voted for him. I think he has a deep-rooted issue against Putin that he needs to resolve, and it doesn&#39;t matter if it comes at the expense of  inflation or, the complete collapse of the economy.  I would like to get on the record and apologize for voting for him. I truly feel disgusted, and betrayed. I honestly didn&#39;t think it would get any worse than Trump. Now, I have to admit that I was wrong. Unfortunately, I&#39;m now dealing with buyer&#39;s remorse. God, as someone who messed up, I ask for your forgivness.  \n \nLet&#39;s go Brandon.", "time": 1649219580.0, "sentiment": "Bullish"}, {"id": 450120513, "text": "$AAPL $MSFT $GOOG $QQQ load up Jesus told me!!", "time": 1649217638.0, "sentiment": "Bullish"}, {"id": 450116978, "text": "$AAPL $MSFT $AMZN $GOOG Days like today are reasons why you need to sell covered called against your equity. Especially in these times!", "time": 1649216576.0, "sentiment": "Bearish"}, {"id": 450111657, "text": "Our Unusual Options Platform Alerted: $MSFT with our scanner on $300 PUT Expiring: 05-20-2022 worth 111K🐻   Get Ahead Of The Move with SweepCast &amp; Learn more about it on our profile today!🏆", "time": 1649214995.0, "sentiment": ""}, {"id": 450105151, "text": "$MSFT  Look! I got this 83% Profitability across 8 trades in 1 month. Profit Factor of 53 and rating is Bullish.", "time": 1649213287.0, "sentiment": ""}, {"id": 450103979, "text": "$SNDL I will hold. $AMC $TWTR $AAPL why would you fold. $MSFT", "time": 1649212977.0, "sentiment": "Bullish"}, {"id": 450100901, "text": "$SPY $TSLA $MSFT wen lentil", "time": 1649212212.0, "sentiment": ""}, {"id": 450094304, "text": "$aapl $msft $amzn https://youtu.be/vHtlCos7-Ag", "time": 1649210730.0, "sentiment": ""}, {"id": 450088179, "text": "$MSFT See&#39;s 313&#39;s right out of the Gate tomorrow morning! Load Up!", "time": 1649209531.0, "sentiment": "Bullish"}, {"id": 450083697, "text": "$SPY $AAPL $TSLA $MSFT $AMZN \nFutures Climbing Up", "time": 1649208690.0, "sentiment": "Bullish"}, {"id": 450082312, "text": "$MSFT Feeling bullish on the short/mid term.  However 2023 is looking a bit murky. Let&#39;s trade carefully. https://youtu.be/mYc65HsDqWY", "time": 1649208450.0, "sentiment": "Bullish"}, {"id": 450076361, "text": "$AMD $MSFT $AMAT $JPM what a bloodbath! And we have this incompetent president whose only interest is, settleing a personal beef that he has with Putin vs, fixing the economy. For the first time in my life, I will be voting for the mid-term elections.  \n \nLet&#39;s go Brandon!", "time": 1649207489.0, "sentiment": "Bullish"}, {"id": 450076046, "text": "$MSFT $SPY $AAPL lol give all yesterday gains right back", "time": 1649207442.0, "sentiment": ""}]