[{"id": 452479086, "text": "Happy long weekend! \n \n$MSFT #MSFT is trending, wanted to share these insights 🔥👇 \n \nStocktwits Impressions: 487.02k \nTwitter Impressions: 3.87M \n \nA lot of people are seeing tweets and posts about MSFT \n \nYou can track this in real-time, and more --&gt; LINK IN BIO", "time": 1650002428.0, "sentiment": "Bullish"}, {"id": 452478012, "text": "$MSFT \nHoly sheet 😳", "time": 1650001903.0, "sentiment": ""}, {"id": 452476423, "text": "$AAPL $MSFT $AMZN $TSM\nTypical selling before long weekend. All charts indicators are pointing to market bottom and for up move that will start very soon. \nAlso the lows today were only slightly lower than two days ago.\nNot to mention the volume in the last 2 weeks of selling was lower than the previous 3 weeks when buying occurred.", "time": 1650001152.0, "sentiment": ""}, {"id": 452474629, "text": "Thursday Option Volumes\n\n$AMD 580k (61% call/39% put)\n$XLF 529k (51% call/49% put)\n$BAC 427k (62% call/38% put)\n$MSFT 309k (56% call/44% put)\n\nhttps://bit.ly/sweepcastoptions", "time": 1650000335.0, "sentiment": ""}, {"id": 452471169, "text": "$MSFT Option to look at... 👀 👀  $265.00 Put for Friday, May 20, 2022. Roughly 356 Thousand dollars! 💰💰 Learn more on StockOrbit! Link on profile!!", "time": 1649998816.0, "sentiment": ""}, {"id": 452470620, "text": "$TSLA dead $NVDA dead $MSFT dead $AMD dead all your dreams of retiring dead", "time": 1649998588.0, "sentiment": ""}, {"id": 452470324, "text": "$MSFT guvment, fed, insiders  selling..", "time": 1649998456.0, "sentiment": ""}, {"id": 452469079, "text": "gather round and watch me lose all my mula on $aapl puts (eventually)     https://youtu.be/M8N5nvwDcrc    \n$qqq $msft $googl $iwf", "time": 1649997934.0, "sentiment": ""}, {"id": 452468166, "text": "Sweep Options Activity: $MSFT is the #14 ticker with sweep activity where institutions are trading options urgently with 7.7K sweep contracts, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (link in profile)", "time": 1649997554.0, "sentiment": ""}, {"id": 452467592, "text": "$AABB $SPY $TSLA $AAPL $MSFT", "time": 1649997311.0, "sentiment": ""}, {"id": 452466661, "text": "$SOFI $GOOGL $NVDA $MSFT \n\nThis is kind of when you just buy and don’t at your portfolio for a little while", "time": 1649996935.0, "sentiment": ""}, {"id": 452465545, "text": "$MSFT 60 fall here from highs gonna be a bit soon", "time": 1649996476.0, "sentiment": ""}, {"id": 452463332, "text": "  $ATVI $MSFT   \n \n \n&quot;The Office of the Governor repeatedly demanded advance notice of litigation strategy and of next steps in the litigation,” Proctor wrote in the email, according to Bloomberg. “As we continued to win in state court, this interference increased, mimicking the interests of Activision’s counsel.” \n \nThe turbulence threatens the fate of the state&#39;s currently pending suit, filed last July and alleging violations of equal pay and fair employment laws amid a &quot;sexist&quot; culture ensuring women were paid less than men and faced constant sexual harassment. \n \nhttps://seekingalpha.com/news/3823494-california-state-lawyer-suing-activision-is-fired-spurring-controversy", "time": 1649995590.0, "sentiment": ""}, {"id": 452463304, "text": " $ATVI $MSFT   \n \n \n \nThe legal drama at Activision Blizzard (ATVI -0.1%) has taken a new turn and now includes claims that California Gov. Gavin #Newsom interfered in the state&#39;s suit against the company. \n \nA top civil rights attorney for the state, Janette Wipper, was fired on March 29 as she pursued the case as chief counsel for the Department of Fair Employment and Housing. Her lawyer says Wipper is considering filing a claim under state whistleblower protection law. \n \nMeanwhile, an assistant chief counsel also involved in Activision&#39;s case, Melanie Proctor, resigned Wednesday in protest. An email from Proctor accused Newsom and his staff of interfering in the suit (Newsom&#39;s spokesperson says such claims are &quot;categorically false&quot;).", "time": 1649995579.0, "sentiment": ""}, {"id": 452459376, "text": "$AABB REMEMBER the company already retired 120M shares for FREE and by the looks of their PR when they previously retired 120M shares exclaiming &#39;&#39;The company plans on retiring more shares in the near future for SHAREHOLDER INIATIVE&#39;&#39; hmmm the 2021 Financials COINCIDENTALLY have 1.49 billion shares additional paid in capital. The company can RETIRE or BUY BACK up to 1.49B shares 85% of the float in 1 day!! With the estimation 3-4 Billion Uncovered &#39;&#39;naked short&#39;&#39; shares with&gt; 5 GOLD MINES&gt; AABBG.X Global Cryptocurrency Exchange 365 24/7 REVENUES&gt;Future NFT&#39;s &amp; Geothermal Volcanic mining in El Salvador. 2021 EPS +300% Do some DD their is ALWAYS the next COIN PYPL GOLD MARA and this one looks to have all those in their pipeline. Happy Holidays GLTA $SPY $TSLA $AAPL $MSFT https://www.otcmarkets.com/otcapi/company/financial-report/324399/content", "time": 1649994069.0, "sentiment": "Bullish"}, {"id": 452458840, "text": " $ATVI $MSFT  \n \n \nElsewhere, California Gov. Gavin Newsom has denied that he directly interfered with his state&#39;s lawsuit against Activision Blizzard. One state lawyer on the case was fired and another resigned, protesting that the governor was interfering with the case. \n \nBut such reports are &quot;categorically false,&quot; says Newsom Communications Director Erin Mellon.", "time": 1649993883.0, "sentiment": ""}, {"id": 452458779, "text": " One activist shareholder group is urging fellow Activision Blizzard ($ATVI) shareholders to vote against a $69 billion acquisition by Microsoft ($MSFT) at the upcoming stockholder meeting April 28. \nSOC Investment Group has a small percentage of Activision Blizzard (ATVI) stock. And rather than merging with Microsoft, it would rather see &quot;a new, competent and dedicated&quot; board elected. \n \nMicrosoft&#39;s deal fails to value Activision and its future earnings potential, SOC says, as it ignores the headwinds from the company&#39;s sexual-harassment crisis. And “We are skeptical that any transaction with Microsoft (or a similar acquirer) would be viable, given the shift in the climate of anti-trust enforcement, as well as evident sources of potential harms to competition stemming from the merger.&quot; \n \n \nhttps://seekingalpha.com/news/3823597-activist-urges-activision-blizzard-holders-to-reject-microsofts-purchase-offer", "time": 1649993854.0, "sentiment": ""}, {"id": 452458773, "text": "$BTC.X 5x your money with my call outs 🙏😇👍💯 $MSFT $TSLA $SHIB.X $AMD https://youtu.be/RH4u-zcH-QU", "time": 1649993851.0, "sentiment": "Bullish"}, {"id": 452458530, "text": "$MSFT Do we see 260 next week?", "time": 1649993758.0, "sentiment": ""}, {"id": 452458014, "text": "$MSFT love it!!  the software monopolizer on sale -- Thanks....", "time": 1649993576.0, "sentiment": "Bullish"}, {"id": 452457938, "text": "$MSFT As long as the 1/25 low remains intact, the instrument remains in the sideways zone.  We don’t like to trade the sideways area, only like to trade the extreme areas in 3, 7 or 11 swing.   It is favouring more downside is taking place in the next cycle lower.  #Elliottwave #Trading #Stocks", "time": 1649993550.0, "sentiment": ""}, {"id": 452455115, "text": "$MSFT so evry fund has a piece of this company - let them sell - they have to buy back higher", "time": 1649992583.0, "sentiment": "Bullish"}, {"id": 452454180, "text": "$MSFT broke 280 support which will now be resistance", "time": 1649992257.0, "sentiment": ""}, {"id": 452454079, "text": "$MSFT $SPY 👀😬", "time": 1649992220.0, "sentiment": ""}, {"id": 452453166, "text": "$MSFT what did I say...... over and over.... Its all just pump/dump/pump/dump/pump/dump, \nShorts manipulation and corruption all over stocks\n\nhttps://markets.businessinsider.com/news/stocks/stock-market-short-sellers-doj-investigation-mafia-law-rico-racketeering-2022-2\n\nhttps://tremendous.blog/2022/02/09/melvin-capital-under-federal-investigation/ \n\nhttps://news.bloomberglaw.com/securities-law/vast-doj-probe-looks-at-almost-30-short-selling-firms-and-allies", "time": 1649991929.0, "sentiment": ""}, {"id": 452451616, "text": "$SPY $TSLA $MSFT $TWTR A side project I&#39;ve been working on.  Almost feels like real investing. https://editor.p5js.org/kansascash/full/ACBJinGef", "time": 1649991424.0, "sentiment": ""}, {"id": 452451403, "text": "$MSFT Surprised I got a chance to short this pig at 288 yesterday, much thanks to bag holding longs", "time": 1649991358.0, "sentiment": "Bearish"}, {"id": 452448625, "text": "@PB316 PB, I am down over 80k this year. My long positions are $NVDA $MSFT $AMD $TTD. We will bounce over the summer. Biden&#39;s damage is about to peak lol :)", "time": 1649990491.0, "sentiment": "Bullish"}, {"id": 452448139, "text": "$MSFT P/E 29 way better now! Still needs to come down to 20 area", "time": 1649990352.0, "sentiment": ""}, {"id": 452444264, "text": "$MSFT damnn this was $300 last year \nWth is happening to tech", "time": 1649989252.0, "sentiment": ""}]