[{"id": 453948696, "text": "$MSFT $GOOGL If earnings and forecasts are good, that will help mitigate the negative slide, however it may only be temporary 1-2 days before rolling down the hill again; this time with no saving life line unless special news comes out (like Google’s split, but they shot their load, so we’ll see what Microsoft has to say. They are overdue for a split as well, but if does I hope its much later - Q42022/Q12023).", "time": 1650601391.0, "sentiment": ""}, {"id": 453948601, "text": "$MSFT As long as the 1/25 low remains intact, the instrument remains in the sideways zone.  We don’t like to trade the sideways area, only like to trade the extreme areas in 3, 7 or 11 swing.   It is favouring more downside is taking place in the next cycle lower.  #Elliottwave #Trading #Stocks", "time": 1650601360.0, "sentiment": ""}, {"id": 453948381, "text": "$MSFT got puts this morning . I’m looking for $275", "time": 1650601289.0, "sentiment": "Bearish"}, {"id": 453946057, "text": "Does this make you nervous? $MSFT in Downtrend: Stochastic indicator sits in oversold zone for 7 days. View odds for this and other indicators: https://srnk.us/go/3599987", "time": 1650600529.0, "sentiment": ""}, {"id": 453945495, "text": "@DocReinhart @Cheddar33 \n\nCheck out those on $MSFT, the interaction the candles have with the MA’s.. the reason the MACD shows possible curls are due to gapping up, it manipulates the math &amp; has fooled me when I first started trading, but I think paying attention to the fact that it gapped up &amp; dell is even more important. BUT that being said, that price action was during Q4 ER season… uhhh so like yeaaahh", "time": 1650600345.0, "sentiment": ""}, {"id": 453944314, "text": "$MSFT Let it hit 275 or lower 👍", "time": 1650599998.0, "sentiment": ""}, {"id": 453943912, "text": "$NVDA $AAPL $MSFT $SHOP how many times are they going to recycle the interest rates hike? Everyone Fng knows it’s going to happen, we all get it. My 16 month old knows it’s going to happen and the market acts like they are being blindsided by the news.", "time": 1650599867.0, "sentiment": "Bullish"}, {"id": 453941109, "text": "$MSFT Inverse H&amp;S on the hourly. On top of that we&#39;re in the demand zone. Time to go fill the gap to the upside? Let&#39;s go!", "time": 1650599020.0, "sentiment": "Bullish"}, {"id": 453941083, "text": "$TMBR $MSFT $TSLA $GOOGL $AMD", "time": 1650599015.0, "sentiment": "Bullish"}, {"id": 453940034, "text": "$AAPL $MSFT $AMZN $GOOGL the American consumer is still strong. Mega cap tech earnings next week will pump the market and instill confidence. Hold bitches and buy the dip", "time": 1650598688.0, "sentiment": "Bullish"}, {"id": 453939142, "text": "$MSFT  Look! I got this 83% Profitability across 6 trades in 1 month. Profit Factor of 16 and rating is Bearish.  I will wait for Buy signal 🛋", "time": 1650598438.0, "sentiment": ""}, {"id": 453937649, "text": "$MSFT if it loses 270 I’ll probably sell", "time": 1650598005.0, "sentiment": ""}, {"id": 453937340, "text": "$AMD This is not a &quot;told you so&quot; post but maybe something to help some people raise money in other sectors. We started buying $NCLH on March 4th, 7th and 8th. The rotation out of tech started well before that, leading to targeting sectors that were defensive or just had not come back from pre-pandemic levels. Airlines and cruise lines have a long way to go on the upside but I believe have limited downside at these levels. I&#39;m still waiting to get back into $AMD, $MU, $MSFT etc...But purchases of $NCLH and $UAL have proven there are other sectors to ease the drops...", "time": 1650597917.0, "sentiment": "Bullish"}, {"id": 453935656, "text": "$MSFT on radar for tomorrow, currently trading at near lows for this week&#39;s candle and has potential to go lower just off this information", "time": 1650597415.0, "sentiment": "Bearish"}, {"id": 453934657, "text": "$MSFT lets see how tommorow plays out with all this tech earnings can Tesla CHARTz", "time": 1650597131.0, "sentiment": ""}, {"id": 453934416, "text": "$MSFT this held", "time": 1650597061.0, "sentiment": ""}, {"id": 453932013, "text": "$SPY $AAPL $MSFT $NVDA $TSLa", "time": 1650596410.0, "sentiment": "Bearish"}, {"id": 453931283, "text": "$FB Question who will dominate the metaverse: Meta or $MSFT ..?", "time": 1650596226.0, "sentiment": ""}, {"id": 453930387, "text": "$AAPL $MSFT $GOOG load up buddddddd", "time": 1650595977.0, "sentiment": "Bullish"}, {"id": 453929052, "text": "$MSFT 8$ swing today Green to red WTF", "time": 1650595641.0, "sentiment": ""}, {"id": 453928036, "text": "$MSFT https://www.benzinga.com/news/22/04/26747423/kraft-heinz-partners-with-microsoft-for-supply-chain-digitization#/.YmGwSzG-okI.twitter", "time": 1650595374.0, "sentiment": ""}, {"id": 453926559, "text": "$SPY Man rough day. Started out red, came back to green with 2 good trades on $AAPL and $MSFT short. Made a grand total of $20 today. 😂  \n \nSometimes if you really do the math in to the amount of hours you put into trading a day, you realize you’d be better off with a day job.  \n \nHey green is green! Hope everyone else had a great day.", "time": 1650595006.0, "sentiment": "Bearish"}, {"id": 453924763, "text": "$AMZN $GOOG $MSFT $NVDA $AAPL  \n&quot;Rates rise until something breaks … is anything broken yet?&quot;", "time": 1650594567.0, "sentiment": ""}, {"id": 453924160, "text": "$MSFT Got in at 285. Bought 260/310/360 call butterfly Apr29 for 24.90. We could get to 300+ on earnings.", "time": 1650594420.0, "sentiment": "Bullish"}, {"id": 453923021, "text": "$AAPL $AMZN $MSFT $GOOG ST exclusive - May&#39;s rate hike is probably the last otherwise someone will bust a cap in Powell&#39;s a$$ guaranteeeeeed", "time": 1650594168.0, "sentiment": "Bullish"}, {"id": 453921212, "text": "$MSFT $AAPL   maybe they lower forecasts next week so they can buy back shares cheaper, blame it on external forces that are not their fault, and make it easy to exceed expectations next quarter.", "time": 1650593777.0, "sentiment": ""}, {"id": 453920490, "text": "$MSFT I don&#39;t why people say Fed is manipulating the market. The fed is simply doing it&#39;s job and tame the inflation even if it means rate have to go to 10%+ or unseen level. The manipulation is the like of Goldman JPM blackrock and hedge funds.. they&#39;re doing and will shorting the market for the next 2-3 years to come. They&#39;ve have pulled enough money and bought enough houses. We will stopp making babies soon and watch the housing crumble. Crazy that you got to be millionaire to afford a descent single family home $AMD $FB . Stock will make 2 years low this year I suspect", "time": 1650593625.0, "sentiment": ""}, {"id": 453920432, "text": "$MSFT negative imbalance of -301 K option volume delta...indicating traderes are more bearish on the stock https://tinyurl.com/y3z7lujn", "time": 1650593615.0, "sentiment": ""}, {"id": 453917738, "text": "$AAPL $MSFT $GOOGL Come down a little more.", "time": 1650593057.0, "sentiment": "Bullish"}, {"id": 453916070, "text": "$MSFT They tell me to fear god, but that is why I fear nothing but me.", "time": 1650592731.0, "sentiment": ""}]