[{"id": 454263127, "text": "$MSFT ", "time": 1650702556.0, "sentiment": ""}, {"id": 454262358, "text": "$MSFT I’m just glad Microsoft is before meta earnings", "time": 1650701960.0, "sentiment": ""}, {"id": 454261623, "text": "$SPY if my only video game was a modern need for speed, I&#39;d cry. \n\nThese kids will never know a good need for speed game. \n\nThese kids will probably not know a good call of duty ever again. Unless they remaster black ops 1 or mw2 Multiplayer. \n\nHonestly, I think $atvi would never make a mw2 remaster or bo1 remaster because that remaster would out sell the actual cod game for that year and just put them to shame. \n\nIf they do a remaster it would definitely be after the $sne agreement ends and it&#39;s a Xbox exclusive. \n\n$ea better step their game up. $msft about to run this .\n\nI&#39;m still not buying an Xbox.", "time": 1650701342.0, "sentiment": ""}, {"id": 454261579, "text": "$MSFT puts or calls for earnings? MSFT is tricky cuz even if it beats it can fall lol -__-", "time": 1650701309.0, "sentiment": ""}, {"id": 454260315, "text": "$SPY MAG was another shooter that was great but as a console exclusive to PS3, it didn&#39;t get enough attention. Plus it was in an era with mw2 bo1, bfbc2. It didn&#39;t have a chance. \n\n$sne $atvi $ea $msft", "time": 1650700337.0, "sentiment": ""}, {"id": 454260110, "text": "$SPY the greatest shooter of all time is tough to decide. \n\nThough I believe bo1 is the best call of duty, I believe mw2 is the goat because of how it bought a new generation of development to shooters. \n\nThe jump between cod4, bfbc1, WaW, and then into mw2 is bigger than the generational jump between PS2 and PS3. \n\nI feel like the GOAT of shooters only has 2 choices: Mw2, or Bf3. I feel like Bf3 PC version is untouchable but nobody played that. Most Bf3 was on console and that version was limited on the console due to generational limitations. Perhaps the developers could&#39;ve maxed out the PS3 with Bf3 but the xbox360 couldn&#39;t keep up. \n\nSo consoles got stuck with crap. \n\nSo by default, the Goat shooter is mw2. \n\n$sne $ea $ATVI $msft", "time": 1650700192.0, "sentiment": ""}, {"id": 454259803, "text": "$SPY well, atleast Britney Spears is having a baby $MSFT $BTC.X $TSLA", "time": 1650699966.0, "sentiment": ""}, {"id": 454259721, "text": "$SPY $TSLA $AAPL $FB $MSFT \n\nMy thoughts on stocks next week  ...  \n\nYou want to know why people subscribe to my service?\n\nPreperation. I called 451/452 on the SPY as a top and 426/427 as a bottom for this week. We hit both those levels.  Remember, technicals first. Then fundamentals. In that order. \n\nI told members at the beginning of the week in my Game Plan that Thursday would be the MOST important day of the week (SEE ATTACHED BELOW). For two reasons - 1) although I expected a solid qtr out of TSLA, we get to see how Wall Street treats the shares. I told members that if the stock gives up its gains, the mkt is in trouble. 2) Powell speaks and he will undoubtedly talk the mkt lower. \n\nThursday indeed turned out to be the most important day for the very two reasons I gave. \n\nPoint is, I prepare members for the week. That is the whole point of my Game Plans and daily commentary. \n\nTo join, reach out at jessielivermore1929@gmail.com", "time": 1650699915.0, "sentiment": ""}, {"id": 454259355, "text": "$SPY I don&#39;t think anyone can argue that MW2, BO1, Homefront, Bf3, Bfbc2, were the gold standard of cross-platform shooters. \n\nSince 2011, there has not been any shooter that legitimately compares to or holds a candle to those 5. \n\n$SNE $EA  $msft $ATVI", "time": 1650699651.0, "sentiment": ""}, {"id": 454257560, "text": "$SPY $AAPL $MSFT Treated us well today with those PUTS ❤️☺️", "time": 1650698431.0, "sentiment": ""}, {"id": 454256770, "text": "Dramatic Selling Creates These Opportunities $MSFT $NVDA $FB $SPX $GOOGL https://talkmarkets.com/content/stocks--equities/dramatic-selling-creates-these-opportunities?post=352437", "time": 1650697888.0, "sentiment": ""}, {"id": 454252864, "text": "$MSFT B careful that is all! Have a great weekend I sold off my shares yesterday will get back in after 2nd rate hike", "time": 1650695416.0, "sentiment": ""}, {"id": 454252444, "text": "$MSFT Option to look at today.. 👀 👀  $260 Put for Friday, June 17, 2022. Roughly 2 Million dollars! 💰💰💰💰 Learn more on StockOrbit! Link on profile!!", "time": 1650695158.0, "sentiment": ""}, {"id": 454247094, "text": "$SOFI $GOOG $AMZN $MSFT Nibbling", "time": 1650692073.0, "sentiment": ""}, {"id": 454246868, "text": "$AAPL $MSFT $SPY $QQQ Dow +700, Nasdaq +300 on Monday! A simple game of cat and mouse!", "time": 1650691948.0, "sentiment": ""}, {"id": 454246024, "text": "$MSFT https://www.marketwatch.com/story/microsoft-corp-stock-outperforms-market-despite-losses-on-the-day-01650659510-bbc970f19f1d", "time": 1650691506.0, "sentiment": "Bullish"}, {"id": 454244816, "text": "$EA is currently scheduled to report quarterly results on May 10, while Take-Two ($TTWO) is slated to give its next quarterly report on May 16. \n \nIn addition to Take-Two (TTWO) buying Zynga, the videogame market was shaken up earlier this year with Microsoft ($MSFT) saying it would acquire Activision Blizzard ($ATVI) for nearly $70 billion. On Thursday, Activision (ATVI) named two new female members to its company board of directors. \n \nhttps://seekingalpha.com/news/3825782-ea-take-two-are-the-adults-in-the-video-game-room-bernstein", "time": 1650690909.0, "sentiment": ""}, {"id": 454244413, "text": "$GOOGL $FB $AAPL $MSFT dang, mean ass post. 💯", "time": 1650690715.0, "sentiment": ""}, {"id": 454244226, "text": "$MSFT $CZR \nhttps://markets.businessinsider.com/news/stocks/stock-market-outlook-buy-stocks-inflation-peaks-leuthold-james-paulsen-2022-4", "time": 1650690629.0, "sentiment": "Bullish"}, {"id": 454243805, "text": " Microsoft&#39;s ($MSFT) deal with the U.S. Army for combat googles that was initially believed to be worth as much as $22 billion could be just half of that figure, Bloomberg reported. \n \nIn a press conference, the Army, discussing a report from the Pentagon&#39;s inspector general, said the $21.9 billion Integrated Visual Augmentation System contract was an estimate that was a worst-case scenario and the most the service could cost. \n \n \nIn June 2021, Microsoft (MSFT) said it signed a deal with the Army, which it said at the time could be worth $21.88 billion, to provide HoloLens technology for 120,000 headsets. \n \nAt the time, the agreement was for five years, but it could be extended for another five years \n \nIn October 2021, the Army confirmed that it was delaying the field testing of Microsoft&#39;s (MSFT) augmented-reality goggles until later in fiscal 2022. \n \n \n \nhttps://seekingalpha.com/news/3825884-microsoft-army-contract-for-combat-goggles-could-be-worth-half-of-22b-estimate-report", "time": 1650690418.0, "sentiment": ""}, {"id": 454242169, "text": "$AMZN $GOOG $AAPL $NVDA $MSFT idiot.  Another conspiracy theorist.  That crap isn’t welcomed here", "time": 1650689709.0, "sentiment": ""}, {"id": 454241550, "text": "$MSFT hope you all are loaded at these juicy price  for next week", "time": 1650689400.0, "sentiment": "Bullish"}, {"id": 454241151, "text": "$MSFT looking to enter at $264", "time": 1650689222.0, "sentiment": ""}, {"id": 454241044, "text": "$MSFT", "time": 1650689175.0, "sentiment": ""}, {"id": 454240418, "text": "$SPY $AAPL $MSFT $AMZN $NVDA \n👇 Bulls next week after Big tech Earning crashes.", "time": 1650688887.0, "sentiment": "Bearish"}, {"id": 454240233, "text": "Sweep Options Activity: $MSFT is the #14 ticker with sweep activity where institutions are trading options urgently with 8.1K sweep contracts, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (Link in profile - @InsiderFinance)", "time": 1650688796.0, "sentiment": ""}, {"id": 454240055, "text": "$SPY You know me not some stupid scam post with zero followers, I have been posting correct trade for years and was the first one to call the last crash on StockTwits. Last post for today. Don&#39;t freak out. Be in control of your emotions. To all my followers and future followers. I will start posting in my free room once 1000 members join in. We are at over 600. Here is the link. See you there. stocktwits.com/r/ZcashIsKing/  \n$APPL, $FB, $MSFT, and others on deck. We could have one more bounce coming up, don&#39;t miss it. If the market crash confirms, you will be given a strike and expiration just like what I did for those traders that are now millionaires with the $uvxy options that went from $0.20 to over $136 in three weeks.", "time": 1650688719.0, "sentiment": ""}, {"id": 454239046, "text": "Microsoft Analyst Warns ‘There’s Little Margin For Error’ https://www.billionaireclubcollc.com/microsoft-analyst-warns-theres-little-margin-for-error/  $MSFT", "time": 1650688273.0, "sentiment": ""}, {"id": 454238748, "text": "$MSFT shows a strong growth in EPS: 32.19%. https://www.chartmill.com/stock/analyzer/stock/MSFT?view=fundamental-analysis&amp;key=92318c9b-cb66-4932-8e30-5564fa1dd6a6&amp;utm_source=stocktwits&amp;utm_medium=FA&amp;utm_content=MSFT&amp;utm_campaign=social_tracking", "time": 1650688140.0, "sentiment": ""}, {"id": 454238577, "text": "$SPY Don&#39;t freak out. Be in control of your emotions. To all my followers and future followers. I will start posting in my free room once 1000 members join in. We are at over 600. Here is the link. See you there. https://stocktwits.com/r/ZcashIsKing $appl, $fb, $msft and others on deck. We could have one more bounce coming up don&#39;t miss it.", "time": 1650688064.0, "sentiment": ""}]