[{"id": 454351421, "text": "$MSFT $AAPL $SPY lets see what this week brings", "time": 1650797743.0, "sentiment": ""}, {"id": 454351308, "text": "$MSFT In a way, the Activision acquisiton was smart but also stupid....smart for their Xbox platform but idk if the Xbox platform in it&#39;s version is here to stay a lot longer with the wave of the Metaverse. On the other hand, $FB was approached to buy out $ATVI but rejected the offer. Instead, FB is paying much less money to buy individual companies already popular in the metaverse. There is no guarantee that games like Candy Crush, Call of Duty, etc are gonna be exciting games that fit the metaverse. That is one reason I like FB&#39;s strategy a lot more. They are buying the best company/studios in each sector ...Health/exercise...Music, Different categroies of games. and building it into their own Oculus/Meta ecosystem", "time": 1650797446.0, "sentiment": ""}, {"id": 454351265, "text": "$MSFT $TSLA $SPY $ARKK  💯", "time": 1650797336.0, "sentiment": ""}, {"id": 454351228, "text": "$TSLA $MSFT Bill is Elon’s worst nightmare in disguise. Could you imagine finding out that Mr. Gates has a half BILLION dollar short position in your company. WOW the one and only Bill Gates shorting Tesla. The saying goes like this King Elona. Laugh now and cry later. We all know Microsoft Bill is going to be getting the last laugh 😂 \n\nKeep on Trolling Mr. Microsoft while he has the largest short position in the history of the stock Market. Better yet why don’t you encourage him to double his short position. I love King Elona but Microsoft Bill has your number King", "time": 1650797273.0, "sentiment": "Bullish"}, {"id": 454351079, "text": "$GGR $MSFT", "time": 1650796928.0, "sentiment": ""}, {"id": 454350852, "text": "$MSFT this board makes me feel dumb for getting calls for this 🤦🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️🤦🏾‍♂️", "time": 1650796432.0, "sentiment": ""}, {"id": 454350741, "text": "$MSFT options prices for both calls and puts are much more expensive than Apple options. 🤔", "time": 1650796201.0, "sentiment": ""}, {"id": 454349651, "text": "$MSFT ruh ro", "time": 1650794363.0, "sentiment": ""}, {"id": 454349234, "text": "$SPY People bashing Gates and praising Musk are just as dull as those consuming every piece of shit Trump spews to his cult.  \nShorting Tesla is not unethical. People on this board buy calls and puts all the time for a living sometimes. If you see a company that you think is massively overvalued, then shorting is part of having a free market and letting the market mechanics works as they should. If Gates loses money, that&#39;s his responsbility. Pretty disgusting how every single thing Musk says, the Tesla cult goes up in arms with their digital pitchforks and torches to carry out his wishes without even thinking if what he said makes sense. $TSLA $ARKK $MSFT", "time": 1650793590.0, "sentiment": ""}, {"id": 454349206, "text": "@Roy1220 @brazilianbruno Why is $MSFT way below all of its moving averages in fact, when $TSLA is holding above? Look at the charts. You tell me which is more bearish.", "time": 1650793558.0, "sentiment": ""}, {"id": 454349147, "text": "@Roy1220 @brazilianbruno Still no answer. Why is the market treating $MSFT exactly the same as $TSLA?", "time": 1650793471.0, "sentiment": ""}, {"id": 454348997, "text": "@brazilianbruno @Roy1220 And you didn’t answer my question either. I asked you why if $MSFT is better positioned for this inflationary environment has it seen a similar drop in share price to $TSLA? Instead you asked me if I own any of their products. Who cares.", "time": 1650793212.0, "sentiment": ""}, {"id": 454348635, "text": "$msft $tsla adding Microsoft to my wl for the week ahead…\n\nhttps://www.benzinga.com/news/22/04/26776974/esg-ratings-make-no-sense-elon-musk-responds-to-ark-invest-analyst-who-defends-bill-gates?utm_campaign=partner_feed&amp;utm_source=robinhood.com&amp;utm_medium=partner_feed&amp;utm_content=ticker_page", "time": 1650792638.0, "sentiment": ""}, {"id": 454348510, "text": "@Roy1220 If $MSFT is immune to these problems then why is it at $273 when it was $350 in November? Because like I said, all tech is fucked in this environment. If the macro situation improves, both $MSFT and $TSLA and all these big caps will go higher. If not, lower we all go.", "time": 1650792453.0, "sentiment": ""}, {"id": 454348201, "text": "@Roy1220 And by the way $MSFT has been hit just as hard as $TSLA in this terrible macro environment. In fact Tesla beat this quarter, let’s see if $MSFT can do the same.", "time": 1650791979.0, "sentiment": ""}, {"id": 454348078, "text": "$TSLA Why doesn’t Elon just short $MSFT? Not like that stock hasn’t dropped just like all tech.", "time": 1650791819.0, "sentiment": ""}, {"id": 454346803, "text": "$SPY This aged well. Option sweeps don&#39;t lie. Check profile for more information on options sweeps. Big drop makes me think earnings like $FB and $MSFT are going to be good.", "time": 1650790086.0, "sentiment": ""}, {"id": 454345492, "text": "$SPY $NVDA . $TSLA . $MSFT $AAPL   🛰📡", "time": 1650788713.0, "sentiment": "Bullish"}, {"id": 454345447, "text": "$SPY $QQQ $AAPL $TSLA $MSFT", "time": 1650788667.0, "sentiment": ""}, {"id": 454344708, "text": "$SPY $MSFT $AAPL All at support- look for bounce Monday. Then follow this to figure out if it’s a reversal OR a great entry to play puts!\nMake sure you subscribe to get all of our valuable videos and follow our ST feed for our plays. 👊🏼\nhttps://youtube.com/shorts/ztGMsbd9sB8?feature=share", "time": 1650787851.0, "sentiment": ""}, {"id": 454344602, "text": "$TSLA $MSFT oh boy this is interesting! Elon is not to be challenged but so does Bill fuckin gates! With fed, inflation and war, looks like Tesla will be fucked in short tem, and even if not, it clearly will cap the upside! So better to exit if you are long!", "time": 1650787729.0, "sentiment": ""}, {"id": 454344564, "text": "$MSFT expecting beat in Microsoft. Question is if it does what tesla did and tank all day Monday just to sweep those losses back in AH.", "time": 1650787673.0, "sentiment": "Bullish"}, {"id": 454344124, "text": "$baba Was this post a joke @LightningRanger? 😂  Please stop w/ the silliness, sounds like you&#39;re taking all the bs you hear from Bloomberg or CNBC &amp; believing it. \n \nThe CCP didn&#39;t hurt Chinese companies they did what all the US companies have said they would do to our Tech but didn&#39;t have the guts to step up &amp; do it. Regulations? more like saving themselves from a US 2008 disaster &amp; not letting their Tech companies run the show. The US media lies &amp; twist most of what you see &amp; read here \n \nRespect like $amzn? are you joking? $msft was sued by the US gov as well &amp; spent 15 years as dead money \n \nYou are either a Troll,  really young or really uninformed but your post is really off the mark.  \n \nStop watching tv &amp; do your own research or get out of anything Chinese that you own \n \n$jd", "time": 1650787191.0, "sentiment": ""}, {"id": 454343338, "text": "$MSFT | Microsoft $MSFT Technical Data (MSFT) https://tinyurl.com/y4l4x27o", "time": 1650786305.0, "sentiment": ""}, {"id": 454343309, "text": "$SPY $TSLA $MSFT is this who Elon and bull gates stuff cryptic for buy puts on Microsoft? Or buy calls on tesla? Or both?", "time": 1650786276.0, "sentiment": ""}, {"id": 454342180, "text": "$MSFT $GOOGL $SPY  why you bought calls? Idiot all will shit..", "time": 1650785168.0, "sentiment": ""}, {"id": 454342076, "text": "$AMZN $googl $msft is $nflx a tell for these remaining megacap generals? Implosion or explosion 🚀?", "time": 1650785047.0, "sentiment": ""}, {"id": 454340964, "text": "@avanlatt You’re an imbecile theres no squeezing $MSFT Bill he’s already got the upper hand. His shares are on the market near ATH. $500 million worth there’s no squeezing him. He has all the time in the world to unload this is a disaster no wonder why Elon has never brought this public. The leaker is going to get a spanking. Black Cloud over the stock. The rich and powerful rule the world and Bill just called CHECK on $TSLA MATE is on the way.", "time": 1650783869.0, "sentiment": "Bullish"}, {"id": 454340710, "text": "I wonder if this black cloud is priced in. $MSFT Bill can essentially drop $TSLA share price by 10 - 15% when you factor bad news and a sell off this has the chance to drop the share price by 20-30% in day. Bill you’re on tricky dude. I bet he’s secretly laughing and of course Bill is ultimately going to get the last laugh 😂. This needs to be priced in. Bill you’re a genius. I love Tesla but Bill just called CHECK on Elon and MATE is coming.", "time": 1650783618.0, "sentiment": "Bullish"}, {"id": 454340175, "text": "No wonder why Elon never announced this. This is a nightmare. He wants the position closed because Bill Gates can literally kill the share price like he can destroy Tesla not many hedge funds not even Elon has half a billion available to buy shares. King Elons wealth lays in his $TSLA shares. $MSFT Bill is a genius. Whoever leaked this news is going to be in big trouble. Sure Tesla has volume in the Billions of dollars sold but in reality it’s not even a fraction when you factor in the same shares being sold back and forth hundreds of thousands of times. There ain’t 24 billion dollars in new transactions every day. Multiple hedge funds are selling shares back and forth all day long. $500 million dropped OMG", "time": 1650783114.0, "sentiment": "Bullish"}]