[{"id": 452582040, "text": "If You Invested $1,000 In Tesla $TSLA , Apple $AAPL, Microsoft $MSFT $NVDA And Other Top Stocks 5 Years Ago, Here’s How Much You’d Have Now https://www.billionaireclubcollc.com/if-you-invested-1000-in-tesla-apple-microsoft-and-other-top-stocks-5-years-ago-heres-how-much-youd-have-now/", "time": 1650077248.0, "sentiment": ""}, {"id": 452580544, "text": "$SPY $TSLA $AAPL $ARKK $UVXY 🎯", "time": 1650076408.0, "sentiment": ""}, {"id": 452579661, "text": "$AAPL bounce at 160?", "time": 1650076017.0, "sentiment": ""}, {"id": 452576770, "text": "$GOOG $MSFT $AMZN $NVDA $AAPL  \nIn response to the delegation traveling to Taiwan, the People&#39;s Liberation Army&#39;s Eastern Theater Command in China conducted military exercises near Taiwan. \n \n&quot;China firmly opposes any form of official interaction between the US and the Taiwan region.  The US side should abide by the one-China principle and the stipulations of the three China-US joint communiqués, stop official exchanges with Taiwan and avoid making irresponsible remarks,&quot; Zhao said. &quot;The Chinese side will continue to take strong measures to resolutely safeguard its sovereignty and territorial integrity.&quot; \n \nZhao made similar comments on Thursday, saying that the U.S. should &quot; avoid going further down the dangerous path,&quot; and cease official interactions with Taiwan. \n \n What did China just do w/its top offshore oil &amp; gas producer CNOOC Ltd?  The intension is always mounting  \nhttps://www.newsweek.com/china-fumes-taiwan-cites-russia-ukraine-war-urge-stronger-us-ties-1698299", "time": 1650074745.0, "sentiment": ""}, {"id": 452576485, "text": "@JuSdOit Then all American business will fail. $TSLA $AAPL $NVDA $AMD because if China ever invades or goes to war with Taiwan then all American businesses that manufacture in China will be doomed. Could you imagine. A war isn’t happening it’s propaganda China needs then USA for growth. The sanctions from North America and Europe would cripple every business.", "time": 1650074625.0, "sentiment": "Bullish"}, {"id": 452576124, "text": "$AAPL AAPL 2022-04-14 Chart Analysis Video: \nhttps://www.youtube.com/watch?v=FliXAUz0Fgc", "time": 1650074477.0, "sentiment": ""}, {"id": 452575978, "text": "$AAPL loaaaad now before is too late pt $350", "time": 1650074423.0, "sentiment": ""}, {"id": 452575039, "text": "$SPY $AAPL $TSLA \n\nEarnings should be killer next week for a RIP!", "time": 1650073967.0, "sentiment": ""}, {"id": 452574759, "text": "$AAPL with 30% inflation rate 165 is  really worth 115 of last year…..", "time": 1650073824.0, "sentiment": ""}, {"id": 452573976, "text": "$AAPL", "time": 1650073444.0, "sentiment": ""}, {"id": 452573295, "text": "If You Invested $1,000 In Tesla $TSLA , Apple $AAPL, Microsoft $MSFT And $AMD Other Top Stocks 5 Year Ago, Here’s How Much You’d Have Now https://www.billionaireclubcollc.com/if-you-invested-1000-in-tesla-apple-microsoft-and-other-top-stocks-5-year-ago-heres-how-much-youd-have-now/", "time": 1650073104.0, "sentiment": ""}, {"id": 452572366, "text": "$AMD $TSM $NVDA  TSM had a net profit of $7 billion in Q1 and Sales of more than $17.6 billion in Q1 now compare that to AMD not even $1 billion in net profit and around $4billion in sales during there last quarter. Not to mention TSM grew 45% and forecast 20-30% more growth this year. Look at the price and you’ll see what investors are seeing. Don’t forget TSM supplies AMD with there chips. You can see what investors are looking at AMD numbers are so small compared to TSM. TSM is expanding and can’t keep up with the orders so there spending another $40 billion to improve. TSM supplies $AAPL  $NVDA  and many other companies. TSM is still working in China through the loop system In there factories.", "time": 1650072727.0, "sentiment": "Bullish"}, {"id": 452570100, "text": "$AAPL was analyzed by 52 analysts. The buy consensus is at 84%. So analysts seem to be very confident about $AAPL. https://www.chartmill.com/stock/quote/AAPL/analyst-ratings?utm_source=stocktwits&amp;utm_medium=ANALYST&amp;utm_content=AAPL&amp;utm_campaign=social_tracking", "time": 1650071700.0, "sentiment": ""}, {"id": 452569155, "text": "$AAPL back to 180 next week. \n \n&quot;Foxconn is complying with the local government&#39;s Covid-combating measures. Operations in Zhengzhou are normal right now.&quot; \n \nhttps://www.imore.com/worlds-largest-iphone-factory-brings-back-mandatory-covid-tests", "time": 1650071269.0, "sentiment": "Bullish"}, {"id": 452568671, "text": "$AAPL gap down to 160 on Monday then wash down to 150 first minute of trading my puts will thank me and pay for all of my weekend spending money on the holiday weekend", "time": 1650071057.0, "sentiment": "Bearish"}, {"id": 452568428, "text": "$AAPL I’ll buy at 150 per share on this Monday thanks", "time": 1650070942.0, "sentiment": "Bearish"}, {"id": 452568149, "text": "If You Invested $1,000 In Tesla, Apple, Microsoft And Other Top Stocks 5 Year Ago, Here&#39;s How Much You&#39;d Have Now https://www.benzinga.com/general/education/22/04/26643028/if-you-invested-1-000-in-tesla-apple-microsoft-and-other-top-stocks-5-year-ago-heres-how-much-y $TSLA $AAPL $AMD", "time": 1650070793.0, "sentiment": ""}, {"id": 452567526, "text": "$AAPL https://www.reuters.com/world/china/shanghai-reports-23000-covid-cases-economic-impact-bites-2022-04-15/", "time": 1650070463.0, "sentiment": "Bullish"}, {"id": 452565962, "text": "Mark Cuban, Donald Trump, Dave Portnoy And More React To Elon Musk’s Twitter Bid https://www.billionaireclubcollc.com/mark-cuban-donald-trump-dave-portnoy-and-more-react-to-elon-musks-twitter-bid/ $DWAC $TWTR $FB $TSLA $AAPL", "time": 1650069628.0, "sentiment": ""}, {"id": 452565913, "text": "$AAPL $TSM $NVDA $AMD $SOXL @Denmark__ ok... you are providing info that a specific Taiwanese Manufacturer that builds Apple MacBooks in Shanghai CHINA is stopping manufacturing in CHINA. \n \nSo not to confuse with Taiwan shutting down chip production at $TSM $AMD $NVDA  \n \nCorrect?", "time": 1650069593.0, "sentiment": ""}, {"id": 452565338, "text": "$AAPL I fully understand WHY we are currently bearish. I genuinely want to hear WHY Apple should be looking bullish this week? All I see from bulls is green up to a certain price but I can never seem to find an intellectual reason as to WHY the price should go up this week.", "time": 1650069234.0, "sentiment": ""}, {"id": 452562516, "text": "$AMD $QQQ $SPY $NVDA $AAPL", "time": 1650067701.0, "sentiment": "Bearish"}, {"id": 452562243, "text": "How do you think the market will react to this? $AAPL&#39;s price moved below its 50-day Moving Average on April 14, 2022. View odds for this and other indicators: https://srnk.us/go/3582972", "time": 1650067555.0, "sentiment": ""}, {"id": 452561000, "text": "$AAPL $SPY spy is hot and chart look bullish , Monday and Tuesday might be bounce and with it whole market will bounce. Apple is due for 3% run", "time": 1650066858.0, "sentiment": "Bullish"}, {"id": 452559847, "text": "$AAPL NEW ARTICLE : Apple Vs. Microsoft: Why We Like Apple Better https://www.stck.pro/news/AAPL/26162384", "time": 1650066248.0, "sentiment": ""}, {"id": 452559762, "text": "$AAPL\n\nWhy I am a 🐻\n\n•A chart, no matter who it is, will always, at some point, build long term support. The fact that has not happened yet, means under these market, economic &amp; geopolitical conditions, will soon. Will we see this go sub 100 hitting the 20SMA like every other time price action has fallen out of overbought zones on the quarterly? I definitely wouldn’t rule it out.. look at how wide that 12 &amp; 26 on the MACD is 🤯\n\nPop - pop! Pop - pop - pop…", "time": 1650066197.0, "sentiment": "Bearish"}, {"id": 452559127, "text": "$SPY $AAPL currently on the works", "time": 1650065869.0, "sentiment": ""}, {"id": 452559126, "text": "$GOOG $AAPL $NVDA $MSFT $AMZN  \nRussia&#39;s defense ministry says it will increase the number &amp; sscale of missile strikes inthe future \n \n&amp; then there is this ;  \n \nCHINA MILITARY SAYS CONDUCTS MILITARY DRILLS AROUND TAIWAN ON APRIL 15  \n \nWhat could be the chances this &quot;drill&quot; becomes the actual invasion of the Chinese on Taiwan?  \nhttps://www.youtube.com/watch?v=DVHYJzqZ8X0", "time": 1650065868.0, "sentiment": ""}, {"id": 452558940, "text": "@bebopbalula @Delboyholmes Polestar&#39;s marketing makes a lot of sense on paper: focusing on design and building on top of Scandinavian roots that they want people to focus on (rather than ties to Geely/china). That Scandinavian simplicity, minimalism, eco-friendliness, and attention to the material their PR focuses on resembles $AAPL in many ways and should speak to the same audience/target groups (premium product turned into affordable luxury). Somehow doesn&#39;t feel authentic though, I see dozens of Polestars 2 on the roads here in NL every day with almost no advertising (so a bit similar to the $TSLA word of mouth marketing approach), but I don&#39;t think Polestar 2 is their iPhone type of a product yet, their cars need to catch up with the ambitions of what&#39;s shown in PR materials. Possibly Polestar 3 will be the one to fully convince me, still believe in the company long term.", "time": 1650065762.0, "sentiment": "Bullish"}, {"id": 452558502, "text": "$AAPL I&#39;m blowing somebody&#39;s daughter back out tonight", "time": 1650065535.0, "sentiment": ""}]