[{"id": 453264290, "text": "$AMZN $AAPL $NVDA $MSFT $GOOG  \nIf Stocks Don’t Fall, the Fed Needs to Force Them  \n  \nTightening financial conditions will be key to getting inflation under control.  \n \nNot a winnable environment here. One way or another the Fed wants the markets LOWER.  They are the market &amp; have been since 2010 w/slow QE up until March-2020 \n \n14 days until Fed Conference \nhttps://www.youtube.com/watch?v=Fiiib9oqTB0&amp;t=158s", "time": 1650421333.0, "sentiment": ""}, {"id": 453263522, "text": "$AAPL NFLX will bring all tech down tomorrow! Guaranteed", "time": 1650421163.0, "sentiment": "Bearish"}, {"id": 453263411, "text": "@lil_porkchop @BeyondGenius but imagine 100 million $400 phones in 2 years. Indians have money and our infra can support the demand for the phones easily. Apple needs to market to us effectively. They charge 20% more than US rates if we exclude Indian GST and US sales tax. Once they manufacture locally, sky is the limit for the 3 trillion company! $aapl", "time": 1650421137.0, "sentiment": ""}, {"id": 453263078, "text": "$NFLX next up will be  $FB $AAPL missing earnings.", "time": 1650421066.0, "sentiment": ""}, {"id": 453263033, "text": "@BeyondGenius thats all that has kept me net long here, their pivot to India. $aapl knows India is the future", "time": 1650421055.0, "sentiment": ""}, {"id": 453261352, "text": "$AAPL it’s about time people on here begin to listen to me about India. I’ve been saying it for more than a year. India will be huge. 5% of the market is 60 million phones. As apple moves  manufacturing to India their growth will be unbelievable", "time": 1650420688.0, "sentiment": ""}, {"id": 453260406, "text": "$AAPL  \nHere&#39;s an interesting 15min chart.  \nCheckout the back to back &#39;rising triangles&#39;(CHOPPY) \nVery interesting to see if we get the same reaction (rejection) as the last &#39;rising triangle&#39; they had! \nSit patient and let this work itself out.  \n \nAt close, we were looking very strong!  \nThen obviously we had a little accident AH. \nWe&#39;ll just have to let Wonky Wednesday handle itself out!  \n \nFOLLOW \n&amp; LETS MAKE MONEY💰 \n$SPY $QQQ", "time": 1650420502.0, "sentiment": "Bullish"}, {"id": 453260020, "text": "$AAPL $TSLA expect revenue forecast lower due to China shutdown lol 😂 $SPY", "time": 1650420424.0, "sentiment": "Bearish"}, {"id": 453259710, "text": "$AAPL AAPL 2022-04-19 Chart Analysis Video: \nhttps://www.youtube.com/watch?v=XoUh8CGtSOY", "time": 1650420360.0, "sentiment": ""}, {"id": 453259268, "text": "$AAPL the p/e is going to rise based on the growth in recurring revenue if nothing else. Based on what I know, I would be shocked if Apple misses this quarter, or for the year. And here’s a hint: look past iphone sales. Of course prices have little to do with earnings. Still, for all the reasons you outlined, I would expect Apple to be less volatile than other giant techs.", "time": 1650420275.0, "sentiment": ""}, {"id": 453258722, "text": "$SPY no one care bout NFLX\n\nJust wait til $AAPL and $MSFT obliterate earnings and rip to ath&#39;s\n\n🙂🙂📈👍", "time": 1650420169.0, "sentiment": "Bullish"}, {"id": 453258404, "text": "$AAPL Netflix subscribers left for Apple, Roku, Disney and other new streaming options.", "time": 1650420108.0, "sentiment": ""}, {"id": 453258188, "text": "$aapl $nflx Eps growth directly linked to India’s GDP growth for the next decade. Come back in 2 years to confirm this twit. Its about time $nflx be more sensitive to needs of #India or else they are already losing it everywhere else LOL.", "time": 1650420067.0, "sentiment": "Bearish"}, {"id": 453258156, "text": "$AAPL I don’t listen to pundits who always leave out Apple when talking about buying lower. They just want it lower than low! They have their agenda and I have mine. 🍏🍏🍏🍏🍏", "time": 1650420062.0, "sentiment": "Bullish"}, {"id": 453258054, "text": "This is what I&#39;m here for!  \nWe try to answer as fast as we can throughout the day for you all! \n+ send out LIVE market updates.  \nWe love doing it though and love helping everyone out. \n \nFOLLOW \n&amp; LETS MAKE MONEY💰 \n$SPY $QQQ  \n$AAPL $TSLA  \n$NVDA", "time": 1650420043.0, "sentiment": "Bullish"}, {"id": 453257647, "text": "$AAPL biggest market cap in the world 2.7+ trillion. Most held stock by Congress, the ticker with the biggest weighted holding in the entire s&amp;p 500. This ticker controls the market more than any other one, was sub $80 pre covid now $160+ post covid . But if buying at these prices  since 2009 there’s only been higher P/E ratios 3 times than today (all being in the last 2 years) p/e is still nearly 50% higher than it was pt’s covid . All the newly printed dollars , and transferred wealth has been piling into it. One that tells year treasury note becomes less fixed by the federal reserve bond buying its hot potato time here at aapl 🩸", "time": 1650419959.0, "sentiment": "Bearish"}, {"id": 453257521, "text": "$AAPL Maybe Netflix subscribers left for Apple 😎", "time": 1650419932.0, "sentiment": ""}, {"id": 453256787, "text": "$AAPL \n\nWill my puts print tomorrow 🧐", "time": 1650419779.0, "sentiment": ""}, {"id": 453256265, "text": "$AAPL Wanted to watch Severance, TV show I&#39;d heard good things about. I don&#39;t have any Apple devices. Was able to sign up for a three months free trial through Target Circle (lol) and can watch on Fire TV. Great show and good other programming, too. Best part? When the trial is over, it&#39;s only 5 bucks a month apparently, as many users as you want, it looks like\n\nTake that, every other streaming service $NFLX \n\nNo Android app for Apple TV, though. So there&#39;s that lol\n\nApple TV just trying to gather subscribers at this point I suppose", "time": 1650419677.0, "sentiment": ""}, {"id": 453256113, "text": "$AAPL let’s make it $140 since Netflix results guide Apple. 🤣🤣🤡🤡🤡That ideas is Beyond stupid.", "time": 1650419645.0, "sentiment": ""}, {"id": 453255754, "text": "$AAPL", "time": 1650419575.0, "sentiment": "Bearish"}, {"id": 453255701, "text": "$AAPL 160 tmrw?", "time": 1650419566.0, "sentiment": "Bearish"}, {"id": 453255151, "text": "$AAPL I’d be willing to bet that Apple, Roku and Disney subscribers have increased the last quarter at the expense on Netflix. Netflix missing is not an indicator of economic weakness. It’s an indicator of increasing, effective competition. Netflix results are not a by product of a poor economy. Don’t make it out to be more than it is. Of course, most retail geniuses on here will sell everything. Dumb.", "time": 1650419454.0, "sentiment": ""}, {"id": 453254385, "text": "$JAGX \n\nNext $AAPL here we go. \n\nCan u image $175 a share.", "time": 1650419314.0, "sentiment": "Bullish"}, {"id": 453254178, "text": "$AAPL Looked like 7 million shares dumped in closing minutes to bring it down", "time": 1650419273.0, "sentiment": ""}, {"id": 453254129, "text": "$AAPL  \nStruggled in that 167-168 zone today.  \nLets see if we can get above it tomorrow for a nice put and trading opportunity... \nor  \nReject and come back down for a break of 163... MAJOR support @164! \n \nFOLLOW \n&amp; LETS MAKE MONEY💰 \n$SPY $QQQ", "time": 1650419263.0, "sentiment": "Bullish"}, {"id": 453253986, "text": "Why Poison Pills Have Been Effective at Warding off Unsolicited Offers \n \nRead: https://channelchek.com/news-channel/Why_Poison_Pills_Have_Been_Effective_at_Warding_off_Unsolicited_Offers \n \n $SPY $TWTR  $QQQ $AAPL $TSLA", "time": 1650419235.0, "sentiment": ""}, {"id": 453253143, "text": "$QQQ $SPY $AAPL \n\nNetflix subscription low is expected due to price hike and competition from $DIS and $AMZN", "time": 1650419082.0, "sentiment": "Bullish"}, {"id": 453252740, "text": "$SPY  📚.... Astrology .....Crayon lines and astrology....🤡 Dead on the mark...🎯  Some of y&#39;all need to stop talking smack and just do a little bit of studying 🤷‍♂️ $TSLA $AAPL $UVXY $ARKK 🍀", "time": 1650419006.0, "sentiment": ""}, {"id": 453252613, "text": "$AAPL $162 EOW", "time": 1650418983.0, "sentiment": "Bearish"}]