[{"id": 454288319, "text": "$AAPL stock analysis based on closing price \n\nhttps://youtu.be/iZI78_EuFiE", "time": 1650741719.0, "sentiment": ""}, {"id": 454288197, "text": "$AAPL Mood Lighting 101: Gadgets to Level Up Your Living Room6 min read \n\nhttps://newsfilter.io/a/0fb27b12a8ee8b02ddf5942b0d87e2bf", "time": 1650741617.0, "sentiment": ""}, {"id": 454287685, "text": "$AMD $AAPL $DIS $STEM $MGNI counting on you 5. Don’t make me work til 2050.", "time": 1650741175.0, "sentiment": ""}, {"id": 454287090, "text": "$NFLX When majority is a bear, it&#39;s time to accumulate the bottom.   Most bear claims are misinformation at best.  1) ad-supported model will provide lower subscription prices for those who can&#39;t afford $20/month fees.  2)  Reduction from 4 users to 3 and collecting nominal $2.99 per user fee is to limit LARGE families (of 20+ people) from sharing the same account.    \n \nWhile the bears present this as negative, no other OTT platform allows sharing multiple users per account.  $AAPL $DIS  etc are all 1 for 1 subscription model.   Netflix multi-user model is a bargain on per user cost basis.    You can&#39;t blame the company trying to monetize the ILLEGAL and FREELOADER viewers.   But then, I&#39;d much prefer the company EXPAND services to live sports, online gaming, sports betting, Netflix Event Centers/Retail Stores, Netflix Social Network, Netflix Credit/Pay system, etc.     \n \nIt&#39;s time for Netflix to step up to next stage in growth.  $spy", "time": 1650740678.0, "sentiment": ""}, {"id": 454286893, "text": "@JohnCashNYC @Boardroommaster if $AAPL or $MSFT fall big after earnings next week, market will be in a free fall.", "time": 1650740507.0, "sentiment": ""}, {"id": 454286202, "text": "$AAPL once 165 broke. I didnt bother entering calls. On the sideline for now. Every indicator is pointing to a gap down. Could see relief after with extreme oversold on the 4hr. But doesnt change the fact that this posted a hanging man on the quarterly timeframe and MACD is about to cross on the monthly", "time": 1650739903.0, "sentiment": ""}, {"id": 454285782, "text": "$AAPL Joe Biden’s got our back - we gonna smash earnings", "time": 1650739537.0, "sentiment": "Bullish"}, {"id": 454284960, "text": "$UPST similarly to a few weeks ago with $AMZN, the whole market needs $AAPL to report good earnings this week so we dont get pummeled even further. \nIf this were an unprofitable company I would actually be worried right now. Know what you’re holding right now. Filling the gap down is not ideal obviously, but I think it will help support our next big run.", "time": 1650738756.0, "sentiment": "Bullish"}, {"id": 454284372, "text": "Why not.. many a Hollywood actor have made their own liquor and sold it for millions &amp;/or billions~ \n\nAfter this week past quarter we all need a few shots! 🥃🍻🤪\n\nTesla $TSLA Tequila Limited Edition Set\n$420 (sold out)\nDescription\nEnjoy one of the last 420 bottles of Tesla Tequila paired with two Sipping Glasses for a limited time. \n\n$AAPL $AMD $BTC.x $MSFT  https://digitalassets-shop.tesla.com/image/upload/f_auto,q_auto/v1/content/dam/tesla/LIFESTYLE/ACCESSORIES_COLLECTIBLES/DRINKWARE/1617866-00-A.jpg", "time": 1650738200.0, "sentiment": ""}, {"id": 454283877, "text": "@TomC12 to be honest, this company has the same issues that many Spacs have. Right now the market does not know how to value it the company, and is assigning a negative value to cash held. \n\nTod is out for good. We&#39;ll see at what amount he sells his shares. \n\nRight now markets are in free fall. The only good thing going for $XL holders is that there is limited amount to fall from here compared to the last few companies that have retained value so far - $aapl, $msft, $tsla etc.", "time": 1650737746.0, "sentiment": ""}, {"id": 454283769, "text": "$AAPL 165 Monday 🥸", "time": 1650737623.0, "sentiment": "Bullish"}, {"id": 454283533, "text": "$MSFT $SPY $AAPL $SPOT $ABBV  \nMost Anticipated Earnings This Week   \nhttps://www.financegreater.com/earnings-calendar", "time": 1650737383.0, "sentiment": ""}, {"id": 454282819, "text": "$AAPL The world is running on AAPL MSFT, and GOOGLE.\nAAPL  $3T market cap any chance for the crash?", "time": 1650736663.0, "sentiment": "Bullish"}, {"id": 454282661, "text": "Dear Past, \n \nThings became murkier then expected. The war is over and yet many left scars on our economy as the result of the vindication of electing Biden. COVID ironically still exists. We are in a recession where the poor became poorer and the rich got richer with one expectation. \n \nThe market $SPY now seems calm. Majority of the gamblers were wiped out. The leading companies of 2021: $AAPL, $TSLA, $FB are now far back in the ranks and caused significant losses for many. The media is still sharing mass delusions \n \nI am delighted to hear that after many losses you became resilient. The market has taught you many lessons. The first being to always protect your capital and the second: do not forget the first lesson. You developed a strong understanding of how to select companies that would perform well during uncertain times that lead to you 400-500x your current capital. You now developed your own working set of tools to deal with the murky future to come. \n \nSincerely, \nFuture", "time": 1650736497.0, "sentiment": "Bearish"}, {"id": 454281542, "text": "$BRGX.X $AAPL", "time": 1650735129.0, "sentiment": "Bullish"}, {"id": 454281327, "text": "This real estate investor has a side hustle mining more than $110,000 in bitcoin every month  $AAPL $BTC.CB $SQ \n\nhttps://newsfilter.io/a/9b8a34b29b25663fe3273e3cd563376e", "time": 1650734907.0, "sentiment": ""}, {"id": 454281169, "text": "$AAPL won’t be standing this coming week, 120-130 coming!  \nhttps://finance.yahoo.com/m/9d94c8ac-1d11-3624-a9cd-920d32d33919/apple-is-the-last-faang.html", "time": 1650734724.0, "sentiment": "Bearish"}, {"id": 454281140, "text": "$AAPL AMD \n\nI say let’s assume that the market will be in red for a while to make that “correction” if you’re a long term investor then don’t panicked or sell … it will come back stronger and stronger, specially AAPL, and $AMD because of the consumers worldwide love for these names and qualities. I will add one thing, both AAPL and AMD should definitely have a solid plan to have all their products built, assembled and sold in USA 🇺🇸 and down with relying on China’s shitty government and control of our goods, I hope my BF does not read this post because he won’t like it, he is Chinese even he tells me the same thing, I don’t care if I have to spent $100 more for iPhone if it generates more job for American men and women then I skip one dinner putting just to make sure I am buying my things built by American labor on American soil, GOD BLESS America and God bless you for taking you time and reading this post. USA 🇺🇸 USA 🇺🇸", "time": 1650734683.0, "sentiment": "Bullish"}, {"id": 454280941, "text": "1 of 11 $AAPL $AMGN $AXP Daily and 30 min charts of the DJIA Components with the SSI indicator, a proprietary indicator based exclusively on the eSignal platform, are posted here weekends … see 2/11", "time": 1650734437.0, "sentiment": ""}, {"id": 454280153, "text": "$AAPL  Apple", "time": 1650733417.0, "sentiment": "Bullish"}, {"id": 454279777, "text": "$AAPL \n$AMD\n\nLet see how the MM will play it next week? They are the one that make the rules Im WS the retailers and small bears 🐻 are just small ants 🐜 which probably make less than 6% of all transaction per day. So when you see AAPL goes from $164 to $167.88 in less than 2 mins with over 1.5 millions shares being traded that’s is not Small retailers of bulls or bears that is the power of MM and hedge fund manager, so I can careless about the RED or GREEN day the questions is what direction would the MM want a go on any day. I have seen APPL fluctuated $5 up and  down and sometimes they do it multiple times per day … again what we see is the gigantic power and control of the MM in WS… I finish with saying we shall witness the  least of our expectation next week, Best wishes for all love my $AAPL $AMD", "time": 1650732933.0, "sentiment": "Bullish"}, {"id": 454279607, "text": "$AAPL NEW ARTICLE : Apple Reveals Attachable Gaming Controllers https://www.stck.pro/news/AAPL/26612378", "time": 1650732676.0, "sentiment": ""}, {"id": 454279435, "text": "$AAPL to report earnings on Apr 28 AMC, with an expected move of ±5.7% https://tinyurl.com/y8w2sdn9", "time": 1650732463.0, "sentiment": ""}, {"id": 454279402, "text": "$AAPL $MSFT $GOOG if you think these 3 are going to fail earnings must be crazy!!! They run the world and hold the market from crashing!!", "time": 1650732402.0, "sentiment": "Bullish"}, {"id": 454279168, "text": "Amarrensen los cinturones por que esta semana vienen  curvas… son las empresas que marcan el mercado h los grandes indices así que indicaran un poco el rumbo a corto plazo del mercado! $GOOGL  $MSFT $AAPL $AMZN $V", "time": 1650732083.0, "sentiment": ""}, {"id": 454279029, "text": "$AAPL 🫃 🤷🏼‍♂️", "time": 1650731880.0, "sentiment": "Bullish"}, {"id": 454278614, "text": "Equity Sentiment: $AAPL is the #1 stock that institutions are trading with 49.3K options contracts.\n\nMarket analysis included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (Link in profile - @InsiderFinance)", "time": 1650731290.0, "sentiment": ""}, {"id": 454278013, "text": "$SPY just change your mindset remember how we rallied every day for the last two years well now we’re rallying down just get on board. \n\nPuts on $MSFT \nPuts on $GOOGL \nPuts on $AAPL", "time": 1650730382.0, "sentiment": "Bearish"}, {"id": 454278002, "text": "#earnings for the week  \n \nhttp://eps.sh/cal  \n \n$FB $AAPL $MSFT $AMZN $PYPL", "time": 1650730364.0, "sentiment": ""}, {"id": 454277930, "text": "$AAPL NEW ARTICLE : Apple Could Destroy the Competition With Subscription Models https://www.stck.pro/news/AAPL/26612307", "time": 1650730267.0, "sentiment": ""}]