[{"id": 454240269, "text": "@2Haflingers $AAPL ceo is gay and supports LBGTQ where’s your boycott there?", "time": 1650688811.0, "sentiment": ""}, {"id": 454239890, "text": "$AAPL I am getting her ready to make\nMoney.", "time": 1650688637.0, "sentiment": "Bullish"}, {"id": 454239603, "text": "$AAPL NEW ARTICLE : Two-Minute Drill: AAPL and UNP https://www.stck.pro/news/AAPL/26583062", "time": 1650688507.0, "sentiment": ""}, {"id": 454239503, "text": "$QQQ NASDAQ Cookie🎄Tree Cut👎 Pattern =🐻 $CRM $AMD $AAPL $QQQ $SPY \nMarket likely goes lower from here …..\nSelling Signal confirmed today is likely for the next 2 weeks", "time": 1650688469.0, "sentiment": "Bearish"}, {"id": 454238941, "text": "$AAPL $SPY I thought it was Thursday all day trading... tf", "time": 1650688225.0, "sentiment": ""}, {"id": 454238862, "text": "$AAPL My penny stocks did better this week.....", "time": 1650688195.0, "sentiment": ""}, {"id": 454238742, "text": "$SPY $QQQ $TSLA $AMC $AAPL by a show of hands, who voted for this guy?", "time": 1650688137.0, "sentiment": ""}, {"id": 454238456, "text": "$AMD $MSFT $AAPL $NVDA multiple compression just starting. You&#39;re going many of the best under 20PE in next 2 years. \nAMD 50 MSFT 180 AAPL 100 NVDA 80", "time": 1650688012.0, "sentiment": ""}, {"id": 454237201, "text": "$SPY $TSLA $NVDA $FB $AAPL \n\nMy thoughts on the CNBC talking heads  ... \n\nWhen the bear mkts are surging,  Mr. Cramer tells you to buy stock. Tonight after we are already  down 5% in two days,  he is telling viewers to raise cash. He&#39;sthe worst timer. Please don&#39;t listen to Cramer ..\n\nSuper bull JP Morgan&#39;s Marko Kolanovich told us this week get long, the mkt is going higher. Please don&#39;t listen to Marko. \n\nSpeaking of super bulls, Tom Lee of  Fundstrat called for a rip your face off rally in Feb. Ouch. He too is bullish every day. Please don&#39;t listen to Mr. Lee. \n\nThe Njarian Brothers. Jon is the new Demnis Gartman. You do the opposite of him. Please don&#39;t listen to Jon. \n\nJoe Terranova. Joe said get long mega cap when SPY was at 460. Ouch. This week he got long fertilizer names, a sector I love but I was touting months ago. Did he just top it? Don&#39;t listen to Joe. \n\nWho do I respect? Dan Niles, Josh Brown, Mike Santoli and David Faber. \n\nBottom line, don&#39;t rely on talking heads. ✌️", "time": 1650687478.0, "sentiment": ""}, {"id": 454237109, "text": "$AAPL how much lost this week? Let’s see", "time": 1650687447.0, "sentiment": ""}, {"id": 454237073, "text": "Apple’s Newest iPhones Sold The Most In Q1 https://www.billionaireclubcollc.com/apples-newest-iphones-sold-the-most-in-q1/  $AAPL", "time": 1650687432.0, "sentiment": ""}, {"id": 454236593, "text": "$AAPL the last one standing", "time": 1650687229.0, "sentiment": ""}, {"id": 454236235, "text": "$AAPL why is it still dumping omg stop", "time": 1650687083.0, "sentiment": "Bullish"}, {"id": 454236115, "text": "$AMD $SQ $NVDA  $AAPL $QQQ  everyone is running scared , With their heads down and feeling defeated … and finally closing down their positions .. that’s when u know a reversal is on the horizon. Take a look at the 3 year chart for QQQ.. rsi is about to be oversold. Last time it was as extended as now was in 2020 and look how much it pushed up! MACD is recovering and almost out of the red. Touching support the market made when the war with Ukraine started. Expect a small bounce cause it’s coming", "time": 1650687030.0, "sentiment": "Bullish"}, {"id": 454235957, "text": "$AAPL JUST HEARD, “BIDEN TO ADDRESS FAA…HE WANTS TO CANCEL ROUND TRIP AIRFARE…ONLY ALLOW ONE WAY TICKETS ONLY”.  BIDEN SAID, “IT WILL CUT DOWN ON EMISSIONS”.  ????", "time": 1650686954.0, "sentiment": "Bullish"}, {"id": 454235062, "text": "We are in lovely company.\n\n$WISH -95.12%\n$AMZN -95.12%\n$AAPL -95.64%\n\nI wish for you all a nice weekend.", "time": 1650686555.0, "sentiment": "Bullish"}, {"id": 454234335, "text": "$AMZN $SPY $GOOGL $FB $AAPL Black Monday?", "time": 1650686266.0, "sentiment": ""}, {"id": 454234194, "text": "$AAPL When will your iPad become obsolete?\n https://flip.it/sd8_5s", "time": 1650686210.0, "sentiment": ""}, {"id": 454234163, "text": "$NFLX $QQQ $AAPL $TSLA $SPY", "time": 1650686195.0, "sentiment": ""}, {"id": 454233965, "text": "Sweep Options Activity: $AAPL is the #2 ticker with sweep activity where institutions are trading options urgently with 41.6K sweep contracts, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (Link in profile - @InsiderFinance)", "time": 1650686110.0, "sentiment": ""}, {"id": 454233860, "text": "$AAPL $MSFT $SPY  ill leave you with this. The stock market is a scam. It always has been. It’s all based on pure manipulation. We’ve seen greed run rampant for two years! MM’s always look to maximize, then dump their trash on you. They always play it both ways! Think like an MM and you will do well! Best wishes! ✌🏻", "time": 1650686070.0, "sentiment": ""}, {"id": 454233787, "text": "$SPY $QQQ $AAPL $MSFT $CRM", "time": 1650686042.0, "sentiment": ""}, {"id": 454233497, "text": "$AAPL these leaps were sold yesterday at 31, I rebought them today at 28. Easy 5k in the coming days!", "time": 1650685929.0, "sentiment": "Bullish"}, {"id": 454233479, "text": "$AAPL NO JOKE…BIDEN JUST SAID, “FOSSIL FUELS HURT FOSSILS”.  ???", "time": 1650685923.0, "sentiment": "Bullish"}, {"id": 454233282, "text": "Bulls it is not the time to buy Stonks today, \nIf you have a long time Hirizon then maybe you have a better chance to be ok but for now no touch the Mkt FOMO \nnot working 😂\nBottoms aren’t put in at the end of a trade week on a Friday Historically \n$CRM $QQQ $AMD $AAPL $MSFT", "time": 1650685844.0, "sentiment": "Bearish"}, {"id": 454233130, "text": "$AAPL MM’s want to cash in on premium. They will want to manipulate calls from $160-200. It’s just easy money for them. They can maximize without any reasoning for it.", "time": 1650685784.0, "sentiment": ""}, {"id": 454233107, "text": "$SPY this time its not about earnings, its about future guidance $AAPL", "time": 1650685772.0, "sentiment": ""}, {"id": 454232876, "text": "$AAPL still long way to test $150s to buy shares and sell them to you at $178", "time": 1650685675.0, "sentiment": ""}, {"id": 454232576, "text": "$AAPL $MSFT both will have great earnings. Both have sold of this week. Does it make sense for it to sell off more going into earnings? I am more inclined to believe we will see a huge rally, then profit taking after earnings.", "time": 1650685551.0, "sentiment": ""}, {"id": 454232204, "text": "$AAPL $SPY $MSFT its all psychological. Now everyone expects all earnings will tank. It’s never that simple! ✌🏻", "time": 1650685399.0, "sentiment": ""}]