[{"id": 454231999, "text": "$AMZN $SPY $GOOGL $FB $AAPL Monday we will see the Asian markets tank and the ripple effect. Monday will be the continuation of the bear rally", "time": 1650685315.0, "sentiment": "Bearish"}, {"id": 454231740, "text": "$AAPL I believe we will see 150 area before earning hitting the long term channel then bounce back up on actual ER day", "time": 1650685201.0, "sentiment": "Bullish"}, {"id": 454231354, "text": "$SNAP, $AMD , $AAPL , $NVDA , $FB", "time": 1650685047.0, "sentiment": "Bullish"}, {"id": 454231310, "text": "$AAPL NEW ARTICLE : 7 Tech Stocks Reporting Earnings the Week of April 25 https://www.stck.pro/news/AAPL/26580718", "time": 1650685028.0, "sentiment": ""}, {"id": 454230808, "text": "$SPY $DJIA $QQQ $AAPL $TSLA  \n \nWhat part is so difficult to understand. \n \nIt&#39;s an easy game...really.", "time": 1650684818.0, "sentiment": ""}, {"id": 454230496, "text": "$AAPL I buy my shares with my apple 🍎 phone.   It does bring good luck.  Load the boat and win.", "time": 1650684693.0, "sentiment": "Bullish"}, {"id": 454230407, "text": "$INTC $AAPL $AMD $NVDA The king of chips $TSM os the better investment lower PE higher Revenues  and a much larger net earnings one can only dream off. Now the the king of Tech Apple is about to partner with the king of chips with TSM new 2nm Node. Intel is years behind and they’ll never catch up to the king of chips. You really think intel can compete haha. FYI AMD has an intrinsic Value of $38 and I’m thinking NVDAs intrinsic value is around $85 I’ll come back with the numbers and  for the laggard Intel we have an intrinsic value of $26 \n\nhttps://www.tomshardware.com/news/apple-intel-tsmc-2nm-node", "time": 1650684652.0, "sentiment": "Bullish"}, {"id": 454230268, "text": "$SPY $TSLA $AAPL $FB $NVDA \n\nMy thoughts on the mkt action this past week \n\nFirst off, ive consistently been telling my members that these big rallies are bear mkt rallies, that I am a seller into any strength. And it hasn&#39;t been easy to remain in that camp  - not when the &quot;experts&quot; on CNBC  continously tout how bullish they are.  Not when we have 150 handle rallies in just three days. But I&#39;ve been in multiple bear mkts and that is exactly the type of action you get. \n\nMy Game Plan for next week  goes out on Sunday and it may be my most important one yet (email me at jessielivermore1929@gmail.com if you want to join). \n\nWhy so important? Because next week is one of the most important weeks this mkt has had in years. Big cap tech earnings are going to create a massive selloff or a relief bounce. PCE is going to spark future fear or a calming effect. And our technical levels are going to be tested. \n\nFor those who subscribe, I look forward to sending out this weekend&#39;s Game Plan Sun ✌️", "time": 1650684597.0, "sentiment": ""}, {"id": 454230235, "text": "$AAPL ER next wk, will an apple a day keeps the doctor away?", "time": 1650684585.0, "sentiment": ""}, {"id": 454230158, "text": "Unusual Options Activity: $AAPL is the #24 ticker with unusual activity from institutional traders with an average of 17% out of the money, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (Link in profile - @InsiderFinance)", "time": 1650684544.0, "sentiment": ""}, {"id": 454230126, "text": "$AAPL \n\nWent to the apple store a couple times last week.\n\nPacked!! Unbelievable how busy the apple store was. What about your community?", "time": 1650684532.0, "sentiment": "Bullish"}, {"id": 454230106, "text": "$AAPL I think we start Monday with some sort of bounce, but the trend is down.", "time": 1650684523.0, "sentiment": ""}, {"id": 454229921, "text": "@Iwillbethere @Numimaker with $AAPL and $MSFT reporting next week. If they miss. Look out below. The generals are always the last to fall. Be careful with that thinking that the bottom is in. It can always go lower.", "time": 1650684449.0, "sentiment": ""}, {"id": 454229567, "text": "$AAPL ok y’all just bought a boat load at these prices.", "time": 1650684315.0, "sentiment": "Bullish"}, {"id": 454229108, "text": "$IWM $JBLU $V $MSFT $AAPL  \nMost Anticipated Earnings Next Week  \nhttps://www.financegreater.com/earnings-calendar", "time": 1650684131.0, "sentiment": ""}, {"id": 454229089, "text": "$AAPL shows a strong growth in EPS: 63.57%. https://www.chartmill.com/stock/analyzer/stock/AAPL?view=fundamental-analysis&amp;key=bb853040-a4ac-41c6-b549-d218d2f21b32&amp;utm_source=stocktwits&amp;utm_medium=FA&amp;utm_content=AAPL&amp;utm_campaign=social_tracking", "time": 1650684120.0, "sentiment": ""}, {"id": 454228243, "text": "@jd121 inflation plus Netflix     sh:tshow shows that pretty much anything can happen.  Video of Putin with skinny legs and signs of Parkinson’s - gotta wonder what else is “unknown”\n\nPlus Ukraine etc etc.\n\nIMO none of this changes until the last “General” falls.   And that General is $AAPL and I do believe it will be Netflix-ish with stunning impact on world “wealth”\n\nI’m long.  No real alternative lol", "time": 1650683767.0, "sentiment": ""}, {"id": 454228122, "text": "Did some buying today. Added $GOOG $DIS $AAPL $TSLA $SOXL \n\nMixed bag. Some weeklies &amp; monthlies calls.\n\nWhat did y’all scoop today?", "time": 1650683728.0, "sentiment": ""}, {"id": 454228025, "text": "$AAPL", "time": 1650683697.0, "sentiment": ""}, {"id": 454227837, "text": "Look NASDAQ Treacherous=LowerLows #Void INV H&amp;S’s $CRM $AMD $MSFT $AAPL $SPY \nThis is Bad for whole Market", "time": 1650683624.0, "sentiment": "Bearish"}, {"id": 454227672, "text": "If you’re trading this week, Read This! $AAPL in Uptrend: price may ascend as a result of having broken its lower Bollinger Band on April 11, 2022. View odds for this and other indicators: https://srnk.us/go/3602654", "time": 1650683553.0, "sentiment": ""}, {"id": 454227642, "text": "$SPY Daytraders took a vantage of the opportunity today. \n\nThey were able to spot a little weakness and take a vantage of stops that’s all. \n\nShits over and was over-sold    \n\nOn every time frame. Over shorted everything’s gana squeeze everything \n\n    $AMZN  $AAPL  $NVDA $QQQ", "time": 1650683545.0, "sentiment": "Bullish"}, {"id": 454227573, "text": "NASDAQ Treacherous=LowerLows #Void INV H&amp;S’s $CRM $AMD $PYPL   $AAPL $QQQ", "time": 1650683518.0, "sentiment": "Bearish"}, {"id": 454227175, "text": "$GOOGL $FB $AAPL $MSFT Money set side to add to the big guys. Shit the bed or destroy earnings, Im ready for both. LETS GO 🚀🚀🚀🛸🛸🛸🌙🪐", "time": 1650683363.0, "sentiment": "Bullish"}, {"id": 454225845, "text": "$AAPL, $AMZN, $GOOG, $MSFT, $FB: Why Are Stocks Down Today? https://investorplace.com/2022/04/aapl-amzn-goog-msft-fb-why-are-stocks-down-today/", "time": 1650682874.0, "sentiment": ""}, {"id": 454224580, "text": "$SPY From $3 to over $9 on these puts in 24 hours. I will be posting in my free room if I have 1000 members. They are 632 members as of this post. So see you there. Can start posting as soon as Monday if we hit 1000. It&#39;s free to join. if not I will keep posting in my private room till the 1000-member pivot is hit.  I&#39;m zcashisking also known as the Oracle. 100% accurate $SPY trades for over a year.  See you there, it&#39;s free to join. $aapl, $msft, $fb earnings are next, and you want to be ready to navigate the next move.", "time": 1650682390.0, "sentiment": ""}, {"id": 454224499, "text": "$AAPL - AAPL Happy Friday - was trending today - see where it is on the leaderboard 👇(Hint - it&#39;s in the top 20)", "time": 1650682355.0, "sentiment": "Bullish"}, {"id": 454224370, "text": "$AAPL  lmao at idiots selling, big boys got your shares just like last time. The rocket is ready to take it to a 190-200 soon, 350 eoy after car reveal", "time": 1650682317.0, "sentiment": "Bullish"}, {"id": 454224224, "text": "$aapl starting to crack in big tech carnage https://youtu.be/B7h3WrKzKwo", "time": 1650682266.0, "sentiment": ""}, {"id": 454224129, "text": "Again, $AAPL is not invincible. \n\nYou guys see all of that, right? Momentum is like WOAH, on its own. Plunging!", "time": 1650682232.0, "sentiment": "Bearish"}]