[{"id": 454378977, "text": "$MSFT $AAPL  if these don’t hold up next week the indices will fall another 20% before reaching a bottom", "time": 1650837573.0, "sentiment": ""}, {"id": 454378550, "text": "$AAPL - AAPL Happy Sunday everyone, hopefully you had some time to enjoy the weekend and get ready for the trading week ahead.  \n \nCheck this out  👇", "time": 1650837301.0, "sentiment": "Bullish"}, {"id": 454378500, "text": "not really a tech company. The likes of $AAPL", "time": 1650837265.0, "sentiment": "Bullish"}, {"id": 454378117, "text": "$SPY  @OldFngGuy where are you??? 😂 it’s one thing to ride the fed and claim you have skill but atleast have the guts to be around when the market tanks to explain to your followers that you are just a shill and a no skill wannabe. True skill could ride out any dips and see then coming before they do like I told you right? Remember when u bought $AAPL at all time highs and I was nice enough to tell u a crash was coming? Remember when u said u hedge and I said not this time sir please sell and buy back everything at 389-412? Remember I said it will save you years? Remember your loud dirty spitting mouth yelling at the youth on this site telling them how wrong they were and how you are the 1% that gets everything right? How’s that working for you? By the way did u check your blood sugar today? U look a little diabetes’ ish. Remember something old man. It’s ok to have an opinion but you take it too far by putting people down and you can’t back up your words with skill. Mic drop 🎤", "time": 1650837018.0, "sentiment": ""}, {"id": 454377590, "text": "$AMD $AAPL $AMZN $TSLA Not that we should cheer for the lost jobs, but Wells Fargo is clearly sounding the alarm that mortgage volumes are plummeting. Inflation will take a hit on housing prices in the coming months, especially with strong base effects also kicking in \n \nhttps://www.nationalmortgagenews.com/news/wells-fargo-confirms-mortgage-staff-layoffs", "time": 1650836612.0, "sentiment": "Bullish"}, {"id": 454377491, "text": " $AAPL AAPL is in our Market watch for this week.  Visit my home page for  Daily update in Short Interest, News , Discussions and upcoming catalyst.  Was up $1290 just 2 trades/week  in-spite of present Market", "time": 1650836543.0, "sentiment": "Bullish"}, {"id": 454377231, "text": "$SPY $TSLA $GOOGL $AAPL $MSFT \n\nMy thoughts as we head into the most important week of the year .... \n\nFirst off, my Game Plan goes out in an hour. I discuss where I believe mkts are headed as well as a breakdown of all the key earnings. I discuss the big cap tech names and which ones I would still avoid and which I like. Am I still bearish on the mkt as I&#39;ve been since the first week of January? I am. But to what levels? \n\nThose who want to join, email me at jessielivermore1929@gmail.com \n\nFinally, a quick tip .... I recently heard from a member who said he doesn&#39;t short stocks/mkt. I can respect that. It isn&#39;t for everyone. However, I will say this. If you are trying to make a living as a professional trader/investor, you HAVE to know how to short stocks. It isn&#39;t easy and the risk is heavier, but it is a tool you have to have in your bag. \n\nWe have a huge week ahead. Big cap tech. PCE data. Mkt technicals being tested. Strap on both seatbelts we are headed for some massive moves. ✌️", "time": 1650836367.0, "sentiment": ""}, {"id": 454376894, "text": "$SPY $COST $AAPL $FB $AMZN", "time": 1650836112.0, "sentiment": ""}, {"id": 454375652, "text": "$AAPL to 150?", "time": 1650835203.0, "sentiment": "Bearish"}, {"id": 454375601, "text": "@goodmeyer83 $AAPL $TSLA $AMZN", "time": 1650835161.0, "sentiment": "Bullish"}, {"id": 454375392, "text": "$AAPL You can only pick three tech stocks to invest in at 40-50% off ATH. \nWhich ones are they?\n\nLet’s hear it!!", "time": 1650834999.0, "sentiment": ""}, {"id": 454375218, "text": "Trading $AAPL earnings this week ahead (LEAP puts)  \n \n-Bearish monthly \n-China Lockdowns  \n \nhttps://youtu.be/9yoAzgMjs1o", "time": 1650834866.0, "sentiment": ""}, {"id": 454374965, "text": "$AAPL best stock on the market 🔒", "time": 1650834670.0, "sentiment": ""}, {"id": 454374500, "text": "@bearingling \n\nSo okay. My thought process what NASDAQ ran up the most, so does it potentially have the most to lose? What still has the most downside.. I have a nice spread of $AAPL puts that expire in July, $TSLA puts that expire in December, &amp; $PSQ calls that hit in July &amp; January.. weekly I’ll just pick one I know really well - AAPL, &amp; catch them at the right time. Wed &amp; Thurs morning I picked up a bunch of 170 &amp; 167.5 puts lol", "time": 1650834324.0, "sentiment": ""}, {"id": 454374154, "text": "$AAPL NEW ARTICLE : Apple declined 2.12% to close at $161 but how much further can it drop? https://www.stck.pro/news/AAPL/26677485", "time": 1650834068.0, "sentiment": ""}, {"id": 454373830, "text": "$AAPL $170 or $150 is the question everyone wants to know. Soon we will all find out!!!", "time": 1650833828.0, "sentiment": ""}, {"id": 454372540, "text": "$MSFT Microsoft super slow and need antivirus to work properly.. buy $AAPL is better and faster.. even $GOOGL is better now..", "time": 1650832812.0, "sentiment": ""}, {"id": 454371649, "text": "Here’s How Much $1,000 Invested In Apple When The iPhone 13 Was Launched Is Worth Right Now https://www.billionaireclubcollc.com/heres-how-much-1000-invested-in-apple-when-the-iphone-13-was-launched-is-worth-right-now/  $AAPL", "time": 1650832119.0, "sentiment": ""}, {"id": 454371491, "text": "Earnings this week:\n\n$FB $AAPL $MSFT $AMZN $GOOGL", "time": 1650831993.0, "sentiment": ""}, {"id": 454371217, "text": "$AAPL $DIS $TSLA How to confirm moves using Fibonacci and candles.\nMake sure you like and subscribe to our channel so you get all of our valuable videos and alerts. Enjoy \n\nhttps://youtu.be/yDWvOwCbVKw", "time": 1650831809.0, "sentiment": ""}, {"id": 454370824, "text": "$MSFT $AAPL $VIX $FB $SPY", "time": 1650831536.0, "sentiment": ""}, {"id": 454370575, "text": "$AAPL $AMD $GME The Secret Sauce is insanely accurate to the downside and upside!\n\nhttps://youtu.be/aWZe_EHS-AY", "time": 1650831349.0, "sentiment": ""}, {"id": 454370574, "text": "$AAPL 🫃I’ve started to like this one now that the real meaning is clear. Thanks Tim!", "time": 1650831349.0, "sentiment": "Bullish"}, {"id": 454370547, "text": "$AAPL Apple, Inc. (NASDAQ:AAPL) is expected to report its fiscal second-quarter earnings on April 28 after the market close. One analyst has listed three important factors Apple investors should be watching in the Apple earnings report.\n\nThe Analyst: Bank of America analyst Wamsi Mohan reiterated his Buy rating and $215 price target for Apple.\n\nThe Thesis: Mohan said Apple&#39;s iPhone sales, buybacks and dividends will be the three key elements of this week&#39;s report.\n\nMohan is projecting fiscal second-quarter iPhone unit sales of 56 million, slightly below consensus analyst estimates of 57 million.\n\nIn addition, he expects Apple to authorize a new buyback program of at least $70 billion and raise its 0.5% dividend by 5%.\n\nApple Q2 Earnings: 3 Things  Investors Should Watch For\nhttps://news-static.webullfintech.com/us/news-html/20220424/50310849.html?theme=1&amp;hl=en&amp;color=2&amp;_v=1&amp;tickerId=913256135&amp;disSymbol=AAPL&amp;sp=0&amp;hl=en", "time": 1650831330.0, "sentiment": "Bullish"}, {"id": 454370210, "text": "$AAPL NEW ARTICLE : 3 Best Buffett Stocks to Buy for the Long Haul https://www.stck.pro/news/AAPL/26675659", "time": 1650831074.0, "sentiment": ""}, {"id": 454369962, "text": "Apple $AAPL, $AMZN Amazon, $MSFT Microsoft headline busy earnings week ahead https://www.billionaireclubcollc.com/apple-amazon-microsoft-headline-busy-earnings-week-ahead/", "time": 1650830889.0, "sentiment": ""}, {"id": 454369934, "text": "$AAPL AAPL 2022-04-24 Chart Analysis Video: \nhttps://www.youtube.com/watch?v=Ef3Usb8Nrm8", "time": 1650830870.0, "sentiment": ""}, {"id": 454369873, "text": "$AAPL \n\nApple earnings preview: Analysts have been incrementally positive on Apple (AAPL) over the last few weeks based off strong iPhone 13 and Mac trends, although there is still plenty of caution over what execs will report about China and the supply chain. Apple is expected to provide its annual capital return update during the earnings call, which could include an incrementally positive capital return update. Morgan Stanley recommends that investors buy AAPL off any earnings weakness with product launches set for later in the year. A wildcard with the Apple earnings call is the Apple Car. A recent patent filing from Apple claimed protection for a &quot;vehicle that has a plurality of cameras, a network interface, a memory, and one or more computer processors.&quot; Apple&#39;s direction with autonomous electric vehicle production is still unclear, with speculation on potential manufacturing partners including from Porsche", "time": 1650830836.0, "sentiment": "Bullish"}, {"id": 454369653, "text": "$SPY ....Chart Update....  Next correlated support is roughly $4,225 🍀  I have talked to people that think SPY could see $350 by the end of the summer and that is quite possible. Hopefully between now and then it is actually tradable because this straight line up straight line down garbage pump and dump is getting to be a bit much... The fact this market trades like a penny stock is gross $TSLA $AAPL $ARKK $UVXY 🍀", "time": 1650830679.0, "sentiment": ""}, {"id": 454369617, "text": "$AAPL \n\n1)Projected dividend increases: A heavy slate of earnings means that more dividend payout increases could be on the way. Apple (OTC:APPL) is one of the more interesting companies that could reward shareholders with a dividend rate boost to $0.24 from $0.22 forecast.\n\n2)Earnings spotlight: Thursday, April 28 - Twitter (TWTR), Comcast (CMCSA), Merck (MRK), Caterpillar (CAT), Northrop Grumman (NOC), Amazon (NASDAQ:AMZN), Apple (AAPL), Intel (INTC), Altria (MO), Domino&#39;s Pizza (NYSE:DPZ) and PayPal (PYPL).", "time": 1650830652.0, "sentiment": "Bullish"}]