[{"id": 454423561, "text": "$AAPL my calls are going to get roasted tomorrow this market sucks :(", "time": 1650868522.0, "sentiment": ""}, {"id": 454423494, "text": "$SPY gap down to 4220 overnight on futes then melt up to slightly green/ to flat open to burn Theta. Then burn the shorts with grind up to 430 on dreams that $AAPL and $$AMZN save the market. They smash earnings but guidance lackluster. Fake breakout to 432 to trap bulls then sell off to 414-410 awaiting Fed meeting May 3-4. Scalpers market", "time": 1650868481.0, "sentiment": ""}, {"id": 454423377, "text": "$LCID  interesting rumor circulating around Asian mkts over the weekend. And it actually makes a lot of sense. Because of $AAPL problems with project titan and Because of $LCID low stock price and very limited amount - less that 33% - of tradable stock, that $AAPL is considering a tender offer for  $LCID in order to gain access to its motor miniaturization tech, drivetrain tech, &amp; great tech staff.  Will take private and co-venture with SA PIF as partner to develop the EV of everyone’s dreams.  Then IPO again down the road to cash out.  Actually makes a huge amount of sense. Entry price is super cheap because PIF has 64% ownership and easy to happen because it has voting control of the Board.", "time": 1650868418.0, "sentiment": ""}, {"id": 454423078, "text": "$SPY no monster drop is happening this week lol $AAPL and $AMZN esrnings will be interesting . also snort $DPZ", "time": 1650868262.0, "sentiment": ""}, {"id": 454422750, "text": "$AAPL $AMZN $GOOG word is they will beat so you bet I am thinking $TQQQ lookin good", "time": 1650868093.0, "sentiment": "Bullish"}, {"id": 454422732, "text": "$AAPL  Very interesting price action on the daily chart here. ⭐", "time": 1650868082.0, "sentiment": ""}, {"id": 454422286, "text": "$AAPL option prices will be volatile so keep your head up. I remember one earnings the stock went up 5% and my call plummeted the following day at the open. Other times I bought an option at a decent price and still profited when the stock went in the wrong direction. When you’re playing options on earnings week, it’s all max greed. There’s no rhyme or reason to it! Best wishes! ✌🏻", "time": 1650867833.0, "sentiment": ""}, {"id": 454422041, "text": "$AAPL doesn’t even need a caption..", "time": 1650867691.0, "sentiment": "Bearish"}, {"id": 454421772, "text": "$AAPL $VENAR The market made me sick all over", "time": 1650867538.0, "sentiment": ""}, {"id": 454421146, "text": "$QQQ $AAPL QQQ / SP500 /  DOW all crashing at same pace, looks like Feds unloading their propped up assets.", "time": 1650867205.0, "sentiment": ""}, {"id": 454420673, "text": "$NNDM  just beautiful $AAPL supplier foxconn suspends production inChina, ey aaple its time you bring mfg on shore and jump with nano dimensions to get this 3d printers for mfg electronics moving.  Supply chain is dying and we need 3d printers to bring our supply chain back.  3d printing should be massively booming but totally opposite due to mkt manipulations and algos.  $spy $ARKK", "time": 1650866948.0, "sentiment": "Bullish"}, {"id": 454420251, "text": "$AAPL Er is 4/28 AH this week! \nHuge contributor to the markets! \nLevels to be on the lookout here as the past 3 weeks have been slipping! \nhttps://share.trendspider.com/chart/AAPL/11367e0ogew", "time": 1650866744.0, "sentiment": ""}, {"id": 454420094, "text": "$SPY Bears going to feast on $AAPL tomorrow.", "time": 1650866670.0, "sentiment": ""}, {"id": 454420052, "text": "$AAPL was analyzed by 52 analysts. The buy consensus is at 84%. So analysts seem to be very confident about $AAPL. https://www.chartmill.com/stock/quote/AAPL/analyst-ratings?utm_source=stocktwits&amp;utm_medium=ANALYST&amp;utm_content=AAPL&amp;utm_campaign=social_tracking", "time": 1650866640.0, "sentiment": ""}, {"id": 454419929, "text": "$BTC.X WHAT&#39;S UP WITH THAT 📉🤣 $TSLA $AAPL $NFLX $SPY", "time": 1650866579.0, "sentiment": "Bearish"}, {"id": 454419565, "text": "$AAPL $TSLA $SPY  chilling with my puts from Friday like", "time": 1650866388.0, "sentiment": "Bearish"}, {"id": 454419224, "text": "$AAPL Futes looking horrible", "time": 1650866202.0, "sentiment": "Bearish"}, {"id": 454418887, "text": "$AAPL   What’s going to happen tomorrow? Fed comes out and speaks, we go down. Biden comes out and mumbles we go down farther. Between those two they have the markets all screwed up.", "time": 1650866032.0, "sentiment": ""}, {"id": 454418738, "text": "$NFLX  \nPermabulls really need to go broke to learn simple things, thinking that because it dropped so much recently so it won&#39;t drop further is just what&#39;s gonna take all your money. And I dont see how this is a bullish when earning actually screams a warning sign. \n \n$SPY $AAPL $FB", "time": 1650865956.0, "sentiment": ""}, {"id": 454418515, "text": "$AAPL Going to hit $210", "time": 1650865835.0, "sentiment": "Bullish"}, {"id": 454418510, "text": "What are you watching? 📲\n$MULN $TSLA $AAPL $MSFT  $TWTR\n\nFollow my twitter for more👇", "time": 1650865834.0, "sentiment": "Bullish"}, {"id": 454418227, "text": "$AAPL don’t be surprised if we see an upgrade tomorrow or Tuesday! It’s never what it seems. That’s the greatest lesson you will ever learn!", "time": 1650865698.0, "sentiment": ""}, {"id": 454417871, "text": "$AAPL Bloomberg just said Foxconn is staying open even tho the city is primarily locked down…. $SPY", "time": 1650865514.0, "sentiment": ""}, {"id": 454417562, "text": "WE ARE NOW LIVE🔥 \n🚨GAINZ STREAM🚨 \nGOING OVER   \n📈TRADE IDEAS  \n🔫TRIGGERS  \n🎯TARGETS  \nAND EVERYTHING YOU NEED FOR THIS UPCOMING WEEK  \n🤯FOR FREE 💯 \nCLICK👉 https://us02web.zoom.us/j/86852141849?pwd=NWI0TitYL1R2dWlRRHh0bENDRm9UZz09 $SPY  $AAPL $AMC", "time": 1650865361.0, "sentiment": ""}, {"id": 454417514, "text": "$AAPL I’m still long! Apple to 165", "time": 1650865337.0, "sentiment": "Bullish"}, {"id": 454417497, "text": "$AAPL $AMC $SPY $QQQ for the remainder of this year we will see futures go from red to green and Vice versa on the daily. The big boys want to maximize on the volatility. Hence, they will want to maximize on options during normal trading hours. Premium prices will not truly coincide with the stock price given there will exist max greed! A lot of opportunities to profit!", "time": 1650865326.0, "sentiment": ""}, {"id": 454417472, "text": "$AAPL Smells like big stock buyback tomorrow", "time": 1650865312.0, "sentiment": ""}, {"id": 454416891, "text": "$AAPL it is the best company in the Market period..however not buying shares until $150..we need to learn about discipline", "time": 1650865021.0, "sentiment": ""}, {"id": 454416587, "text": "$AAPL FUTURES TOOK A leg lower when the FOXCONN news dropped on Apple Inc factories suspending production in 2 locations for iPhones... 🥒📉 There goes TECH for Tomorrow! $nflx $tsla $fb $spy  \n \n \nRUN BULLS RUN!!", "time": 1650864879.0, "sentiment": "Bearish"}, {"id": 454416457, "text": "$AAPL I’ll leave you with this. The Foxconn news is old news. They shut down those two locations on Wednesday. If I’m not mistaken, last time Foxconn shutdown the stock jumped the next day. You have to be very careful about the news and how it pertains to the stock price.", "time": 1650864813.0, "sentiment": ""}]