[{"id": 454689361, "text": "$AAPL  crash &amp; burn baby!!! Biden’s China is on the verge of a market collapse and most proudly communist built Apple product factories are on full lockdown 😬😬😬\n\nWoot woot…Q1 may be ok but buy your puts baby!! NFA! 😘", "time": 1650948026.0, "sentiment": ""}, {"id": 454689233, "text": "$AAPL Let’s do the math!!\n\nIn 2021 when the market was experiencing a massive bull run AAPL reported Q2 numbers of the following.\n\niPhone: 48 (up65%)\nMac: 9.1 (up70%)\niPad 7.8 (up79%)\nWearable: 7.9 (up24%)\nServices: 17 (up26%)\nTotal : 89.6B  (up50%)\n\nJPMorgan today predicted\niPhone : 45B (down 5%). They didn’t elaborate much on others but said total revenue growth will be moderate to flat.\nHere’s my problem. At the time of their Q2 2021 earnings  AAPL was trading around $135 and trended down. We are talking 16% lower than todays value all during massive growth and a bull market.\n\nHow can we expect AAPL to continue trading at current values when growth (revenue) is slowing and maybe even decreasing. \n\nBulls explain how you expect all time highs when just 12 months ago the market valued AAPL at 130ish with more revenue and explosive growth. \n\nI’m sorry I don’t see it. AAPL is headed much lower. Of course, this assumes JPMorgan is correct.\n\nI’ll bet they are and maybe too generous.", "time": 1650947984.0, "sentiment": "Bearish"}, {"id": 454688905, "text": "$UVXY $SPY $AAPL $MSFT waiting for those ERs be like. VIX is all ready to jump again!", "time": 1650947870.0, "sentiment": ""}, {"id": 454688469, "text": "$AAPL  Look! I got this 76% Profitability across 13 trades in 1 month. Profit Factor of 3 and rating is Bullish.  I will wait for Buy signal", "time": 1650947708.0, "sentiment": ""}, {"id": 454688323, "text": "$UVXY $SPY $TSLA $AAPL $TWTR", "time": 1650947657.0, "sentiment": ""}, {"id": 454688262, "text": "$AAPL Sooooo", "time": 1650947638.0, "sentiment": "Bullish"}, {"id": 454687985, "text": "$AAPL  5x your money with my call outs $TSLA $MSFT $UUUU $FB 🙏😇👍💯🚀☀️ https://youtu.be/n7ovzGgjBus", "time": 1650947539.0, "sentiment": "Bullish"}, {"id": 454687061, "text": "$AAPL $MSFT $SPY $QQQ the red to green move says it all. Tech rally to make up for losses, then profit taking next week!", "time": 1650947225.0, "sentiment": ""}, {"id": 454686208, "text": "$spy Again the bigger take away from the $twtr sale is that we have reached the Zenith of this wave, time is moving on &amp; if $twtr &amp; $fb are slowing like nflx then things like $dwac have no chance even if it wasn&#39;t a scam. \n \nSome of use grew up w/ Vinyl &amp; cassettes then CD&#39;s came &amp; all the old heads laughed &amp; said it would fail, when $aapl  iTunes first came all the big artist at the time like AC/DC, the Beatles &amp; said they would never put their music on a streaming platform \n \nNow spot roku nflx &amp; other are the old guard &amp; we will move on from them. No generation wants to think they&#39;re growing out of fashion but with Tech its inevitable, Just ask Gordan", "time": 1650946926.0, "sentiment": ""}, {"id": 454686072, "text": "$AAPL $MSFT Microsoft does well tomorrow and we’re at $170 minimum before earnings!", "time": 1650946876.0, "sentiment": ""}, {"id": 454685911, "text": "$SPY $AAPL $AMZN $FB $TWTR i hope he brings TRUMP back.", "time": 1650946818.0, "sentiment": ""}, {"id": 454685135, "text": "$SPY $aapl will hit $140 this week I think, yea I really do", "time": 1650946535.0, "sentiment": ""}, {"id": 454684719, "text": "@jg4793 @BankofEngland \nGuess you forgot what happen last Sept 25? I’m bullish on $AAPL but never assume.", "time": 1650946398.0, "sentiment": ""}, {"id": 454684670, "text": "$AAPL Harmonic Swings Chart", "time": 1650946380.0, "sentiment": ""}, {"id": 454684667, "text": "$AAPL $MSFT $GOOG load up earnings will be just fine", "time": 1650946380.0, "sentiment": "Bullish"}, {"id": 454684361, "text": "$SPY priced in 8 hikes, jpow would be irresponsible to hike after huge falls in the stock market. It is best for him to wait and see before doing back to back hikes. Prices are not that bad \n\n$AAPL $IWM $QQQ $AMZN", "time": 1650946280.0, "sentiment": ""}, {"id": 454684052, "text": "$SPY why is every fomc meeting important... we&#39;ve priced in 8 rates hikes. and this point all we will see is upside when jpow doesn&#39;t hike because he doesn&#39;t need to. in all honesty hiking more after the drops we&#39;ve already seen would be Irresponsible 🧮\n\n$AAPL $NFLX $IWM $QQQ", "time": 1650946175.0, "sentiment": ""}, {"id": 454682946, "text": "$AAPL Up, Down or Sideways, it’s ALWAYS a good time to BUY AAPL🍏💰", "time": 1650945770.0, "sentiment": ""}, {"id": 454681633, "text": "$AAPL - JPMorgan slashing iPhone revenue. Add to this what we already knew which was iPhone SE, 12, 13 Mini sales were terrible, plus iPad supplier had issues in China on top of all the horrible economic data like very poor Consumer Sentiment. Apple&#39;s earnings are going to take a hit this year. Maaaaybe not this time, but we will definitely see Q2 of the economic downturn affect this big tech names. They got away with the bubble rally thanks to QE inflating their stock name. Plus with stimulus, people went buying useless landfill iPhones vs paying rent or bills. Those days are over. Now comes the reality check", "time": 1650945352.0, "sentiment": "Bearish"}, {"id": 454681451, "text": "$AAPL $DIS $TWTR The secret sauce system\nwe teach KILLS IT... our Secret Sauce Live\nTrading sessions PRINT MONEY!\nOur Free month trial to our platform is\nguaranteed to make you a better trader!!!\n\nhttps://youtu.be/aWZe_EHS-AY", "time": 1650945294.0, "sentiment": ""}, {"id": 454681414, "text": "Sweep Options Activity: $AAPL is the #2 ticker with sweep activity where institutions are trading options urgently with 63.4K sweep contracts, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (Link in profile - @InsiderFinance)", "time": 1650945280.0, "sentiment": ""}, {"id": 454680264, "text": "$SPY $QQQ $AAPL $IWM - JPMorgan is slashing iPhone revenue forecasts. MorganStanley see&#39;s a bear market. Goldman is also seeing market trouble ahead. Be smart, 2 steps ahead. Markets will take a big haircut here soon.", "time": 1650944895.0, "sentiment": "Bearish"}, {"id": 454679341, "text": "$AAPL pre earnings run up. Easy money 💰", "time": 1650944589.0, "sentiment": "Bullish"}, {"id": 454679251, "text": "$AAPL $165 open?", "time": 1650944553.0, "sentiment": "Bullish"}, {"id": 454677996, "text": "$AAPL i said earlier green close glad it exceeded my guess", "time": 1650944160.0, "sentiment": "Bullish"}, {"id": 454676641, "text": "$SPY $TSLA $TWTR $AAPL $MSFT", "time": 1650943744.0, "sentiment": "Bullish"}, {"id": 454675285, "text": "$AAPL https://youtu.be/WfvkzZVV9cw", "time": 1650943330.0, "sentiment": ""}, {"id": 454675076, "text": "$AAPL View @ www.elliottwave-forecast.com along with other tech, is favoured to be moving lower.  However, it will not go in a straight line.  There will be counter trend bounces along the way.  The next leg lower is underway, 4H timeframes, we don’t like to sell it, but in shorter timeframes ,bounces should find resistance in 3, 7 or 11 swing while below the 171.53 peak.    #Elliottwave #Trading #stocks", "time": 1650943262.0, "sentiment": ""}, {"id": 454674775, "text": "@bams1017 like @Traidn said these are unsual times where anything can happen, but looking at the track record of $AAPL  it is looking like the only green barret with constant quarter earnings in tech market, we also not to forget that the subscribers loss of Netflix is a definate gain for it&#39;s competitors", "time": 1650943163.0, "sentiment": ""}, {"id": 454674338, "text": "$AAPL Bags to Riches Ep 11 / AMC Squeeze #AAPL Rip MULN FREQ ATER RBLX SPY Rip METX / Stock Market Analysis \n \nhttps://youtu.be/UXfhFMg2m44", "time": 1650943038.0, "sentiment": "Bullish"}]