[{"id": 455005523, "text": "$AAPL Lets go Brandon. We got this. Finish crushing working class America.", "time": 1651034582.0, "sentiment": ""}, {"id": 455004565, "text": "$SPY SEC &amp; FCC NEEDS TO TAKE CNBC OFF THE AIR ! $AAPL $MSFT", "time": 1651034263.0, "sentiment": ""}, {"id": 455004537, "text": "Think $AAPL ER will save the market?  Maybe but I wouldn&#39;t bet on it.  Risk is to the downside.  This is what capitulation looks like.  $SPY $QQQ", "time": 1651034253.0, "sentiment": ""}, {"id": 455004497, "text": "$AAPL holy hell Lol 😆", "time": 1651034238.0, "sentiment": "Bullish"}, {"id": 455004428, "text": "$SPY AM close 417.13 is most imp number. It s direct move to 424. \n$AAPL is running behind index . Should make big jump in am and coming days.", "time": 1651034215.0, "sentiment": "Bullish"}, {"id": 455004300, "text": "$AAPL $162-163 tomorrow! 👍", "time": 1651034177.0, "sentiment": ""}, {"id": 455003798, "text": "$AAPL LEAPS!!!!!", "time": 1651034025.0, "sentiment": "Bullish"}, {"id": 455003736, "text": "$GOOG $AAPL $MSFT  \n \nRussian Population: 144 million \nIndian Population: 1.4 billion \nChinese Population: 1.4 billion \nIranian Population: 89 million \nBelarusian Population: 9 million \n \nGoogle and Apple Pay halted in Russia. Russia already switching everything over to Harmony OS. Apple and Google&#39;s market share has now decreased by potentially 3 billion people. Let that sink in for Q2.", "time": 1651034005.0, "sentiment": "Bearish"}, {"id": 455003360, "text": "$AAPL   I doubt this could retrace back to 2018-2019 levels but then again, if we enter a recession and they only make 50B vs the 100B they made in 2021, they’d be a 1B company at 20x which is a SP in the 60s.", "time": 1651033894.0, "sentiment": "Bearish"}, {"id": 455002403, "text": "$AAPL   Thanks Brandon", "time": 1651033608.0, "sentiment": "Bearish"}, {"id": 455002385, "text": " @retailInvester9999 Speaking of the future vision, owning these media assets situates the company perfectly to more deeply benefit from all things remote, like gaming, VR, and education (think Science Channel, The Dodo, HGTV, Food Network etc).   \n \nIn order to hit big multiples, you have to see things before they happen and take the risk. I was 1-2 years ahead on $TSLA in 2018 and $TWTR in 2020, a few ahead on $AAPL in 2013. I took huge positions relative to my portfolio size and they made my portfolio today. What I see here is a hidden gem that’s just been discovered (pun..). A legacy that is a century old that’s finally found its proper place with this new management team and foundational infrastructure. It’s a company that could be around in another 100 years, and those are the ones that unlock real value. They’ve grown through acquisitions to date, but DTC will provide future growth. Media shapes reality. Content is king and $WBD has the goods.", "time": 1651033602.0, "sentiment": "Bullish"}, {"id": 455002312, "text": "$MSFT $TSLA $SPY $AAPL  \n \nPre-COVID levels are the name of the game. Everyone enjoyed that nice little Fed boost for the past year and a half they forgot the most important rule.", "time": 1651033580.0, "sentiment": "Bearish"}, {"id": 455002164, "text": "@retailInvester9999 This is a solid analysis of the base business but it’s the downside case imo.  \n \nBut the upside here is tremendous. Management does not do a good job hyping that vision. The new company owns the  factory” as Zaslav said on the call. There are NO better media assets under one roof in the market when looking at the whole package as far as margins, reach, diversification, depth, and quality. They are sitting on a goldmine while also owning the golden geese. With a consolidated product, in the near term it will become the go-to gold standard of streaming  (which is a profitable scalable business, hence why $AAPL and $AMZN got in. $AAPL project ROI is insane. They don’t waste money. All that said, $AAPL will never be able to replicate Warner/HBO production magic or Discovery’s savviness, industry relationships, and unscripted offerings. And $AMZN bought MGM but $WBD still owns all MGM assets pre 1986).", "time": 1651033533.0, "sentiment": "Bullish"}, {"id": 455001975, "text": "$MSFT  $AAPL $TSLA $NVDA $SPY \nBring him back. He&#39;s better CEO 🤭", "time": 1651033480.0, "sentiment": "Bearish"}, {"id": 455001121, "text": "$SPY DEAR CRAMER  $AAPL $MSFT", "time": 1651033230.0, "sentiment": ""}, {"id": 455000515, "text": "$SPY $AAPL $XOM $AMZN $QQQ 👇🖕", "time": 1651033044.0, "sentiment": ""}, {"id": 455000499, "text": "$AAPL along with other tech, is favoured to be moving lower.  However, it will not go in a straight line.  There will be counter trend bounces along the way.  The next leg lower is underway, 4H timeframes, we don’t like to sell it, but in shorter timeframes ,bounces should find resistance in 3, 7 or 11 swing.    #Elliottwave #Trading #stocks", "time": 1651033037.0, "sentiment": ""}, {"id": 455000268, "text": "$SPY $AAPL way oversold. As per my chart we should bounce in next 36hr. 425 to 430 play.", "time": 1651032963.0, "sentiment": "Bullish"}, {"id": 455000256, "text": "$AAPL was analyzed by 52 analysts. The buy consensus is at 84%. So analysts seem to be very confident about $AAPL. https://www.chartmill.com/stock/analyzer/stock/AAPL?view=analyst-ratings&amp;utm_source=stocktwits&amp;utm_medium=ANALYST&amp;utm_content=AAPL&amp;utm_campaign=social_tracking", "time": 1651032960.0, "sentiment": ""}, {"id": 455000147, "text": "$AAPL $TSLA $NVDA $MSFT $amzn\nOuch Bulls&#39;", "time": 1651032922.0, "sentiment": "Bearish"}, {"id": 454999974, "text": "$SPY Biden is not baked in ! $MSFT $AAPL 🖕🏻🇺🇦📉📉📉📉", "time": 1651032868.0, "sentiment": ""}, {"id": 454999682, "text": "$AAPL gonna exclusively trade this soon", "time": 1651032766.0, "sentiment": ""}, {"id": 454998607, "text": "$SPY you bulls need to get tested for HIV $MSFT $AAPL", "time": 1651032436.0, "sentiment": ""}, {"id": 454998043, "text": "$SPY i expect heavy buy back announcements from both $AMZN and $AAPL no surer sign of failure than stock buy backs as the closing bullish thesis.", "time": 1651032273.0, "sentiment": ""}, {"id": 454998021, "text": "$SPY Your can tell Bulls got caught OFF GUARD today (AGAIN) - A gullible bunch of &quot;BELIEVERS&quot; 🛐 for cheap money thrills of the fed etc... Well they&#39;re realizing this is not the church of Bull Market but rather the dungeon of lost CALLS! 🚮😆... So much Red in their accounts right now and they&#39;re trying hard not to cry or take a leave of absence from STONKTWITS!  $Aapl $googl $tsla $qqq  \n \n \nFUTURES is no more than an RSI reset for tomorrow. Algos trying to save the market with Microsoft as if the data changed from when they 1st released their ER To 6pm LMAO FRAUDS", "time": 1651032265.0, "sentiment": "Bearish"}, {"id": 454997791, "text": "$AAPL NEW ARTICLE : Breaking down the Big Tech earnings https://www.stck.pro/news/AAPL/26816244", "time": 1651032195.0, "sentiment": ""}, {"id": 454997661, "text": "$AAPL Bags to Riches Ep 12 / ATER #AAPL Dead NFLX CEI INDO MULN FREQ AAL Stock / Stock Market Analysis \n \nhttps://youtu.be/073EBVCVV3k", "time": 1651032155.0, "sentiment": "Bullish"}, {"id": 454997286, "text": "$SPY $AAPL $MSFT $GOOGL $NVDA \nBulls. Fed didn&#39;t even hike the rate and tightened QE yet😅", "time": 1651032046.0, "sentiment": "Bearish"}, {"id": 454996971, "text": "$MSFT This is why you don’t play it bet against Microsoft. One day bears will learn. It’s hard to bet against them or $AAPL Fapple.", "time": 1651031949.0, "sentiment": ""}, {"id": 454996370, "text": "$AAPL reportedly slowing hirings for Genius team at some retail outlets", "time": 1651031783.0, "sentiment": ""}]