[{"id": 455029247, "text": "$UVXY Wait till $AAPL declare stock buybacks with all their 2022 profits .. It&#39;s a big club and you ain&#39;t in it. Ponzi scheme", "time": 1651042961.0, "sentiment": ""}, {"id": 455028997, "text": "$AAPL Robinhood cuts 9% of their taff, recession coming", "time": 1651042863.0, "sentiment": "Bearish"}, {"id": 455028709, "text": "$AAPL 138 Thursday ah.", "time": 1651042759.0, "sentiment": ""}, {"id": 455028608, "text": "@Amicktd AirPods bigger than AirBnB.  $AAPL is rock solid.  Huge buyback.", "time": 1651042718.0, "sentiment": "Bullish"}, {"id": 455028559, "text": "$AAPL Time to go up. See you at 170s.", "time": 1651042698.0, "sentiment": ""}, {"id": 455028401, "text": "$SPY $AAPL $ETH.X Running out of time to bid on this incredible piece of Stocktwits history!!   Start up a $COIN account the get that wallet connected to opensea folks \n\nhttps://opensea.io/assets/0x495f947276749ce646f68ac8c248420045cb7b5e/50432377729489990583135998967267613578026955105968266199455881864025378652161/", "time": 1651042637.0, "sentiment": ""}, {"id": 455028317, "text": "@deltax10 a buyback dream. MSFT ER strong, AMZN web services are soaring, $AAPL announcing 80B+ buyback.  Y&#39;all don&#39;t fall for the head fakes.", "time": 1651042607.0, "sentiment": "Bullish"}, {"id": 455027688, "text": "$AAPL BOOOOOOOOOM \n \nhttps://ca.investing.com/news/stock-market-news/apple-could-announce-a-new-8090-billion-stock-buyback-plan-and-raise-dividend-by-510--citi-432SI-2669195", "time": 1651042352.0, "sentiment": "Bullish"}, {"id": 455027501, "text": "$SPY $qqq $nasdaq $AAPL either this a fake up or real up we will know tomorrow \n \nSeen this yesterday and this morning turn red and even worse by the hours until it closed!!!", "time": 1651042281.0, "sentiment": ""}, {"id": 455027477, "text": "@Amicktd dude... $AAPL safer than the USD...not printing anymore Apple shares...the buybacks just keep rolling in every year... \n \nhttps://9to5mac.com/2022/04/12/90-billion-stock-buyback-aapl/", "time": 1651042272.0, "sentiment": "Bullish"}, {"id": 455027309, "text": "$SPY $AAPL There was a rejection of the thicker part of the Ichimoku cloud near 168, might have a second attempt to break through, there’s a nice Doji in the 4 hour timeframe 🖖🏽", "time": 1651042205.0, "sentiment": "Bullish"}, {"id": 455027185, "text": "$AAPL will slowly bleed to 115", "time": 1651042157.0, "sentiment": "Bearish"}, {"id": 455027156, "text": "$AAPL so, content streaming, online purchases, online ads, computer and phone usage at ATH in China this quarter...got it.", "time": 1651042148.0, "sentiment": "Bullish"}, {"id": 455027078, "text": "$SPY $QQQ $IWM $TLT $AAPL the great deflation was actually impoverishing millennials through robinhood😂 well done Jerome Powell, we’ve gotten rid of those dollars. Now charge them an arm and a leg for food and lets depopulate the idiots.", "time": 1651042114.0, "sentiment": ""}, {"id": 455026858, "text": "$AAPL Want to know the problem with Apple?  As a person that has a household full of their devices, works in the tech industry, and deals with Apple on a daily basis personally and professionally.  Their support and interaction with the public has went to shit.  It also seems they rushed out their new M1 processors.  On top of that they rush out all these new operating systems.  Just give us something reliable and not bugging out already…sorry rant over!", "time": 1651042024.0, "sentiment": ""}, {"id": 455026746, "text": "$AAPL $TSLA $MSFT $AMZN $SPY \nAn estimated 373 million people — or about one-quarter of China’s population — have been in covid-related lockdowns in recent weeks\n\n“Everything is halted. There are closures this very minute that are adding to the supply-chain nightmare we’ve been experiencing for two years.”\n\nThousands of air fryers are stuck in factories, warehouses and ports in central China, where shutdowns have stalled millions of dollars’ worth of inventory \nhttps://www.washingtonpost.com/business/2022/04/26/shanghai-lockdown-supply-chain-cars-electronics/", "time": 1651041988.0, "sentiment": "Bearish"}, {"id": 455026594, "text": "$AAPL $MSFT $GOOG load the hell upppp this is the last week of the downtrend!!", "time": 1651041927.0, "sentiment": "Bullish"}, {"id": 455026362, "text": "$AAPL The direction here is obviously going to be dependent on how earnings go later this week. Major support levels to watch are $150-$153 and then $144-$147. Given these current market conditions and where $SPY is, I think maximum upside for solid, A+ earnings is $163-$171. I think it’s more likely we’ll see a fade towards at least $150-$153 and possibly lower than to see high $160s or $170s again. It’s been pretty much range bound $150-$183 all year and sooner or later something will give, most likely on the bears will prevail here. At the end of the day, they’ll be a great opportunity to buy for the low which is something all long term investors should be happy about. Drop a follow if your interested in more solid plays, I spend a ton of time in the market!", "time": 1651041846.0, "sentiment": ""}, {"id": 455026346, "text": "$AAPL 🎯\n\nDoes the channel hold?\n…I’m not optimistic.", "time": 1651041840.0, "sentiment": ""}, {"id": 455026324, "text": "$GOOG $AAPL $AMZN $SPY only thing that can save the bull market now is a full reconciliation with Russia and mia culpa by NATO in regards to Ukraine expansion.", "time": 1651041832.0, "sentiment": "Bearish"}, {"id": 455026211, "text": "$SPY $AAPL apple ER will be same as Microsoft . Market will sideway , then Amazon will flush the market on Monday make it ready for feds reduce balance sheet", "time": 1651041787.0, "sentiment": "Bearish"}, {"id": 455026198, "text": "$FB $AAPL $GOOG vix futures took a massive dump after FAANG lost a combined 500 billion market cap in after hours?", "time": 1651041782.0, "sentiment": "Bullish"}, {"id": 455024597, "text": "$AAPL 190 easy by Thursday after market.  Note it down 190 is our golden number", "time": 1651041197.0, "sentiment": ""}, {"id": 455024578, "text": "$AAPL Apr 26               \nNeutral               \n◆ Search for 10 day stock forecast by pretiming A.I               \nhttp://www.google.com/search?q=10+day+stock+forecast               \n◆ Forecast of Upper~Lower price range band for the next 10 days               \nPrice: 153.60   ~ 158.59            \n% Change: -2.04%  ~ 1.14%           \nThe Buy-Sell strength has changed from a weak selling flow to a suddenly strengthening selling flow and it&#39;s in the midst of a downward trend of strong downward momentum price flow marked by temporary rises and strong falls in the falling section.", "time": 1651041189.0, "sentiment": ""}, {"id": 455024286, "text": "$AAPL not so good.\n$BIMI is a golden goose!!", "time": 1651041071.0, "sentiment": "Bullish"}, {"id": 455023987, "text": "$GOOG $AMZN $SPY $AAPL I&#39;m predicting 2-5 year recession with 1 year of stagfation. Peak of V shaped recovery was end of Q4 2021. Reality of Biden Administration is settling in. Now bearish on every sector except energy. Housing crash will hit in 2023.", "time": 1651040960.0, "sentiment": "Bearish"}, {"id": 455023560, "text": "@LubeTT exactly why it will go up from here.  I see Nasdaq back to 14,000, $AAPL 177+", "time": 1651040800.0, "sentiment": "Bullish"}, {"id": 455023387, "text": "$WIMI  $AAPL Remember guys, there will be a sell-off but no matter what after having the wind in our sails for a while now we have steam in our engine and the rocket ship is being fueled as we take the train to the launchpad. BUY HOLD AND BUCKLE UPPPPPPP. Lol", "time": 1651040745.0, "sentiment": ""}, {"id": 455022638, "text": "@LubeTT thankfully just watching.  Do think $AAPL and $AMZN will have rock star Earnings.", "time": 1651040479.0, "sentiment": "Bullish"}, {"id": 455022211, "text": "@BearCole @Yaneth @biostock  I won&quot;t buy in $AMZN $AAPL $FB  for earnings just I got $MSFT.", "time": 1651040322.0, "sentiment": ""}]