[{"id": 452469610, "text": "$AAPL I think it’s safe to assume my $170 calls for next week are screwed 🤦‍♂️", "time": 1649998161.0, "sentiment": ""}, {"id": 452469549, "text": "$AAPL guvment, fed, insiders  selling", "time": 1649998132.0, "sentiment": ""}, {"id": 452469341, "text": "$SPY .....PUNKED.....🤦‍♂️ Yesterday this moved roughly 1.25% on the worst inflation news that has ever come out..... While it was making that ridiculous move do you see what happened with BIG MONEY....They ran for the hills.... On some comparatively massive outflow...$UVXY $TSLA $AAPL $ARKK 🤦‍♂️", "time": 1649998040.0, "sentiment": ""}, {"id": 452469079, "text": "gather round and watch me lose all my mula on $aapl puts (eventually)     https://youtu.be/M8N5nvwDcrc    \n$qqq $msft $googl $iwf", "time": 1649997934.0, "sentiment": ""}, {"id": 452467592, "text": "$AABB $SPY $TSLA $AAPL $MSFT", "time": 1649997311.0, "sentiment": ""}, {"id": 452466448, "text": "$AAPL is Foxcon in Shaighai?", "time": 1649996859.0, "sentiment": ""}, {"id": 452466102, "text": "$SPY $TSLA $AAPL $AMD $TWTR \n\nMy thoughts on the stock mkt this week  .... \n\nDon&#39;t fight the Fed. That was the topic of my very first Game Plan of 2022 sent out to members (SEE BELOW). After all, we have been yelled at every single time we have tried to doubt the stock market for over a decade - &quot;Don&#39;t fight the Fed!&quot;. Or, just buy the dip!\n\nAs I pointed out first week of January, the game has changed. Yet, retail investors continue to act as a sponge, absorbing institutional selling on all the rallies  because the institutions understand the new game. Same playbook you and I are staring at, but they are implementing and the retail investor refuses to even pick it up and read it. \n\nMy new Game Plan goes out on Sunday. For those interested in joining,  email me at jessielivermore1929@gmail.com \n\nIn over 25 years of trading, this may be one of the most important qtrs of earnings I&#39;ve been apart of.  What companies can we trust to deliver? I will examine. \n\nEnjoy your weekend ✌️", "time": 1649996710.0, "sentiment": ""}, {"id": 452465830, "text": "$SPY ....Some perspective for y&#39;all.... Also this &quot;crash&quot; or whatever that just happened today....  You all need to check the history of actual corrections on this thing then how long they take how far down they go.....📚It didn&#39;t lose anything it literally just gave back that ridiculous move from yesterday after terrible terrible news... Most vertical 2 year move in history and this is all you&#39;ve given back and you think the market has corrected 😂 $TSLA $AAPL $ARKK $UVXY 🍀", "time": 1649996591.0, "sentiment": ""}, {"id": 452463905, "text": "$AAPL anyone else think we’ll see $120 over the next year?", "time": 1649995812.0, "sentiment": ""}, {"id": 452463375, "text": "$SPY Yeah... go ahead and cancel that idea... $FB $TWTR $AAPL \n\nMARK Zuckerberg’s Meta has revealed that it will take a large amount of the earnings made in its Horizon Worlds metaverse.\n\nA staggering 47.5% of sales made in Horizon Worlds will go to Meta and the rest to the user.\n\nAccording to CNBC, Meta confirmed these plans to take almost a 50% cut from users.\n\nThere’s a 30% hardware platform fee if you’re selling virtual assets through the Meta Quest Store.\n\nThen, there’s a 17.5% fee on top of this for sales made in Horizon Worlds.\n\nSome people are finding the revelation confusing because Meta, formerly Facebook, once criticized Apple for taking a similar 30% cut from creators. \n https://www.the-sun.com/tech/5119541/mark-zuckerberg-metaverse-tax-meta/", "time": 1649995606.0, "sentiment": "Bearish"}, {"id": 452461447, "text": "Sweep Options Activity: $AAPL is the #2 ticker with sweep activity where institutions are trading options urgently with 58.1K sweep contracts, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (link in profile)", "time": 1649994872.0, "sentiment": ""}, {"id": 452461329, "text": "$AAPL Pro Stock Analysis (Options Activity &amp; Technical Update) Under 3 minutes 🤖 for April 14th 2022 \nhttps://youtu.be/qM35GZ_obWo", "time": 1649994821.0, "sentiment": "Bullish"}, {"id": 452461285, "text": "$TSM $FB $AAPL $NFLX For real bulls day to day don&#39;t matter.. I&#39;m just a swing/day trader having fun both ways. Funny reading bull post though 😂", "time": 1649994805.0, "sentiment": ""}, {"id": 452461150, "text": "“My (@mcuban) conclusion, @elonmusk is fucking with the SEC. His filing w/the SEC allows him to say he wants to take a company private for $54.20 😂\nVs his &quot;Am considering taking Tesla private at $420. Funding secured&quot;  Price go up. His shares get sold. Profit⬆️ SEC like WTF just happened.”\n\n$AAPL $AMD 💭 $BTC.x $TWTR $TSLA  https://twitter.com/mcuban/status/1514651819317809159?s=12", "time": 1649994752.0, "sentiment": ""}, {"id": 452459376, "text": "$AABB REMEMBER the company already retired 120M shares for FREE and by the looks of their PR when they previously retired 120M shares exclaiming &#39;&#39;The company plans on retiring more shares in the near future for SHAREHOLDER INIATIVE&#39;&#39; hmmm the 2021 Financials COINCIDENTALLY have 1.49 billion shares additional paid in capital. The company can RETIRE or BUY BACK up to 1.49B shares 85% of the float in 1 day!! With the estimation 3-4 Billion Uncovered &#39;&#39;naked short&#39;&#39; shares with&gt; 5 GOLD MINES&gt; AABBG.X Global Cryptocurrency Exchange 365 24/7 REVENUES&gt;Future NFT&#39;s &amp; Geothermal Volcanic mining in El Salvador. 2021 EPS +300% Do some DD their is ALWAYS the next COIN PYPL GOLD MARA and this one looks to have all those in their pipeline. Happy Holidays GLTA $SPY $TSLA $AAPL $MSFT https://www.otcmarkets.com/otcapi/company/financial-report/324399/content", "time": 1649994069.0, "sentiment": "Bullish"}, {"id": 452455917, "text": "$AAPL I&#39;ll go broke happily if it helps Ukraine. $2.78 trillion dollars transferred to Ukrainian military funding. We all lose our investments. If that would defeat Russia, would you be willing to lose everything? #stoprussia", "time": 1649992839.0, "sentiment": ""}, {"id": 452455886, "text": "$AAPL overreaction China lockdown, 2 weeks to earnings. Apple will reclaim 170-175 zone quickly before earnings.", "time": 1649992829.0, "sentiment": "Bullish"}, {"id": 452455413, "text": "$AAPL was analyzed by 52 analysts. The buy consensus is at 84%. So analysts seem to be very confident about $AAPL. https://www.chartmill.com/stock/analyzer/stock/AAPL?view=analyst-ratings&amp;utm_source=stocktwits&amp;utm_medium=ANALYST&amp;utm_content=AAPL&amp;utm_campaign=social_tracking", "time": 1649992680.0, "sentiment": ""}, {"id": 452453369, "text": "$AAPL  Yeah, it’s going to $25!! 🤣🤣🤣🤣  What the f is wrong with you people?!?!  😂", "time": 1649991993.0, "sentiment": ""}, {"id": 452453129, "text": "@BottomOftheTop $AAPL compared to BitCoin, a digital share of $AAPL stock could be the real metaverse in and of itself game over next level", "time": 1649991916.0, "sentiment": "Bullish"}, {"id": 452452253, "text": "$QQQ $SPY \n\nGuys Chill it reminds me action during 6/18/2021 which was normal the next Monday just hold till Tuesday next week big earnings week $FB $AAPL $AMZN  earnings coming", "time": 1649991628.0, "sentiment": "Bullish"}, {"id": 452451405, "text": "$AAPL I’m the market for calls or puts Monday. Which way y’all going?", "time": 1649991359.0, "sentiment": ""}, {"id": 452450384, "text": "$AAPL Hedge funds desperately need you to sell this.  Don’t", "time": 1649991045.0, "sentiment": "Bullish"}, {"id": 452449975, "text": "$AAPL calls here", "time": 1649990909.0, "sentiment": "Bullish"}, {"id": 452449965, "text": "$AAPL 165 nice buy  n price also nice buy back price for 🍏", "time": 1649990906.0, "sentiment": "Bullish"}, {"id": 452449294, "text": "$AAPL I have 50 bucks ready to buy once this hits $5", "time": 1649990695.0, "sentiment": ""}, {"id": 452449096, "text": "$AAPL", "time": 1649990633.0, "sentiment": ""}, {"id": 452448868, "text": "$AAPL $TSLA $NVDA $AMD $NXPI \nI Haye all shorties. They suck. \nThey are all living in the basement.", "time": 1649990563.0, "sentiment": "Bullish"}, {"id": 452446975, "text": "$AAPL 🍏🔜🔝🆙. PT$210. \n\nApple&#39;s Growth Prospects and Upcoming Dividend Hike. This Apple Is Ripe For Picking. \n\nthe Board would go up one step to $0.24, which represents a 9.1% bump up from the current level.\n\nThe company made $2.10 per share in the quarter -- up 25% from last year -- and paid a $0.22 dividend. Suffice it to say, it is well covered. It is truly quite remarkable that a nearly $3 trillion company can continue to grow this fast.\n*   Apple has been increasing its dividend for nine straight years.\n*   AAPL stock has pulled back after briefly topping a $3 trillion valuation in late 2021.\n*   Even with some headwinds, AAPL looks set to get back above the $3 trillion mark again soon - driven by underlying growth and stock buybacks.\n*   In late April, the dividend is likely to be increased for the tenth straight year by as much as 9%.\n* rumored new products coming up, from Apple Car to Apple VR/AR glasses. \n\nhttps://seekingalpha.com/article/4501331-apple-to-reclaim-3-trillion-as-dividend-will-be-hiked-yet-again", "time": 1649989988.0, "sentiment": "Bullish"}, {"id": 452446294, "text": "$AAPL | Apple ($AAPL) Trading Report (AAPL) https://tinyurl.com/y4dme799", "time": 1649989806.0, "sentiment": ""}]