[{"id": 453960150, "text": "$TGT $AAPL", "time": 1650604988.0, "sentiment": "Bearish"}, {"id": 453959407, "text": "$KMI $AAPL $V $XOM $COST", "time": 1650604740.0, "sentiment": "Bullish"}, {"id": 453958119, "text": "$AAPL 170 tomorrow.  Believe it.", "time": 1650604305.0, "sentiment": "Bullish"}, {"id": 453957609, "text": "$AAPL was analyzed by 52 analysts. The buy consensus is at 84%. So analysts seem to be very confident about $AAPL. https://www.chartmill.com/stock/quote/AAPL/analyst-ratings?utm_source=stocktwits&amp;utm_medium=ANALYST&amp;utm_content=AAPL&amp;utm_campaign=social_tracking", "time": 1650604140.0, "sentiment": ""}, {"id": 453956745, "text": "$SPY $TSLA $AAPL $SNAP $UVXY Lots of bulls in denial tonight", "time": 1650603852.0, "sentiment": "Bearish"}, {"id": 453956644, "text": "$AAPL 160 tomorrow", "time": 1650603829.0, "sentiment": "Bearish"}, {"id": 453954329, "text": "$AAPL what’s a buy range for this?", "time": 1650603122.0, "sentiment": "Bullish"}, {"id": 453953934, "text": "@Samurai0 Facebook was not in a parabolic trend. You think $GOOGL is a parabolic trend. $AAPL $AMZN SBUX DIS all look Parabolic if you don&#39;t use log charts and you look at it from its IPO", "time": 1650603001.0, "sentiment": ""}, {"id": 453952881, "text": "$AAPL $MSFT $GOOG $AMZN yo, simple, everybody fire everybody else =&gt; Feds will retract May rate hike immediately", "time": 1650602681.0, "sentiment": "Bullish"}, {"id": 453951477, "text": "$NVDA $AAPL $AMD $NXPI Can’t   put 6 trillion into the system and not expect this to happen.  Everyone almost lost their mind when it was 750 billion during the financial crisis?  Funny how we are calling it Putin’s inflation now!  And what do we have to show for it?", "time": 1650602259.0, "sentiment": ""}, {"id": 453951339, "text": "@Jay4profit for the love of Moses people, CNBC is not insight, it is not a source of investor outperformance and a fostering of fear and loathing. This is not about Jim Cramer, but any of the nonsensical financial media links you good people choose to post on StockTwits on a daily basis as if it is a guide to future market returns. It is not, the financial media and its participants are not a source of expertise as the precise definition of an expert on CNBC, Bloomberg and the like is &quot;underperformance within reason&quot;. Jim Cramer is simply an example of such expert underperformance as evidenced for decades. Don&#39;t do this to yourselves people, because indeed, it would be one&#39;s own fault. $SPY $QQQ $UVXY $AAPL $DIA (attached results show nearly half the gain of the S&amp;P 500)", "time": 1650602216.0, "sentiment": ""}, {"id": 453949421, "text": "Fresh...&#39;Panic With Friends&#39; podcast with Sonos CEO Patric Spence  \n \nI really enjoyed the conversation  \n \nhttps://howardlindzon.com/patrick-spence-ceo-of-sonos-on-fighting-giants-and-finding-the-sweet-spot-of-hardware-and-software/ \n \non spotify here https://open.spotify.com/episode/1DjbE1if1RTAveOLyU6Pon \n \n \n$sono $aapl $goog $bb", "time": 1650601604.0, "sentiment": ""}, {"id": 453949260, "text": "$AAPL $NFLX $TSLA Education and understanding are a BIG part of success in trading! Make sure you are subscribed and watching our videos as we provide great free content that will help you grow as a trader!\n\nhttps://m.youtube.com/c/OptionsPlayerscom/videos", "time": 1650601556.0, "sentiment": ""}, {"id": 453949163, "text": "$AAPL scale in, then go for the throat.  Some swing contracts running for tomorrow.", "time": 1650601530.0, "sentiment": "Bearish"}, {"id": 453949157, "text": "$NVDA Yes.  This moves with the market but not when it is at the lowest price in the year!  This is a bargain price.  Yes everything fell today - but look at $AAPL and $MSFT and look at $NVDA - $NVDA took the greatest dip ever  - it was way overdone and it will get corrected tomorrow.  The market does not need to be green - it can be neutral or even red and NVDA will shoot  up at open and then maybe then move slowly with the market because people will be buying it as an investment", "time": 1650601526.0, "sentiment": "Bullish"}, {"id": 453949050, "text": "$AAPL $NFLX $QQQ $AMZN $DIS your chart looks like it’s trying to regain the long term uptrend after the pandemic sell off.", "time": 1650601496.0, "sentiment": ""}, {"id": 453948398, "text": "$AAPL We played AAPL puts in our discord on the break of this trendline support for a 250% gain today! We do this all COMPLETELY FREE. Join our discord so you can be a part of it or miss out, link to join is in my bio", "time": 1650601296.0, "sentiment": "Bearish"}, {"id": 453947719, "text": "$AAPL     🍏 Wee early…but:", "time": 1650601066.0, "sentiment": ""}, {"id": 453947647, "text": "$SPY $AAPL Stock Price Predictions / Apple Stock Peaking / Insiders Selling \n \nhttps://youtu.be/lNY5mOolhQw", "time": 1650601042.0, "sentiment": "Bearish"}, {"id": 453946281, "text": "$TSLA $AAPL $TWTR $DIS 🇺🇸 💪🏻\n\nWHY CALL A CONVENTION OF STATES? Simple: to bring power back to the states and the people, where it belongs. Unelected bureaucrats in Washington, D.C. shouldn’t be allowed to make sweeping decisions that impact millions of Americans. But right now, they do. So it all boils down to one question: Who do you think should decide what’s best for you and your family? You, or the feds? We’d vote for the American people every single time.", "time": 1650600602.0, "sentiment": "Bullish"}, {"id": 453945801, "text": "$AAPL $NFLX $QQQ $AMZN $DIS retrace to Feb 15, 2020. Market is selling off.", "time": 1650600445.0, "sentiment": ""}, {"id": 453945637, "text": "$AAPL $168 tomorrow morning run up.", "time": 1650600394.0, "sentiment": "Bullish"}, {"id": 453945508, "text": "$AAPL The Danger of Apple Stock! \n \nhttps://youtu.be/lNY5mOolhQw", "time": 1650600349.0, "sentiment": ""}, {"id": 453944792, "text": "$AAPL $SPY $TSLA   apple took all my money so all I could afford to do is change my\nUser name.", "time": 1650600138.0, "sentiment": ""}, {"id": 453944731, "text": "@stockwillgain why didn’t you tag $AAPL?", "time": 1650600122.0, "sentiment": ""}, {"id": 453943912, "text": "$NVDA $AAPL $MSFT $SHOP how many times are they going to recycle the interest rates hike? Everyone Fng knows it’s going to happen, we all get it. My 16 month old knows it’s going to happen and the market acts like they are being blindsided by the news.", "time": 1650599867.0, "sentiment": "Bullish"}, {"id": 453943822, "text": "$SPY $TSLA $AAPL How are people going to buy my high quality extremely collectible NFTs if they lose all their money in the market?  \n\nLooks like a makers mark kind of night!", "time": 1650599839.0, "sentiment": "Bullish"}, {"id": 453943674, "text": "$SWKS takeover target by $AAPL ..a must !", "time": 1650599795.0, "sentiment": "Bullish"}, {"id": 453943381, "text": "$AAPL this is the last shoe to drop to complete the stock market crash", "time": 1650599707.0, "sentiment": "Bearish"}, {"id": 453942616, "text": "Sweep Options Activity: $AAPL is the #1 ticker with sweep activity where institutions are trading options urgently with 101.0K sweep contracts, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (Link in profile - @InsiderFinance)", "time": 1650599485.0, "sentiment": ""}]