[{"id": 454263630, "text": "$AAPL $DIS $TSLA lots of folks here in ST are great people. Sadly, most are bots or degenerate gamblers with blown accounts. \nMy suggestion to new folks here is to review feed posts, introduce yourself to see if they are real, and absorb talent that’s within. It will take some effort, but you will meet some great people so use your time wisely", "time": 1650703015.0, "sentiment": ""}, {"id": 454263629, "text": "$AAPL $TSM Interesting \nhttps://www.tomshardware.com/news/tsmc-arizona-taiwanese-workers?utm_source=Selligent&amp;utm_medium=email&amp;utm_campaign=XTH_NWL&amp;utm_content=XTH_NWL_Automated_Airedale_Final&amp;utm_term=11556562&amp;m_i=kTPI4PUONuan0Gnnl0XLXnXis06zWFmssmtJ4eZBxzC5yXYNo1PyeZ2HD4lFEsfpL0AfjcH4ZRXcy0nxBc8I_MYx_M3wgKSHpD%2Blii%2BkkO&amp;lrh=2c13be0f9cef82bd7be6f1d539c9744650c53bd2fb30f2d6afbd9151a465cfc8&amp;lctg=11556562&amp;M_BT=66778848130947", "time": 1650703014.0, "sentiment": ""}, {"id": 454263577, "text": "$SPY This Cramer guy, he&#39;s pretty good :o) Not sure if I&#39;d say he call 2 weeks ago was &quot;Bold&quot; but I can think of a few other words for it :o) \n \n$aapl $amzn $baba $msft", "time": 1650702960.0, "sentiment": ""}, {"id": 454263284, "text": "$AAPL How about the earning? What’s you guys think?!", "time": 1650702694.0, "sentiment": "Bullish"}, {"id": 454262645, "text": "$AAPL: The EPS has grown by an impressive 63.57% over the past year. https://www.chartmill.com/stock/quote/AAPL/fundamental-analysis?key=bb853040-a4ac-41c6-b549-d218d2f21b32&amp;utm_source=stocktwits&amp;utm_medium=FA&amp;utm_content=AAPL&amp;utm_campaign=social_tracking", "time": 1650702180.0, "sentiment": ""}, {"id": 454262254, "text": "$QQQ $SPY $AAPL    *wild food fight week..!  mentioned watch spike in VIX into Friday close days  ago, as hedge for French President election over weekend. \n \n*that #MAY $423 #SPY PUT sweeper and those other MASSIVE PUT buyers were correct. and those crazy Dakpool orders  after hours couple days ago .   \nnow seeing some 1st glance clues of MASSIVe Darkpool Buying  After the market close and huge #June CALLS.. will keep looking for more clues and try and post charts and data. (kinda busy__)  \n \n**wave riders should be alert for possible Massive bounce up to resistance again before the next brutal wave. at real important support level. (President  Macron has to win French  election imo for this to play out!", "time": 1650701870.0, "sentiment": ""}, {"id": 454261837, "text": "$AAPL AAPL 2022-04-22 Chart Analysis Video: \nhttps://www.youtube.com/watch?v=Vg07tQ5CV34", "time": 1650701504.0, "sentiment": ""}, {"id": 454261476, "text": "$SPY i was thinking recession maybe in 2023. But we were supposed to have a 0%gdp quarter and we did 2% and this is our weak quarter mostly due to cost \n\n$IWM $DIA $QQQ $AAPL \n\nand you can still call it a recession, buttt when you expand soooo much. is cooling off really a recession, push new highs. President is doing a good job, politics aside the country is running adequately", "time": 1650701233.0, "sentiment": "Bullish"}, {"id": 454260875, "text": "$AAPL consolidation back to 146-152 then markets reverse", "time": 1650700760.0, "sentiment": ""}, {"id": 454260219, "text": "$TSLA 500-700$ , $AAPL 125-135$ in 1-2 months PT . I will watch and wait Recession", "time": 1650700256.0, "sentiment": "Bearish"}, {"id": 454259989, "text": "@Jangalang share your feelings on the pregnant man emoji on the $AAPL board", "time": 1650700096.0, "sentiment": ""}, {"id": 454259721, "text": "$SPY $TSLA $AAPL $FB $MSFT \n\nMy thoughts on stocks next week  ...  \n\nYou want to know why people subscribe to my service?\n\nPreperation. I called 451/452 on the SPY as a top and 426/427 as a bottom for this week. We hit both those levels.  Remember, technicals first. Then fundamentals. In that order. \n\nI told members at the beginning of the week in my Game Plan that Thursday would be the MOST important day of the week (SEE ATTACHED BELOW). For two reasons - 1) although I expected a solid qtr out of TSLA, we get to see how Wall Street treats the shares. I told members that if the stock gives up its gains, the mkt is in trouble. 2) Powell speaks and he will undoubtedly talk the mkt lower. \n\nThursday indeed turned out to be the most important day for the very two reasons I gave. \n\nPoint is, I prepare members for the week. That is the whole point of my Game Plans and daily commentary. \n\nTo join, reach out at jessielivermore1929@gmail.com", "time": 1650699915.0, "sentiment": ""}, {"id": 454259632, "text": "$AAPL price prediction for earrings ?", "time": 1650699843.0, "sentiment": "Bullish"}, {"id": 454258532, "text": "$AAPL ath Friday after Thursdays er.", "time": 1650699070.0, "sentiment": "Bullish"}, {"id": 454258329, "text": "$SPY $AAPL $GOOGL $FB Who thinks wall street knew about this news before you and me?\n\nEU agrees on landmark law aimed at forcing Big Tech firms to tackle illegal content https://www.cnbc.com/2022/04/22/digital-services-act-eu-agrees-new-rules-for-tackling-illegal-content.html?__source=iosappshare%7Ccom.apple.UIKit.activity.CopyToPasteboard", "time": 1650698917.0, "sentiment": ""}, {"id": 454258251, "text": "Equity Sentiment: $AAPL is the #1 stock that institutions are trading with 49.3K options contracts.\n\nMarket analysis included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (Link in profile - @InsiderFinance)", "time": 1650698859.0, "sentiment": ""}, {"id": 454258111, "text": "$AAPL if you didn’t buy today you are a fool!", "time": 1650698777.0, "sentiment": ""}, {"id": 454258050, "text": "$DWAC $AAPL everyone on here whining about truth social and havent even been on the app yet .. if you got a apple get on over and sign up now .. hustle up now..😁🇺🇸https://truthsocial.com/", "time": 1650698734.0, "sentiment": "Bullish"}, {"id": 454257560, "text": "$SPY $AAPL $MSFT Treated us well today with those PUTS ❤️☺️", "time": 1650698431.0, "sentiment": ""}, {"id": 454257504, "text": "$AAPL I predicted the November $SPY top - follow me for more world class trades\nApple 150 next week - bet on it!", "time": 1650698392.0, "sentiment": "Bearish"}, {"id": 454257327, "text": "$AAPL they printed $SPY $QQQ", "time": 1650698277.0, "sentiment": ""}, {"id": 454256842, "text": "$AAPL $QQQ $AMC $SPY I’ll leave you with this. The market isn’t what it was in 2020 and 2021. It’s now a place for well seasoned traders who will play the game both ways. It’s not a game for the weak minded. Remember, nothing I say here should ever effect you in such a way as to lash out at me. This is a random social media site. If you don’t agree with me, then that’s fine. There is such a thing as freedom of speech. Don’t get butt hurt and whine if you don’t like what you read. Best wishes! ✌🏻", "time": 1650697940.0, "sentiment": ""}, {"id": 454256255, "text": "$AAPL war in ukraine will end over wknd.    In lieu of this fed will release statement that no rate hikes this year planned.     They will further add to economy with stimulus payments.   Covid will be renounced and Fauci will go to prison.    Biden will concede that war with Ukraine was not in US best interest and step down monday.   Trump will be sworn in on emergency cree.   Large cap tech will blow earnings out of the water next week.   And unemployment will fall below 2% bb.   We will re-open keystone pipestream and gas will go down to nationwide average of $2.40.    Inflation will fade over next few weeks rapidly to around 3%.    Dont come to dingle next week calling me a prophecy but this will play out next week starting monday.   Aaple will have its best quarter of the decade and will announce the new apple car at ER.   Booooya!", "time": 1650697532.0, "sentiment": "Bullish"}, {"id": 454255410, "text": "$SPY $FB $AAPL $AMZN $TSLA", "time": 1650697012.0, "sentiment": ""}, {"id": 454255338, "text": "Aggressively adding $QQQ and $QLD next week. Don’t miss opportunities to make long term wealth $AAPL", "time": 1650696964.0, "sentiment": ""}, {"id": 454255159, "text": "$AAPL Statistics, Statistics. Don&#39;t trade on fear. Trade on logic. Picking up 5/27 calls on Monday.", "time": 1650696857.0, "sentiment": "Bullish"}, {"id": 454254986, "text": "$AAPL $AMC $SPY $QQQ if you truly believe the Biden administration cares about the LGBTQ community or the African American community or any community that isn’t a part of the leftist inner circle, then you are lost. It’s all a smoke screen to make you think they care while running the country into the ground. If you are this naive to believe a career politician like Biden cares, then you have been brainwashed to root for your own demise. Just think, did you ever expect someone with dementia would become president. He’s making America the laughing stock of the world. I’m neither a Republican nor a Democrat,  just an adult who actually has a brain. You have to be insane to support these career politicians. ✌🏻", "time": 1650696752.0, "sentiment": ""}, {"id": 454254201, "text": "$SPY $FB $AAPL $AMZN $TSLA \nBig tech ER crash continues….", "time": 1650696264.0, "sentiment": "Bearish"}, {"id": 454254192, "text": "$AAPL \n\nI’was Returning of Vacation for ten days. And now economy under pressure by Inflation, Bonds Yields &amp; War. \n\nI was several financial meetings, the economy grow under inflation. For above concepts. \n \nAround The Corner, the economy turn on in positive, applying correction. \nvery strong the consumer by inflation. \nin mi opinion they aren’t stangflation. \n\nFrom Nasdaq 12900 points to 16213 (Cut 12/31/21). \nI estimate for this year. 18000 points. After pass 16213 points. \n\nAll Nasdaq Company with excellent profit. it’s going to get the points. \n\nAbout 5000 points/134= +37.31%. \n\nBuy Now… It’s Bargain all NASDAQ. \n\nEXAMPLE $TQQQ RETURN +111.94%. \nApple 37.31% X 1.20= $234.03 MINIMUM PRICE FOR THIS YEAR 2022/12/31.", "time": 1650696258.0, "sentiment": "Bullish"}, {"id": 454253799, "text": "$AAPL $AMC $SPY $QQQ after one year of Biden, I hope everyone realizes by now, his administrations sole purpose is to kill the middle class. If you still don’t realize this, then at this point no one can help you! Just go put on some gloves, 4 masks and a face shield! 😜", "time": 1650696001.0, "sentiment": ""}]