[{"id": 454978385, "text": "$AAPL NEW ARTICLE : Big Tech&#39;s Stock Drubbing Looks Set to Continue Into Earnings Season https://www.stck.pro/news/AAPL/26812599", "time": 1651027395.0, "sentiment": ""}, {"id": 454978317, "text": "$SPY media bringing back COVID ! you done son ! $DJIA $AAPL", "time": 1651027379.0, "sentiment": ""}, {"id": 454978230, "text": "$AAPL The last fools that sold at 150 are still giving $5 blowies behind wendys dumpster. Do not be one of them! Hold", "time": 1651027361.0, "sentiment": "Bullish"}, {"id": 454978180, "text": "$AAPL 185 for ER….👀🙄", "time": 1651027351.0, "sentiment": "Bullish"}, {"id": 454978065, "text": "$AAPL I’m scared as fuck that we will see a big 30% drop", "time": 1651027325.0, "sentiment": ""}, {"id": 454977568, "text": "@AliPasha1 they are the only buyers rn, imo. watching for $2000 if the market gets hit with fear from bad earnings from $AAPL and $AMZN", "time": 1651027217.0, "sentiment": ""}, {"id": 454977119, "text": "$GOOGL $MSFT $TSLA $AAPL Earnings look great for a supposed recession", "time": 1651027117.0, "sentiment": ""}, {"id": 454976806, "text": "$AAPL is meant to be for long term.  $AAPL is a cash cow. Load up", "time": 1651027049.0, "sentiment": ""}, {"id": 454976769, "text": "$AAPL Someone bought 174 000 and 173 000 shares today, you think these people are fools? 190 eow", "time": 1651027039.0, "sentiment": "Bullish"}, {"id": 454976608, "text": "$AAPL Even though I&#39;m long Apple in my long term portfolio I have a hard time making a super strong bullish argument for the stock. Yes economic and company side of things may look ok so far. But the uncertainties revolving around factory shutdowns in China and FEDs potential policy mistake puts a lot of pressure on guidance. Yes AAPL can blow out earnings for this quarter but its the future guidance and forward PE that will determine the move.", "time": 1651027005.0, "sentiment": "Bearish"}, {"id": 454975871, "text": "$AAPL $125-$130 coming to you by week 2 of May 😁", "time": 1651026844.0, "sentiment": ""}, {"id": 454975675, "text": "$AAPL MSFT is now green...god sign when AAPL blows out the earings", "time": 1651026802.0, "sentiment": "Bullish"}, {"id": 454975522, "text": "$AAPL $MSFT $GOOG $FB $AMZN I’ll leave you with this. It’s going to be the Wild Wild West for both calls and puts tomorrow. If you play it correctly you can profit! We’re living at a time of max greed. Logic won’t dictate the outcome. Greed will! ✌🏻", "time": 1651026767.0, "sentiment": ""}, {"id": 454975338, "text": "$AAPL fell off a cliff. Earnings wont matter good or bad. More downside to come. Take your profits quickly", "time": 1651026734.0, "sentiment": ""}, {"id": 454975218, "text": "$AAPL can&#39;t help but buy afterhr at this price, shit.... Maybe I shud wait for tmr", "time": 1651026711.0, "sentiment": ""}, {"id": 454974870, "text": "$GOOGL wait until $AAPL $AMZN reports their disappointing earnings.. \n\nThanks to our stumbling leader. Couldn’t keep the world peace, now economy. Inflation sucks now, and to try correct inflation he decided to increase rates, and now the market sucks. Let that Powell guy come out and say the economy is strong. People have stopped spending. We will see this slowly showing in the next few quarters..", "time": 1651026638.0, "sentiment": ""}, {"id": 454974489, "text": "$AAPL Again Apple will lift the whole market after monster earnings. Everyone should be thankful, they have lifter the market couple of times now. 190 by friday", "time": 1651026569.0, "sentiment": "Bullish"}, {"id": 454973658, "text": "$AAPL  Where the $180 EOW bulls?!?  Going to have to be some monster earnings!", "time": 1651026412.0, "sentiment": ""}, {"id": 454973526, "text": "$AMC $GME $TSLA $AAPL does the market have to open tomorrow? 🩸", "time": 1651026385.0, "sentiment": "Bearish"}, {"id": 454973492, "text": "$AAPL going to need a miracle prayer for this to go up tommorow 🙏", "time": 1651026378.0, "sentiment": "Bullish"}, {"id": 454972741, "text": "$AAPL Lmao at the manipulation", "time": 1651026240.0, "sentiment": "Bullish"}, {"id": 454972643, "text": "$AAPL if you want to be in tech, which you have to be...there is no there stock to hold other than AAPL. Cash cow and profit machine!", "time": 1651026221.0, "sentiment": "Bullish"}, {"id": 454972624, "text": "$AAPL \n\ngoing to $120 real soon", "time": 1651026217.0, "sentiment": "Bearish"}, {"id": 454972347, "text": "@Stockguru101 i had bear put spreads for a reason didnt i? 25 PE for $aapl with $12 per share being pure cash. New verticals coming, earnings pump coming. Not making a medium term bet here, but short and long looks good!", "time": 1651026168.0, "sentiment": "Bullish"}, {"id": 454972206, "text": "$AAPL share buy back will be larger than expected and be the catalyst that gets AAPL back to 180+", "time": 1651026140.0, "sentiment": "Bullish"}, {"id": 454972175, "text": "$MSFT $AAPL $AMZN $GOOGL No company got anything to do with Trillion Dollars Valuation. Because of these big guys undervalued small companies getting absolutely obliterated. Go under Trillion Dollar valuation.", "time": 1651026134.0, "sentiment": "Bearish"}, {"id": 454972152, "text": "$AAPL feels so good seeing this overpriced pig fall", "time": 1651026131.0, "sentiment": "Bearish"}, {"id": 454971844, "text": "$AAPL how big the buyback and divvy will matter most.  \n\nIf she beats, the bear market is over.", "time": 1651026077.0, "sentiment": ""}, {"id": 454971755, "text": "$ARKK  Algorithms love Art Deco channels we will be fine.... $SPY $$BTC.X $AAPL $UVXY 🍀", "time": 1651026061.0, "sentiment": ""}, {"id": 454971642, "text": "$AAPL when AAPL beats all estimates sideline cash will flow in like you have not seen in a long time.", "time": 1651026037.0, "sentiment": "Bullish"}]