[{"id": 454925927, "text": "$SPY u think MM gonna make it this easy to buy the dip and ride it up??? lmfao ... rookies i swear... tomorrow will be red again until $aapl earnings", "time": 1651020153.0, "sentiment": "Bearish"}, {"id": 454924975, "text": "$AAPL Let’s go Brandon.  Great job with running the economy!!!! Unreal how quickly the wrong CEO can sink a high floating ship.", "time": 1651020014.0, "sentiment": ""}, {"id": 454924763, "text": "$SPY  Well that is logarithmic support on spy for the day.... $TSLA $AAPL $UVXY $ARKK  Entering short on volatility here", "time": 1651019980.0, "sentiment": ""}, {"id": 454924540, "text": "$SPY Fear and Greed playing out right now $QQQ $IWM $AAPL $MSFT", "time": 1651019948.0, "sentiment": ""}, {"id": 454924478, "text": "$ATER Is Looks like GME 2.0 in Making🌋\n\n🚨\nJust News Reported some brokers not Allowing to SHORT as they are unable to find real shares 😳\n\nATER not Shortableee 👀\n\nHow will Shorts Cover their 75% Darkpool Magic Short Shares from past 3weeks:700Million Shares 🌋🚀\n\n$TSLA $TWTR $AAPL fighting near 200MA\nElon is Watching 🥊🩳🔥", "time": 1651019940.0, "sentiment": "Bullish"}, {"id": 454924435, "text": "@DigitalDataNomad @PELK  \n \nThings for AAPL really shifted when Buffet (notoriously anti-tech because he &quot;doesn&#39;t get it&quot;) bought AAPL. \n \nLook at where the inflows were going during the march bear market rally: \n \n&quot;Fund managers increased their ownership of Apple to a record high, according to Bank of America&#39;s strategy data.  \n  \nAnalyst Wamsi Mohan, who rates Apple buy with a $210 price target, noted that fund managers increased their exposure to Apple by 7.1% month-over-month, the second-largest among IT hardware and supply chain stocks, behind only Amphenol (APH), which saw an increase of 7.16%. Total ownership of Apple (AAPL) was 77.7% at the end of February.  \n  \n&quot;We attribute the increase to a flight to safety in a choppy macro-economic environment,&quot; Mohan wrote in a note to clients.&quot; \n  \n--------- \n \n$AAPL is now a 7.1% weight of the $SPY", "time": 1651019933.0, "sentiment": ""}, {"id": 454924363, "text": "$AAPL This is bear&#39;s paradise. Everyone getting poor meanwhile I&#39;m making bank \n \nShort heavy", "time": 1651019922.0, "sentiment": "Bearish"}, {"id": 454924233, "text": "$AAPL i was gonna sell but this would be a stupid time to sell here at the bottom im just gonna wait for the next pop up", "time": 1651019903.0, "sentiment": ""}, {"id": 454923970, "text": "$AAPL IT IS VERY SIMPLE BUY AND HOLD FOR 3-5 months for ALL TIME HIGHS", "time": 1651019860.0, "sentiment": "Bullish"}, {"id": 454923758, "text": "$AAPL trash and will go with the rest of the market", "time": 1651019828.0, "sentiment": ""}, {"id": 454923730, "text": "$AAPL can you hit us with the gran finale", "time": 1651019822.0, "sentiment": "Bearish"}, {"id": 454923309, "text": "$SPY peak earnings or nah? $AAPL", "time": 1651019760.0, "sentiment": ""}, {"id": 454922327, "text": "$SPY This feels like the DOT COM bubble bursting in 5he 90s.  All the underlying stocks are damaged goods with few mega caps holding the index together.  $qqq $aapl $msft", "time": 1651019610.0, "sentiment": ""}, {"id": 454922203, "text": "$AAPL $TSLA $NVDA $SPY  $AMZN \nShort Apple &amp; Tesla. \nTold you. Apple &amp; Telsa were abusing factories labors. Shame on U.S. tech.\nThey support Ukrainr but abusing Chinese labors for moneys. \n\nhttps://www.google.com/amp/s/www.bollyinside.com/news/thousands-of-workers-at-tesla-and-apple-factories-in-shanghai-have-been-infected-with-covid-19%3famp=1", "time": 1651019593.0, "sentiment": "Bearish"}, {"id": 454922072, "text": "$AAPL \n\nWtf .. heavy sell imbalance .. since beginning of the 2022.\n\nIt looks like they want to give max pain for everyone til the earning ..", "time": 1651019574.0, "sentiment": "Bullish"}, {"id": 454921937, "text": "$AMZN $AAPL $MSFT $GOOG $NVDA  \n&quot;Rates rise until something breaks … is anything broken yet?&quot;  \n \nStill need stocks like Tasla, apple, msft, google &amp; amazon to decline 50% from ATH.  These stock have yet to &quot;crash&quot; but most others have seen 40% to 70% decline now.", "time": 1651019554.0, "sentiment": ""}, {"id": 454921737, "text": "$AAPL $QQQ  leaked the earnings?? Lmao", "time": 1651019521.0, "sentiment": "Bullish"}, {"id": 454921663, "text": "$AAPL only 25 bucks from high lol", "time": 1651019507.0, "sentiment": ""}, {"id": 454921290, "text": "$AAPL free money.  Undervalued here.", "time": 1651019449.0, "sentiment": "Bullish"}, {"id": 454921182, "text": "$SPY $QQQ $AAPL $FB CRASH THE CLOSE NOT ENOUGH PAIN YET!", "time": 1651019432.0, "sentiment": "Bearish"}, {"id": 454921130, "text": "@TheSilverDude I&#39;m betting that the market sees these earnings as a &quot;rescue&quot; - that things aren&#39;t as bad as we all thought.  I bought full positions of $GOOGL, $MSFT, $AAPL and $AMZN on today&#39;s lows.  If earnings come up shitty, I&#39;ll get hit with the S/L.  If the bottom breaks on NAS, all bets are off.  I&#39;m banking on 12.5 being the low or very near it.  I think RUT, DOW and SPY have a bit to go yet and I&#39;m short there.", "time": 1651019424.0, "sentiment": ""}, {"id": 454920926, "text": "Don’t hold cash because inflation is killing value; better to buy stocks except the market is correcting without a fucking floor, so better buy real estate - oh, also in a historic bubble and oh yes mortgage rates are ticking up, so better buy crypto, oh wait, also tanking, put it in gold, the ancient store of value, oh wait also tanking, guess I’ll hold onto my cash………… $AAPL $GOOGL $NVDA $GLD  $PYPL", "time": 1651019393.0, "sentiment": ""}, {"id": 454920299, "text": "$AAPL Microsoft should report good ER from cloud services", "time": 1651019301.0, "sentiment": ""}, {"id": 454920214, "text": "$AAPL $MSFT $FB $GOOGL $AMZN \nTech Giants Duped Into Giving Up Data Used to Sexually Extort Minors\n\nhttps://www.google.com/amp/s/news.yahoo.com/amphtml/tech-giants-duped-giving-data-173424811.html", "time": 1651019287.0, "sentiment": "Bearish"}, {"id": 454920082, "text": "$AAPL you just have to play the premium manipulation through Friday. The $320 Microsoft call is actually up at the moment. It’s never what it seems with those way OTM options!", "time": 1651019268.0, "sentiment": ""}, {"id": 454919802, "text": "$AAPL welcome to #FJB America😂😂🖕🖕", "time": 1651019225.0, "sentiment": ""}, {"id": 454919758, "text": "$AAPL Also, we continue to benefit from the strength of our new-to-the-world materials. Apple&#39;s iPhone 13 launch and legacy product lines like the iPhone 12, which features ceramic shield resulted in increased premium glass sales year over year.", "time": 1651019217.0, "sentiment": ""}, {"id": 454919757, "text": "$AAPL", "time": 1651019217.0, "sentiment": "Bullish"}, {"id": 454919184, "text": "$SPY So $aapl at 3:20 ESt has only traded 67m shares, WOW! \nIts a Buyers strike so anyone selling is selling into a void as WS waits to hear Earnings. There is no large selling fear \n \nAs a Trader you have to love this Fear &amp;  since this was expected today if you were prepared for it its not a bad day \n \n$QQQ $MSFT $BB", "time": 1651019126.0, "sentiment": ""}, {"id": 454919062, "text": "$SPY $AAPL don’t save her. She don’t wanna be saved 🫦", "time": 1651019107.0, "sentiment": "Bearish"}]