[{"id": 453492826, "text": "$NVDA I know I sound pretty bearish here, but I’m considering the current market volatility. 212 is proving to be solid support once again today…I’m just hoping $TSLA  doesn’t crash QQQ and in turn…NVDA. \n\nPeople already know there’s gonna be bad news about the Shanghai factory, it’s possibly priced in, but I’m sure Musk has some positive surprises in store for the market. I can say without doubt he isn’t going to disappoint as much as $NFLX  😂", "time": 1650492675.0, "sentiment": ""}, {"id": 453492780, "text": "$BRCHF yeeeessss! We got a huge new partnership! AI chips are the future!\n\n$NVDA $AMD $TSLA $MRVL", "time": 1650492670.0, "sentiment": "Bullish"}, {"id": 453491917, "text": "$NVDA Need a big break here above 216 for bulls  ….. QQQ needs a big press up here to kill these cockroaches", "time": 1650492521.0, "sentiment": "Bullish"}, {"id": 453491485, "text": "$AMD $NVDA Thanks Brandon", "time": 1650492446.0, "sentiment": ""}, {"id": 453490452, "text": "$NVDA massive rally is cooking …… shorts will be fried up like eggs in the morning real soon …… 220 incoming …", "time": 1650492271.0, "sentiment": "Bullish"}, {"id": 453490075, "text": "$NVDA Q’s 343 and above sends this… spy building a bull flag (somehow) and will retest highs imo\n\nPopcorn 🍿 til it breaks, I’m not greedy", "time": 1650492205.0, "sentiment": ""}, {"id": 453488816, "text": "$NVDA 212 holding up pretty well but the market is looking for a reason to dump (NFLX has done a great job F—ing every1 over lol.)\n\nI’m long here but if TSLA does bad QQQ will break through supports, and NVDA will likely test 200. The whole year is kinda F—ed with so much going on in the world. \n\nGrowth rates slowing, China Covid crap, supply chain crap, Ukraine mess etc…all this uncertainty and inflation is causing treasury yields to rise\n\nPretty bearish market but I imagine NVDA being at or near 300 some point next year. 212 is a good place to initiate a position if you are willing to take risk short term. I would prepare for further downside though, maybe dollar cost avg.\n\nThere are so many irrational bulls and bears on this board lol. Some people really thought this would see like 250+ this week lmao. Others want 180…180 definitely more likely in the current environment, but 200 will be strong support imo. Long term NVDA will thrive, but we clearly in a bear market rn guys lol ✌️", "time": 1650491992.0, "sentiment": ""}, {"id": 453487894, "text": "$NVDA Break 216 with volume and we fly baby bears will not stay short into Tesla’s earnings on tech stocks …..", "time": 1650491839.0, "sentiment": "Bullish"}, {"id": 453486897, "text": "$NVDA This has been the craziest week of trading everytime we hit are support we bounce everybody has got to be making a ton of $$$ this week !!! Good luck all keep it going", "time": 1650491665.0, "sentiment": ""}, {"id": 453486849, "text": "$NVDA who wants $300 right now ?", "time": 1650491659.0, "sentiment": "Bullish"}, {"id": 453486648, "text": "$NVDA every stock has a price that dip buyers will consider okay. &quot;Oversold&quot; not always the reason for entry but truly it looks like the dip buyers are again looking here to take back over $215.  This is an important pivot level for bullishness to resume IMO. GL all.", "time": 1650491626.0, "sentiment": ""}, {"id": 453486451, "text": "$QQQ manipulated dead cat up to distribute the $NFLX $FB $PTON $NVDA dumpster fire.  Don’t get caught", "time": 1650491593.0, "sentiment": "Bearish"}, {"id": 453486415, "text": "$NVDA No reason, it&#39;s down -$7.1 today.", "time": 1650491587.0, "sentiment": ""}, {"id": 453486035, "text": "$NVDA Don’t  forget Tesla earnings will raise tech back up ….. they don’t miss bears NFLX earnings mean nothing for the real big boys", "time": 1650491528.0, "sentiment": "Bullish"}, {"id": 453485722, "text": "$NVDA ...Time to buy ....don&#39;t miss it.", "time": 1650491473.0, "sentiment": "Bullish"}, {"id": 453485556, "text": "$NVDA", "time": 1650491447.0, "sentiment": "Bullish"}, {"id": 453485430, "text": "$NVDA doubled my 300$ May 20 call this morning. Wouldn’t be possible if it wasn’t for the bears here. Averaged down beautifully. Thanks care bear", "time": 1650491426.0, "sentiment": "Bullish"}, {"id": 453485379, "text": "$NVDA easiest buy on the market.  days like this are a shopping spree.  only people here sniveling are either stupid or cashless.", "time": 1650491417.0, "sentiment": ""}, {"id": 453485159, "text": "$NVDA man, made 3000% on $NFLX puts, and then just sold some Nvidia 197.5/200P for next week expiry (I’m already in the green). What a week. I think I’m done for this week lest I lose my gains. GL ☺️.", "time": 1650491377.0, "sentiment": ""}, {"id": 453484834, "text": "$NVDA let’s test 220 now !!!!! There was no retest at all of upper levels it’s coming", "time": 1650491322.0, "sentiment": "Bullish"}, {"id": 453484364, "text": "$NVDA down 6% from open to low... this is truly something retarded.", "time": 1650491248.0, "sentiment": ""}, {"id": 453484272, "text": "$NVDA Ok bought 300 shares ..will ride it to atleast 220", "time": 1650491232.0, "sentiment": "Bullish"}, {"id": 453484236, "text": "$NVDA Sympathy day....Demand is not an issue for this company", "time": 1650491225.0, "sentiment": "Bullish"}, {"id": 453484138, "text": "$NVDA closing green…? Gap up after TSLA beats…..?", "time": 1650491212.0, "sentiment": ""}, {"id": 453483794, "text": "$NVDA sideways six months, LETS GO !! I BOUGHT THR TOP", "time": 1650491163.0, "sentiment": "Bullish"}, {"id": 453483571, "text": "$NVDA gooood lord!", "time": 1650491129.0, "sentiment": ""}, {"id": 453482666, "text": "$NVDA wishing I had more money to buy at these levels this is one hell of a deal", "time": 1650490987.0, "sentiment": ""}, {"id": 453481965, "text": "$NVDA will today be the official entry into FAANG??", "time": 1650490878.0, "sentiment": "Bullish"}, {"id": 453481673, "text": "$NVDA the rationale for selling here: because $NFLX lost subscribers, we can no longer sell semiconductors", "time": 1650490834.0, "sentiment": ""}, {"id": 453481638, "text": "$NVDA RIP NVDA part 14", "time": 1650490827.0, "sentiment": ""}]