[{"id": 453685741, "text": "$NVDA 🚀🚀🚀🙏🏼🙏🏼🙏🏼", "time": 1650558431.0, "sentiment": "Bullish"}, {"id": 453684091, "text": "$NVDA Lets try again today (for the 20th time!) .. Good luck bulls.", "time": 1650557769.0, "sentiment": "Bullish"}, {"id": 453680894, "text": "$NVDA the article people keep sighting is so narrowly written. As if NVDA is only relying on graphics chips lol. Also I’m pumped they are back on shelves as I personally would never pay some crazy escalated price for anything.", "time": 1650556546.0, "sentiment": "Bullish"}, {"id": 453680535, "text": "$NVDA Does anybody know if there is a danger of the commoditization of the semiconductor business of nvda?", "time": 1650556344.0, "sentiment": "Bullish"}, {"id": 453676875, "text": "$TSLA $NVDA $AAPL $MSFT $GOOGL\n\n‘merica’s hitters", "time": 1650553983.0, "sentiment": "Bullish"}, {"id": 453676526, "text": "$NVDA \n\nSo what this pumping to today? $270?", "time": 1650553758.0, "sentiment": ""}, {"id": 453676493, "text": "$NVDA has an Altman-Z score of 20.77, meaning it is financially healthy with little risk of bankruptcy. https://www.chartmill.com/stock/quote/NVDA/fundamental-analysis?key=38672586-ebbc-43dd-8896-b9472a8ec477&amp;utm_source=stocktwits&amp;utm_medium=FA&amp;utm_content=NVDA&amp;utm_campaign=social_tracking", "time": 1650553740.0, "sentiment": ""}, {"id": 453676287, "text": "$AAPL $NVDA $GOOG $PLTR $UPST Today I’ll be blocking all bear and shorting posts. Betting on negative events is not of any interest to me and seems like a horrible way to view the market and approach life in general. Frankly you have nothing of value to add. 😊", "time": 1650553628.0, "sentiment": ""}, {"id": 453675331, "text": "Sweep Options Activity: $NVDA is the #3 ticker with sweep activity where institutions are trading options urgently with 31.0K sweep contracts, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (Link in profile - @InsiderFinance)", "time": 1650552886.0, "sentiment": ""}, {"id": 453674844, "text": "Unusual Options Activity: $NVDA is the #27 ticker with unusual activity from institutional traders with an average of 16% out of the money, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (Link in profile - @InsiderFinance)", "time": 1650552388.0, "sentiment": ""}, {"id": 453674473, "text": "$NFLX What in the world was Ackman thinking when he sold his at a 4-year low? I expected better than this of him honestly, at least wait for a dead cat bounce? Only he knows why he did. LOL. \n \n$TSLA $AAPL $ARKK $NVDA", "time": 1650551960.0, "sentiment": "Bullish"}, {"id": 453673963, "text": "$nvda For a limited time, we are opening our trading chatroom to the public. Get access to chatrooms, stock alerts, option alerts, portfolios, and more, Check it out below, 👇  \nfree-stockalertsroom.mydiscussion.net/", "time": 1650551421.0, "sentiment": "Bullish"}, {"id": 453673515, "text": "$NFLX Buffet is buying this today, this is now treading as a value stock which $BRK.A would be interested in. Largest player in the industry, oversold shockingly and back to 2018 levels. He will be buying mark this post. \n \n$TSLA $NVDA $OXY", "time": 1650550905.0, "sentiment": "Bullish"}, {"id": 453673507, "text": "$NVDA morons 😂😂😂", "time": 1650550898.0, "sentiment": "Bullish"}, {"id": 453673335, "text": "$NVDA Maybe another bear could post the ridiculous Barron&#39;s article about Nvidia &quot;could&quot; be the next casualty. And if my aunt had a dick she &quot;could&quot; be my uncle 🤦 lol Another attempt for the big boys to get cheap shares before yet another monster ER. \n\nFunny how they fail to mention the primary revenue streams and growth in the article (cloud, AI, auto), and how the other chip companies don&#39;t come close to Nvidia&#39;s future growth because of it. Convenient for them to leave out.", "time": 1650550666.0, "sentiment": "Bullish"}, {"id": 453672518, "text": "$NVDA It’s going to rip on the shorts face today", "time": 1650549672.0, "sentiment": ""}, {"id": 453671466, "text": "$SPY $AAPL $TSLA $NVDA $AMZN \nPowell speech today to lock down market", "time": 1650548384.0, "sentiment": "Bearish"}, {"id": 453671402, "text": "@Followmystyle Or some anal-ysts aren&#39;t sufficiently tech-savvy. I don&#39;t seee a net decline in demand for high-end linear algebra chips (to put it in somewhat uncommon terms) anytime soon. Crypto is dead but interactive entertainment and AI trainign are not, quite the opposite. \n \nGranted, this year the consumer markets will be in trouble and $NVDA may lull (though I do not expect it to) but that will not last. By the end of the year, most Western economies will have disentangled themselves from the Russian cleptocracy. The US will hugely benefit from new oil and lng contracts, that will spill over to consumer households.", "time": 1650548310.0, "sentiment": ""}, {"id": 453669315, "text": "$NVDA $220 breaks we fly", "time": 1650545441.0, "sentiment": ""}, {"id": 453667760, "text": "$NVDA NVDA 2022-04-20 Daily Forecast Video: \nhttps://www.youtube.com/watch?v=K-z-oyVjhQE", "time": 1650542776.0, "sentiment": ""}, {"id": 453666589, "text": "$NVDA looking at various stocks and indexes you see massive declines like really the bubble is bursting on all sides ... tough times ahead. 2022 the great correction.", "time": 1650540975.0, "sentiment": "Bullish"}, {"id": 453666526, "text": "$NVDA $VENAR What&#39;s needed is more time", "time": 1650540898.0, "sentiment": ""}, {"id": 453665791, "text": "$NVDA The chart doesn&#39;t lie. Look at acceleration (positive curvature) in buying going on on the 4 hour chart  (stochastic)", "time": 1650539877.0, "sentiment": "Bullish"}, {"id": 453665551, "text": "$NVDA this thing boutta drop finally or what", "time": 1650539545.0, "sentiment": ""}, {"id": 453665536, "text": "$SPY $GME $AMC $NVDA $SPX 🧞‍♂️  \n\nhttps://music.amazon.com/albums/B001ESU5PM?do=play&amp;trackAsin=B001ESW730&amp;ref=dm_sh_IVg2pQ23nZFdPzYeIVmysgXLk", "time": 1650539525.0, "sentiment": "Bearish"}, {"id": 453664987, "text": "$NVDA 160-180 i coming", "time": 1650538792.0, "sentiment": ""}, {"id": 453664847, "text": "$NVDA 🙄🙄🙄🙄🙄🙄🙄", "time": 1650538635.0, "sentiment": "Bearish"}, {"id": 453664721, "text": "$SPY $NVDA $AMD $SOXL $MU  \nLooks like next Netflix crash will be \nNvidia \nNvidia’s gaming cards are increasingly available on major electronics websites, including Microcenter, Newegg, and Amazon. com. Some retailers are showing rising inventory levels and have even started to discount the cards, another clear sign demand is faltering. The weakness is showing up on reseller marketplaces too. According to the price-tracking website CamelCamelCamel, the third-party selling price of an Nvidia RTX 3080 Ti card has fallen roughly 40% this year.\nhttps://www.marketwatch.com/articles/nvidia-stock-chips-demand-supply-outlook-51650492059?siteid=nf-rss", "time": 1650538461.0, "sentiment": "Bearish"}, {"id": 453663920, "text": "$NFLX  someone&#39;s little brother  Don&#39;t Let it be Your Brother&#39;s Fam.  \n \n$spy \n$qqq \n$goog \n$nvda", "time": 1650537410.0, "sentiment": "Bearish"}, {"id": 453663681, "text": "$AAPL $NVDA $SPY $AMD \n$TSLA = Unethical company. \nLabor abuse. It&#39;s like if you want to keep your job? sleep on the floor.  @Therealelonmusk \n\nTesla workers at the automaker&#39;s facility in Shanghai will be required to sleep on the factory floor as Tesla restarts production after a three-week shutdown, Bloomberg reported on Monday.\nTesla will provide workers with a sleeping bag and mattress and set aside a portion of the factory floor to be used as sleeping accommodations.\n\nTesla said in the memo that there will also be spaces for showering, food, and entertainment, but the company is still in the process of setting it up, Bloomberg reported. \n\nhttps://www.businessinsider.com/tesla-shanghai-workers-eat-sleep-factory-floor-avoid-shutdowns-report-2022-4", "time": 1650537144.0, "sentiment": "Bearish"}]