[{"id": 453978135, "text": "$CRSR $NVDA $AMD $MSFT $SOXL \nCorsair crashed with prelim Q1 numbers. \nHope you know what that means. \n\nCorsair Gaming stock sinks aftermarket on weak prelim Q1 results\n\nhttps://seekingalpha.com/news/3825599-corsair-gaming-stock-sinks-aftermarket-on-weak-prelim-q1-results", "time": 1650612108.0, "sentiment": "Bearish"}, {"id": 453977833, "text": "$NVDA", "time": 1650611970.0, "sentiment": ""}, {"id": 453976971, "text": "$FB $NVDA $SNAP my group is watching all of these. Message me if you are interested. Live trading. Free trials available if u Message me!", "time": 1650611581.0, "sentiment": ""}, {"id": 453976947, "text": "$NVDA PT for tomorrow", "time": 1650611572.0, "sentiment": "Bullish"}, {"id": 453976371, "text": "$NVDA Anyone else starting to feel like it&#39;s ground hog day? Fed mentions rate hikes, algos go sell crazy, every you tuber talks about this being the &quot;crash&quot;. Week later.. Fed comments, algos sell, you tubers start the FUD. At least once a week. All of 2022 so far. Not to mention on every dip last year the you tubers started with &quot;the crash&quot; 🤦\n\nAnd what happens next, 80% of companies reported are reporting good earnings and guidance, people realize we have a strong economy, and just like that all is well in the market again. Up next week, bullish earnings week, no JP algo BS. Count on it 💪", "time": 1650611318.0, "sentiment": "Bullish"}, {"id": 453976329, "text": "@Sensei071 $AMD $NVDA  I do appreciate the point but I believe it is lost in a general understanding.  Let&#39;s say the highly specialized $9K  to $20K water cooled units are probably a tad over priced, but these are highly specialized used for geo modelling, mapping the universe, real time body scans etc.\n\nLet&#39;s face it, the tech is brilliant and the price is probably justified.\n\nBut that is not what the market, in it&#39;s short sighted vision sees.\n\nThese idiots that claim to be analysts have no clue about the real tech, the shorters think in terms of retail quick $.  But the real works costs a fortune.  I wish shorting was illegal.  It destroys progress for the sake of pennies on the dollar.", "time": 1650611302.0, "sentiment": ""}, {"id": 453976288, "text": "$NVDA what a sh i t show", "time": 1650611286.0, "sentiment": ""}, {"id": 453974643, "text": "$NVDA bought a call today and my transaction receipt has wording about a stock split? Did I miss something?", "time": 1650610546.0, "sentiment": "Bullish"}, {"id": 453974280, "text": "$NVDA sometime tomorrow afternoon will be the likely best entry", "time": 1650610383.0, "sentiment": "Bullish"}, {"id": 453974050, "text": "$NVDA Why down so much time to buy call yet ???", "time": 1650610274.0, "sentiment": ""}, {"id": 453973957, "text": "$AMD $NVDA people are misinterpreting GPU prices falling and increased shelve availability as bearish and PC demand falling. I wholeheartedly believe this is a result of prices normalizing and supply chain easing in certain areas. Previous marked up prices were outrageous and unsustainable. Imo demand still remains robust and next ER will show. I’ll continue to add at these levels.", "time": 1650610237.0, "sentiment": "Bullish"}, {"id": 453973550, "text": "$NVDA left so much on the table today on this play, but plans for school break with the kiddo are more important to me today. Lock it and we’ll hammer more tomorrow.", "time": 1650610045.0, "sentiment": ""}, {"id": 453973123, "text": "$SPY $QQQ $NVDA \nbesides the triple digit number, this is a major problem for chips. And sends a message to the global economy. If China shuts down the world shuts down", "time": 1650609857.0, "sentiment": ""}, {"id": 453973016, "text": "$NVDA crazy how fast this reversed. It went from 220 to 280 real fast and now back to 200", "time": 1650609809.0, "sentiment": ""}, {"id": 453972775, "text": "$NVDA is there a better chip maker right now?", "time": 1650609716.0, "sentiment": ""}, {"id": 453972640, "text": "$NVDA made the mistake of selling 5/6th of my shares in 2018. Not doing it again. It’s maybe down but this is the future. Long term hold.  Nice price point here but not certain, it might still go lower before we bounce", "time": 1650609658.0, "sentiment": "Bullish"}, {"id": 453972571, "text": "$NVDA", "time": 1650609627.0, "sentiment": ""}, {"id": 453972439, "text": "$NVDA An analyst lowered his PT on nvda today to 255. Why on earth would anyone in their right mind believe any Wall St analyst given their horrendous track record?  A majority of them are grossly incompetent. And some are just out to provide investors with wrong information so they buy when In fact their hedge fund and institutional clients are selling. Stop listening to these analysts people!  Look at their track record on stocks like nflx.", "time": 1650609570.0, "sentiment": ""}, {"id": 453972272, "text": "$NVDA at 170$", "time": 1650609505.0, "sentiment": ""}, {"id": 453972103, "text": "$DKNG $SNAP $NVDA $TSLA Some major insider buying going on today. Somebody knows something ahead of ER. Watch for a bounce tomorrow at the all time lows on Draftkings.", "time": 1650609432.0, "sentiment": "Bullish"}, {"id": 453971657, "text": "$NVDA NVDA 2022-04-21 Daily Forecast Video: \nhttps://www.youtube.com/watch?v=CVuDZ9vhEQs", "time": 1650609257.0, "sentiment": ""}, {"id": 453971655, "text": "$NVDA this Putin war couldn’t have happened at the worse fucking time. Couldn’t he wait another few years. Wtf", "time": 1650609257.0, "sentiment": ""}, {"id": 453971520, "text": "@SennaFan $AMD $NVDA $AAPL $GE\n\n As a Senna fan myself, and someone who really felt like shit when we lost so many racers that year, when Senna died at Imola,  I hope you appreciate that Ayrton did a lot to help regular people.\n\nAs for the politics of this, I voted neither the Idiot nor the Moron.\n\nAs for you somehow defending Putin, you should be ashamed of yourself.  Especially when the F1 race is at Imola is this weekend.\n\nYou disgrace his memory.", "time": 1650609203.0, "sentiment": "Bullish"}, {"id": 453971161, "text": "$NVDA my July calls are getting beat the fuck up damn near everyday it’s 10% down", "time": 1650609088.0, "sentiment": ""}, {"id": 453970620, "text": "$AMZN $GOOG $AAPL $NVDA $MSFT  \nNasdaq -  down 18.5%    from ATH \n \nSpy - down 9.2%  \n \nDow -  down 6.3%", "time": 1650608886.0, "sentiment": ""}, {"id": 453970028, "text": "$NVDA if nvda don’t make it nobody gonna make it.", "time": 1650608651.0, "sentiment": ""}, {"id": 453969965, "text": "$NVDA death cross. Game over for this overpriced pig", "time": 1650608630.0, "sentiment": "Bearish"}, {"id": 453969590, "text": "$NVDA I buy the dip and then I bleed. Over and over again.", "time": 1650608496.0, "sentiment": ""}, {"id": 453968486, "text": "@qvboie20 Interest rates spiked and everything tanked, I sold my $NVDA calls early morning for a slight loss, but that is why I buy calls and not stock during these volatile times.  I bought $CLF today, will buy more $DVN tomorrow if it sinks further.  Good companies got sold off which makes for opportunity.", "time": 1650608060.0, "sentiment": "Bullish"}, {"id": 453968465, "text": "$NVDA $SQ $UPST$SHOP Looks like more pain tomorrow. Sickening.", "time": 1650608048.0, "sentiment": ""}]