[{"id": 453950298, "text": "$NVDA why is so weak lately.  PURE BULLSHIT.  HOLD", "time": 1650601879.0, "sentiment": "Bullish"}, {"id": 453949793, "text": "$MSFT $GOOG $NVDA can I say hell is coming…OMG … sell sell sell breaking news 50 pts hike… 🤑 wished had cash to buy nvda and alphabet ….such a bargain", "time": 1650601724.0, "sentiment": "Bullish"}, {"id": 453949157, "text": "$NVDA Yes.  This moves with the market but not when it is at the lowest price in the year!  This is a bargain price.  Yes everything fell today - but look at $AAPL and $MSFT and look at $NVDA - $NVDA took the greatest dip ever  - it was way overdone and it will get corrected tomorrow.  The market does not need to be green - it can be neutral or even red and NVDA will shoot  up at open and then maybe then move slowly with the market because people will be buying it as an investment", "time": 1650601526.0, "sentiment": "Bullish"}, {"id": 453948536, "text": "$NVDA any one beliving the NVDA Crash is over has their head in their diapers drowning in stinky stuff", "time": 1650601342.0, "sentiment": ""}, {"id": 453948352, "text": "$ETH.X $NVDA Biden has the muck touch... Everything the fucker touches turns into shit...", "time": 1650601279.0, "sentiment": ""}, {"id": 453948070, "text": "$NVDA there is no big support line until $180 lost alot being hopeful.  now i know better", "time": 1650601178.0, "sentiment": "Bearish"}, {"id": 453947934, "text": "$SPY $NVDA $AMD $TSM", "time": 1650601133.0, "sentiment": "Bearish"}, {"id": 453947929, "text": "$NVDA Give me 135", "time": 1650601130.0, "sentiment": ""}, {"id": 453947782, "text": "$NVDA this goes to $150 and below noo b baby boys and that is 30 times earnings assuming $5 per share ..if they get lucky---", "time": 1650601083.0, "sentiment": ""}, {"id": 453947715, "text": "$NVDA \nThat is what he said!", "time": 1650601065.0, "sentiment": "Bullish"}, {"id": 453947018, "text": "$NVDA The number one reason this will go up tomorrow is the crazy amount of shorts lower than $205.  It will be a huge short squeeze. This is the type of stock people want to hold very very long - everyone will be picking it up tomorrow. It is the lowest price this year.  Look at the chart - every time it went lower is bounced back 20 to 30 points.  Close your short and go long.", "time": 1650600836.0, "sentiment": "Bullish"}, {"id": 453946692, "text": "$NVDA I’ll buy 100 shares if $NVDA  $180", "time": 1650600729.0, "sentiment": ""}, {"id": 453946284, "text": "Sweep Options Activity: $NVDA is the #6 ticker with sweep activity where institutions are trading options urgently with 27.7K sweep contracts, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (Link in profile - @InsiderFinance)", "time": 1650600604.0, "sentiment": ""}, {"id": 453946240, "text": "$NVDA everything going down until spy goes under 4K - you might have up days here and there but overall trajectory lower. This could go down to 160-170", "time": 1650600591.0, "sentiment": "Bearish"}, {"id": 453946085, "text": "$NVDA shows a strong growth in EPS: 77.98%. https://www.chartmill.com/stock/analyzer/stock/NVDA?view=fundamental-analysis&amp;key=38672586-ebbc-43dd-8896-b9472a8ec477&amp;utm_source=stocktwits&amp;utm_medium=FA&amp;utm_content=NVDA&amp;utm_campaign=social_tracking", "time": 1650600540.0, "sentiment": ""}, {"id": 453946039, "text": "$NVDA doesn’t this just look like it’s ready to plummet to its death?", "time": 1650600522.0, "sentiment": "Bearish"}, {"id": 453946035, "text": "$NVDA Buy here and hold it and in a couple of months it will be over $300.  No other trading needed.  No need to waste time.  Wish I had more- this is the lowest level this year and such a great bargain!  Do not miss out!", "time": 1650600522.0, "sentiment": "Bullish"}, {"id": 453945900, "text": "$NVDA futures should be down 3-4% like when Russian invaded Ukraine, worst time in the market now, inflation way too high, valuations still way too high, recession fear spiking, earnings are bad, economy slowing down. Hedge funds and institutional investors keep exiting slowly, trillions of dollars out of the market on the side, trillions are in bonds, yield On the 10 year is 3% it’s a disaster! after all this drama stocks still close to ATH, SPY isn’t even down close to 2018, SPY dropped almost 17-25% in 2018, there is so much more down side yo come, never listen to any pumpers who say market bottom and buy stocks now. Buying NVDA at 150", "time": 1650600479.0, "sentiment": "Bearish"}, {"id": 453945681, "text": "$NVDA red day tomorrow?", "time": 1650600410.0, "sentiment": ""}, {"id": 453945389, "text": "$NVDA euphoria on this board. You know what that means", "time": 1650600313.0, "sentiment": ""}, {"id": 453945328, "text": "$AMD $NVDA European markets have fared better than us in last two weeks.  Biden is just awesome!", "time": 1650600288.0, "sentiment": "Bullish"}, {"id": 453945164, "text": "$NVDA $AMD add these dips!", "time": 1650600240.0, "sentiment": "Bullish"}, {"id": 453944979, "text": "$NVDA damn rotating away from tech has hurt this. Cheap enough I love it. Bout to buy some leaps. No way it goes below 200 for long", "time": 1650600183.0, "sentiment": ""}, {"id": 453944315, "text": "$NVDA  Name one thing Joe Byran has done to help NVDA", "time": 1650599998.0, "sentiment": "Bullish"}, {"id": 453943912, "text": "$NVDA $AAPL $MSFT $SHOP how many times are they going to recycle the interest rates hike? Everyone Fng knows it’s going to happen, we all get it. My 16 month old knows it’s going to happen and the market acts like they are being blindsided by the news.", "time": 1650599867.0, "sentiment": "Bullish"}, {"id": 453943747, "text": "$MU $AMD $NVDA $QCOM $MRVL Looking forward to $QCOM  ER next week and $AMD on Tuesday, May 3rd (week after next).  Let&#39;s continue to solid Semi earnings.", "time": 1650599815.0, "sentiment": "Bullish"}, {"id": 453943707, "text": "$NVDA", "time": 1650599803.0, "sentiment": "Bullish"}, {"id": 453943704, "text": "Why Now Is the Time to Buy NVDA Stock | InvestorPlace $NVDA  https://investorplace.com/2022/04/now-is-the-time-to-buy-nvidia-stock/", "time": 1650599801.0, "sentiment": ""}, {"id": 453943663, "text": "$NVDA calls it is for next Friday prove me otherwise", "time": 1650599791.0, "sentiment": "Bullish"}, {"id": 453943557, "text": "$NVDA Where&#39;s your fan boy???", "time": 1650599761.0, "sentiment": ""}]