[{"id": 454245243, "text": "$NVDA we will see next week.  \n \nnot selling single share. keep adding. bring it down baby. I will keep add", "time": 1650691098.0, "sentiment": "Bullish"}, {"id": 454244928, "text": "Anyone else think reversal/bullish week for many stocks starting Monday…? $UPST $SQ $NVDA $AMD $ZM", "time": 1650690971.0, "sentiment": "Bullish"}, {"id": 454243870, "text": "$NVDA a little bird told me NVDA will fall hard.  \nhttps://www.wenmoon.app/stock/NVDA", "time": 1650690453.0, "sentiment": "Bearish"}, {"id": 454243410, "text": "$NVDA not selling 1 share of any of these.    5 years!", "time": 1650690242.0, "sentiment": "Bullish"}, {"id": 454243362, "text": "$NVDA shit happens", "time": 1650690217.0, "sentiment": ""}, {"id": 454243207, "text": "$tsla $nvda $aapl $spy $eth\nCurrent mood:\n\nhttps://youtu.be/e1zvhJRIM7M", "time": 1650690152.0, "sentiment": ""}, {"id": 454243200, "text": "$NVDA let’s see how Monday goes", "time": 1650690149.0, "sentiment": "Bullish"}, {"id": 454242169, "text": "$AMZN $GOOG $AAPL $NVDA $MSFT idiot.  Another conspiracy theorist.  That crap isn’t welcomed here", "time": 1650689709.0, "sentiment": ""}, {"id": 454241527, "text": "$NVDA 4B profits in 2021 and a 500B market cap. That&#39;s bonkers", "time": 1650689387.0, "sentiment": "Bearish"}, {"id": 454241367, "text": "$NVDA this will be under 150. There&#39;s no growth. 30B revenue and a 500B market cap? This is one of the most over valued pieces of junk out there.", "time": 1650689320.0, "sentiment": "Bearish"}, {"id": 454240573, "text": "$NVDA \nPE 53, way higher than other big techs.", "time": 1650688955.0, "sentiment": "Bearish"}, {"id": 454240418, "text": "$SPY $AAPL $MSFT $AMZN $NVDA \n👇 Bulls next week after Big tech Earning crashes.", "time": 1650688887.0, "sentiment": "Bearish"}, {"id": 454240156, "text": "$NVDA hope to see 180 next week", "time": 1650688762.0, "sentiment": "Bearish"}, {"id": 454239907, "text": "$NVDA start accumulating and DCA into your position. Probably more red ahead, but who knows where the bottom is. Play the momentum and short to make money or hedge....don&#39;t let obvious moves go to waste.", "time": 1650688645.0, "sentiment": "Bearish"}, {"id": 454239347, "text": "$NVDA five years from now you BEG FOR THESE PRICES. Start accumulating now and hold your nose through the volatility. By 2030 NVDA is bigger than google. Mark my words", "time": 1650688394.0, "sentiment": "Bullish"}, {"id": 454239141, "text": "$NVDA come on man", "time": 1650688318.0, "sentiment": "Bullish"}, {"id": 454238618, "text": "$NFLX Also when comparing $NFLX to $NVDA . All around getting more of a value play from. Netflix as opposed to nvda. Even though they are both down a massive amount already.", "time": 1650688081.0, "sentiment": ""}, {"id": 454238456, "text": "$AMD $MSFT $AAPL $NVDA multiple compression just starting. You&#39;re going many of the best under 20PE in next 2 years. \nAMD 50 MSFT 180 AAPL 100 NVDA 80", "time": 1650688012.0, "sentiment": ""}, {"id": 454238399, "text": "$SMH $AMD $TSM $NVDA $MU \n \nSemis first tag of the 100wk since March 2020 - could see some choppy action remainder of year akin to this maybe but starting to approach higher value levels:", "time": 1650687984.0, "sentiment": ""}, {"id": 454237321, "text": "$NVDA is this gonna go up? Or another market correction bs?", "time": 1650687528.0, "sentiment": ""}, {"id": 454237201, "text": "$SPY $TSLA $NVDA $FB $AAPL \n\nMy thoughts on the CNBC talking heads  ... \n\nWhen the bear mkts are surging,  Mr. Cramer tells you to buy stock. Tonight after we are already  down 5% in two days,  he is telling viewers to raise cash. He&#39;sthe worst timer. Please don&#39;t listen to Cramer ..\n\nSuper bull JP Morgan&#39;s Marko Kolanovich told us this week get long, the mkt is going higher. Please don&#39;t listen to Marko. \n\nSpeaking of super bulls, Tom Lee of  Fundstrat called for a rip your face off rally in Feb. Ouch. He too is bullish every day. Please don&#39;t listen to Mr. Lee. \n\nThe Njarian Brothers. Jon is the new Demnis Gartman. You do the opposite of him. Please don&#39;t listen to Jon. \n\nJoe Terranova. Joe said get long mega cap when SPY was at 460. Ouch. This week he got long fertilizer names, a sector I love but I was touting months ago. Did he just top it? Don&#39;t listen to Joe. \n\nWho do I respect? Dan Niles, Josh Brown, Mike Santoli and David Faber. \n\nBottom line, don&#39;t rely on talking heads. ✌️", "time": 1650687478.0, "sentiment": ""}, {"id": 454236790, "text": "$NVDA I thought 209 was safe, but looks like not! Now even 150 doesn&#39;t look safe either with fed rate hike looming on our heads! The only thing that could change it is good earnings of the tech companies that will swing the tech stock sentiments back up. Netflix and Verizon didn&#39;t help either. Next week will unfold the mystery.", "time": 1650687315.0, "sentiment": "Bullish"}, {"id": 454236771, "text": "$SPY straight carnage $AMD $NVDA $AMZN", "time": 1650687304.0, "sentiment": ""}, {"id": 454236115, "text": "$AMD $SQ $NVDA  $AAPL $QQQ  everyone is running scared , With their heads down and feeling defeated … and finally closing down their positions .. that’s when u know a reversal is on the horizon. Take a look at the 3 year chart for QQQ.. rsi is about to be oversold. Last time it was as extended as now was in 2020 and look how much it pushed up! MACD is recovering and almost out of the red. Touching support the market made when the war with Ukraine started. Expect a small bounce cause it’s coming", "time": 1650687030.0, "sentiment": "Bullish"}, {"id": 454235448, "text": "$DPLS dpls best performer today $NVDA is on its way to 150 which sucks and dark pulse saving the day", "time": 1650686731.0, "sentiment": ""}, {"id": 454234485, "text": "Sweep Options Activity: $NVDA is the #3 ticker with sweep activity where institutions are trading options urgently with 40.3K sweep contracts, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (Link in profile - @InsiderFinance)", "time": 1650686334.0, "sentiment": ""}, {"id": 454233128, "text": "$NVDA finally looking attractive and time to start nibbling", "time": 1650685784.0, "sentiment": ""}, {"id": 454232850, "text": "Unusual Options Activity: $NVDA is the #29 ticker with unusual activity from institutional traders with an average of 16% out of the money, a leading indicator of market movement.\n\nMarket analysis and options contracts included in screenshot of dashboard from 🔥 INSIDERFINANCE.IO 🔥 (Link in profile - @InsiderFinance)", "time": 1650685663.0, "sentiment": ""}, {"id": 454232710, "text": "@brazilianbruno I am sure how I never got to ban you earlier. This is my chance. $AMD $NVDA", "time": 1650685604.0, "sentiment": "Bullish"}, {"id": 454232704, "text": "$NVDA So Wells Fargo confirmed they lay off undisclosed amount of home lending employees! Shit is coming down soon to real estate??", "time": 1650685600.0, "sentiment": ""}]