[{"id": 454256115, "text": "$NVDA war in ukraine will end over wknd.    In lieu of this fed will release statement that no rate hikes this year planned.     They will further add to economy with stimulus payments.   Covid will be renounced and Fauci will go to prison.    Biden will concede that war with Ukraine was not in US best interest and step down monday.   Trump will be sworn in on emergency cree.   Large cap tech will blow earnings out of the water next week.   And unemployment will fall below 2% bb.   We will re-open keystone pipestream and gas will go down to nationwide average of $2.40.    Inflation will fade over next few weeks rapidly to around 3%.    Dont come to dingle next week calling me a prophecy but this will play out next week starting monday.", "time": 1650697454.0, "sentiment": "Bullish"}, {"id": 454255379, "text": "$NVDA game on!!!!!   5x returns in next 5 years.  Mark it.    Bears come get ya some.", "time": 1650696988.0, "sentiment": "Bullish"}, {"id": 454255216, "text": "$NVDA $160-150 easy by summer!!’ Load puts &amp; SELL CALLS!!! Too easy! Up 775% in 2 months 🤠🥳", "time": 1650696889.0, "sentiment": "Bearish"}, {"id": 454255119, "text": "$NVDA really hope we see a green week next week", "time": 1650696830.0, "sentiment": ""}, {"id": 454254204, "text": "$NVDA Given I am bag holding $AMD, I am setting my entry at 130", "time": 1650696267.0, "sentiment": ""}, {"id": 454253234, "text": "$NVDA NVDA 2022-04-22 Daily Forecast Video: \nhttps://www.youtube.com/watch?v=XppNf_hjATE", "time": 1650695646.0, "sentiment": ""}, {"id": 454252971, "text": "$NVDA on the cusp of a waterfall collapse. Lowest weekly close since Aug 2021 wiping out billions of dollars of paper profits. Looks like crypto miners will be ordering less chips and hardware since most miners are debt ridden and their balance sheets will be put to the test when interest rates skyrocket in the next 24 months. Get over it bulls, the bear is out of hibernation and he has a taste for blood! $QQQ $SPY $DIA $TSLA", "time": 1650695479.0, "sentiment": "Bearish"}, {"id": 454252420, "text": "$NVDA bad mouth can ruin and crash the market welcome to shitty manipulate market", "time": 1650695147.0, "sentiment": ""}, {"id": 454251629, "text": "$NVDA This trendline broke today on every higher time frame except the monthly. There are plenty of other trendlines to bounce on (more pain ahead), but they really tried to save this one today. NVDA needs to close the month out at or above 197(and turn around quickly in May) for this uptrend to remain valid.", "time": 1650694703.0, "sentiment": ""}, {"id": 454251599, "text": "$NVDA it appears no one on this message board knows that inflation has not peaked. The dollar will continue to devalue with mandatory spending. That’s how the Federal Reserve bank works. The debt will never be paid back. Ever. So tax rate increases are useless to help the bloated fake economy. Just admit that retail is caught holding the MM bags lol. That’s what you get when you allow a private bank to regular your currency lmao!!!!! Mic drops in this bitch.", "time": 1650694686.0, "sentiment": "Bearish"}, {"id": 454251490, "text": "$NVDA Would love to see 180 first and if the markets collapse then 140 would be the next level", "time": 1650694625.0, "sentiment": "Bearish"}, {"id": 454250776, "text": "$NVDA nasdaq is at March 14th level where it was pricing in 50 base points hike. If we get 25 we go super green.  50 will be pretty bullish too. 75 is a disaster.  Balance sheet run off is getting priced in too.", "time": 1650694190.0, "sentiment": ""}, {"id": 454250731, "text": "$NVDA Every gamer loves nvidia cards not because the name it&#39;s because nvidia are the best cards period. \nThe problem is everything is upside down right now first was the pandemic then when the economy was trying to recover the fuc**** \nPutin started the war in Ukraine but NVDA will recover to all time high.", "time": 1650694162.0, "sentiment": "Bullish"}, {"id": 454250590, "text": "$NVDA   Inflation is a Cancer For Growth  Companies. \nInflation  for March  2022.                                                     8.54 % \nInflation  under Trump&#39;s last full month  Dec 2020,   1.36 % \nThat is and increase in a little over a year of                 7.18 % \n \nWhen Brandon  blames Putin for the increase \nInflation  in January 2022 before the war started was.   7.48 % \n \nA major contributor is the increase  is oil.  Until this administration  \nstops it war on energy and starts drilling this inflation will not stop. \n \nNot a  optimistic picture.", "time": 1650694071.0, "sentiment": ""}, {"id": 454250531, "text": "$NVDA fundamentals earnings mean nothing these days, stock market is just a forum to transfer money from retail investors to hedgies!", "time": 1650694031.0, "sentiment": ""}, {"id": 454250394, "text": "$GOOGL $NVDA agree, market gonna turn as soon as it realizes Fed can’t raise 10 times...this is psychological theater what the fed is doing. Economy will slow in q2 and that will likely make the fed more dovish I would think which would boost market", "time": 1650693956.0, "sentiment": ""}, {"id": 454250012, "text": "$NVDA  With rates going up by 0.50 points it will be interesting to see bigger cracks", "time": 1650693738.0, "sentiment": ""}, {"id": 454249989, "text": "$GOOGL $NVDA Inflation peaked.  Not going down either.  If fed Don&#39;t raise more than 50 points market will turn green. 50 priced in. 75 will be big no go", "time": 1650693729.0, "sentiment": ""}, {"id": 454249892, "text": "$NVDA fucked badly lol", "time": 1650693677.0, "sentiment": ""}, {"id": 454249810, "text": "$NVDA  135 please", "time": 1650693634.0, "sentiment": ""}, {"id": 454248173, "text": "$NVDA GIFT. I’ll keep buying all the down. Bring it.", "time": 1650692684.0, "sentiment": "Bullish"}, {"id": 454247981, "text": "$NVDA The top 350 divided by 2 = 175.", "time": 1650692578.0, "sentiment": ""}, {"id": 454247942, "text": "$NVDA $AMD $CRM $ADBE   getting scewed really bad 🤕 in these. Are 2024 Jan calls safe?", "time": 1650692556.0, "sentiment": "Bullish"}, {"id": 454247910, "text": "$FUBO BS foolish traders. Very SM article and news life cams gave stated during their conversation about this stock that is has been destroyed and yet not once has management defended it as to why.  $TSLA or $NVDA Would have.  They knew it was shat and let traders get destroyed.  And now they step up and blame it in the market ? \nLook at the dates fools.  It starred here right after earnings at 34$ in after hours.  So quit using Excuses that satisfy your losses because your ego can’t deal with it and look at a chart and see if this is the trusting management that you want to invest in or just trade the stock like a Stocktwits fomo stock it will become  Now that it is below four months the $10 threshold that institutions even want to look at....", "time": 1650692535.0, "sentiment": ""}, {"id": 454247415, "text": "$NVDA $TSLA beauty and the beast..... It&#39;s all a market trade! \nhttps://www.stockbookie.com/nvda-tsla-technical-analysis-4-22-2022/", "time": 1650692242.0, "sentiment": ""}, {"id": 454247306, "text": "$SPY $AMZN $AMD $NVDA 😵", "time": 1650692186.0, "sentiment": ""}, {"id": 454246555, "text": "$NVDA Are they really going to pay those 190 puts next week?  Doubt it.   Max pain = 220", "time": 1650691788.0, "sentiment": "Bullish"}, {"id": 454246478, "text": "$NVDA be patient.", "time": 1650691744.0, "sentiment": "Bullish"}, {"id": 454246200, "text": "$NVDA seriously thinking about sell all other’s and limit my portfolio to $NVDA, $AAPL, $O, $BRK.B and $SCHB. There is no legit reason why Nvidia and Apple are down. The current price points are huge bargains. Imo", "time": 1650691603.0, "sentiment": "Bullish"}, {"id": 454246173, "text": "$NVDA The reality is that anyone who bought puts in the first half of the day made money.", "time": 1650691588.0, "sentiment": "Bearish"}]