[{"id": 454231844, "text": "$NVDA broke my rule of staying away from tech in this rising interest environment. Got burned and moving along.", "time": 1650685244.0, "sentiment": ""}, {"id": 454231354, "text": "$SNAP, $AMD , $AAPL , $NVDA , $FB", "time": 1650685047.0, "sentiment": "Bullish"}, {"id": 454231273, "text": "$NVDA a sad way to make money on this oversold company", "time": 1650685010.0, "sentiment": ""}, {"id": 454230972, "text": "$NVDA ~150 will be next support", "time": 1650684880.0, "sentiment": "Bearish"}, {"id": 454230893, "text": "$ROKU $TSLA $NVDA $AMZN \nBitcoin Mining ⚒\nLife is 10% what happens to you and 90% how you react to it, learn how to mine and earn  8% - 10% daily profits cloud mining bitcoins from home with the aid of your laptop or desktop computer 🖥. Dm for more information.", "time": 1650684851.0, "sentiment": ""}, {"id": 454230407, "text": "$INTC $AAPL $AMD $NVDA The king of chips $TSM os the better investment lower PE higher Revenues  and a much larger net earnings one can only dream off. Now the the king of Tech Apple is about to partner with the king of chips with TSM new 2nm Node. Intel is years behind and they’ll never catch up to the king of chips. You really think intel can compete haha. FYI AMD has an intrinsic Value of $38 and I’m thinking NVDAs intrinsic value is around $85 I’ll come back with the numbers and  for the laggard Intel we have an intrinsic value of $26 \n\nhttps://www.tomshardware.com/news/apple-intel-tsmc-2nm-node", "time": 1650684652.0, "sentiment": "Bullish"}, {"id": 454230268, "text": "$SPY $TSLA $AAPL $FB $NVDA \n\nMy thoughts on the mkt action this past week \n\nFirst off, ive consistently been telling my members that these big rallies are bear mkt rallies, that I am a seller into any strength. And it hasn&#39;t been easy to remain in that camp  - not when the &quot;experts&quot; on CNBC  continously tout how bullish they are.  Not when we have 150 handle rallies in just three days. But I&#39;ve been in multiple bear mkts and that is exactly the type of action you get. \n\nMy Game Plan for next week  goes out on Sunday and it may be my most important one yet (email me at jessielivermore1929@gmail.com if you want to join). \n\nWhy so important? Because next week is one of the most important weeks this mkt has had in years. Big cap tech earnings are going to create a massive selloff or a relief bounce. PCE is going to spark future fear or a calming effect. And our technical levels are going to be tested. \n\nFor those who subscribe, I look forward to sending out this weekend&#39;s Game Plan Sun ✌️", "time": 1650684597.0, "sentiment": ""}, {"id": 454229879, "text": "$NVDA aight well I’m out of this ✌️not a bear or a bull atm - I think the entire market is gonna go through some shit over the next 2-3 months. Will be back when things calm down", "time": 1650684434.0, "sentiment": ""}, {"id": 454229628, "text": "$NVDA to hold this &quot;death spiral&quot; with earnings coming out and the possibility of not good guidance--u have 2 b an idiot noo b baby boy cause this will drop 30-40 points in a day.", "time": 1650684338.0, "sentiment": ""}, {"id": 454229392, "text": "$nvda $msft remember if they don&#39;t like stuff like this they don&#39;t like your shitty stock", "time": 1650684241.0, "sentiment": ""}, {"id": 454228210, "text": "$NVDA has a better Altman-Z score than 92% of its industry peers. https://www.chartmill.com/stock/analyzer/stock/NVDA?view=fundamental-analysis&amp;key=38672586-ebbc-43dd-8896-b9472a8ec477&amp;utm_source=stocktwits&amp;utm_medium=FA&amp;utm_content=NVDA&amp;utm_campaign=social_tracking", "time": 1650683760.0, "sentiment": ""}, {"id": 454227642, "text": "$SPY Daytraders took a vantage of the opportunity today. \n\nThey were able to spot a little weakness and take a vantage of stops that’s all. \n\nShits over and was over-sold    \n\nOn every time frame. Over shorted everything’s gana squeeze everything \n\n    $AMZN  $AAPL  $NVDA $QQQ", "time": 1650683545.0, "sentiment": "Bullish"}, {"id": 454227146, "text": "$NVDA NVDA 2022-04-22 Daily Forecast Video: \nhttps://www.youtube.com/watch?v=XppNf_hjATE", "time": 1650683353.0, "sentiment": ""}, {"id": 454226270, "text": "$NVDA 215 to 195 in 2 days of trading. You do the math on these Puts. LFG!", "time": 1650683022.0, "sentiment": "Bearish"}, {"id": 454225954, "text": "$NVDA all stocks get pissed off. Is this the beginning of recession?", "time": 1650682909.0, "sentiment": ""}, {"id": 454225375, "text": "$NVDA I noticed Arkk is doing much better than Tqqq this whole week 🤬", "time": 1650682691.0, "sentiment": ""}, {"id": 454225159, "text": "$NVDA why is this shit still tanking AH? 😂", "time": 1650682605.0, "sentiment": ""}, {"id": 454224998, "text": "$NVDA trading is so much more refreshing and easier when you aren’t glued to it 24/7 as I once was. Only jump in a trade when opportunities show themselves to you, whatever direction it may be. This should be a fun one if it can hold the monthly 20ma. Always. buy. a. monthly. support. 👏🏽👏🏽 $SPY $QQQ $AMD", "time": 1650682536.0, "sentiment": ""}, {"id": 454224405, "text": "$NVDA - NVDA Happy Friday - was trending today - see where it is on the leaderboard 👇(Hint - it&#39;s in the top 20)", "time": 1650682326.0, "sentiment": "Bullish"}, {"id": 454224338, "text": "$nvda brutal https://youtu.be/B7h3WrKzKwo", "time": 1650682305.0, "sentiment": ""}, {"id": 454224195, "text": "$NVDA load up during this period. 2-3 years from now living the good life", "time": 1650682256.0, "sentiment": "Bullish"}, {"id": 454223875, "text": "$NVDA lows for the month in?", "time": 1650682139.0, "sentiment": ""}, {"id": 454223569, "text": "$SPY $AAPL $NVDA \nLooks like Sell in May and GTFO\nStarted early…", "time": 1650682030.0, "sentiment": ""}, {"id": 454223174, "text": "$NFLX some gains from this company is def doing well 🩸💯♥️🎈🎁🚨💥💵🤑🔥🏆 $SPY $NVDA  Chip shortage 🤣 5k to 25k ?", "time": 1650681885.0, "sentiment": "Bearish"}, {"id": 454223097, "text": "$NVDA Bought an OTM call option las6 minute of the day and it dropped 33% in value instantly! What is this shit? A glitch? \n\nThere are further out OTM calls than mine that are worth more. It better be a glitch! Otherwise, I&#39;ll never buy a last minute option. Scamming bastards!", "time": 1650681854.0, "sentiment": "Bullish"}, {"id": 454222850, "text": "$NVDA  \n \nNVDA relative to SMH", "time": 1650681759.0, "sentiment": ""}, {"id": 454222813, "text": "$NVDA now its below $200, was above $330 not too long ago?", "time": 1650681746.0, "sentiment": "Bearish"}, {"id": 454222131, "text": "$AMZN $GOOG $AAPL $NVDA $MSFT  \nThe Fed wants the markets down &amp; if you understand that this is the plot then your train of thought should be this. \n \nNot until Apple is @ $91.47 a 50% decline from ATH  \n \nNot until AMZN is @ $1886.54  \n \nNot until TSLA is @ $621.49 \n \nNot until GOOG is @ $1521  \n \nuntil then markets are NOT likely to see relief .   Most other stock are down by 40-70% aka &quot;crash&quot;  \n \nTHIS IS WHAT THE FED WANTS because the illusion right now has become too expensive to maintain.  \n \nGood, Bad or Indifferent this is just how it is currently.  The Fed simply printed too many paper/digital dollars", "time": 1650681504.0, "sentiment": ""}, {"id": 454221824, "text": "$NVDA Nothing more annoying than the &quot;I told you so&quot; after-the-fact douchebags who just have to chime in over and over again...", "time": 1650681400.0, "sentiment": ""}, {"id": 454220989, "text": "$GOOGL $AMZN $NVDA Be like my 1st wife", "time": 1650681121.0, "sentiment": "Bearish"}]